{
    "0": "Article 1: The Republic and its territories\n1. Pakistan shall be Federal Republic to be known as the Islamic Republic of Pakistan, hereinafter referred to as Pakistan.\n2. The territories of Pakistan shall comprise :-\na. the Provinces of\n1. Balochistan, 2. Khyber Pakhtunkhwa, 3.Punjab and 4. Sindh;\nb. the Islamabad Capital Territory, hereinafter referred to as the Federal Capital;\nc. the Federally Administered Tribal Areas; and\nd. such States and territories as are or may be included in Pakistan, whether by accession or otherwise\n3. Majlis-e-Shoora (Parliament) may by law admit into the Federation new States or areas on such terms and conditions as it thinks fit.",
    "1": "Article 2: Islam to be State religion\nIslam shall be the State religion of Pakistan",
    "2": "Article 2A: The Objectives Resolution to form part of substantive provisions\nThe principles and provisions set out in the objectives Resolution reproduced in the Annex are hereby made substantive part of the Constitution and shall have effect accordingly.",
    "3": "Article 3: Elimination of exploitation\nThe State shall ensure the elimination of all forms of exploitation and the gradual fulfillment of the fundamental principle, from each according to his ability to each according to his work",
    "4": "Article 4: Right of individuals to be dealt with in accordance with law, etc\n1. To enjoy the protection of law and to be treated in accordance with law is the inalienable right of every citizen, wherever he may be, and of every other person for the time being within Pakistan.\n2. In particular-\na. no action detrimental to the life, liberty, body, reputation or property of any person shall be taken except in accordance with law\nb. no person shall be prevented from or be hindered in doing that which is not prohibited by law; and\nc. no person shall be compelled to do that which the law does not require him to do",
    "5": "Article 5: Loyalty to State and obedience to Constitution and law\n1. Loyalty to the State is the basic duty of every citizen.\n2. Obedience to the Constitution and law is the inviolable obligation of every citizen wherever he may be and of  every other person for the time being within Pakistan.",
    "6": "Article 6: High treason\n1. Any person who abrogates or subverts or suspends or holds in abeyance, or attempts or conspires to abrogate or subvert or suspend or hold in abeyance, the Constitution by use of force or show of force or by any other unconstitutional means shall be guilty of high treason.\n\n2. Any person aiding or abetting or collaborating the acts mentioned in clause (1) shall likewise be guilty of high treason.\n2A. An act of high treason mentioned in clause (1) or clause (2) shall not be validated by any court including the Supreme Court and a High Court.                                                                                \n3. Majlis-e-Shoora (Parliament) shall by law provide for the punishment of persons found guilty of high treason.",
    "7": "Article 7: Definition of the State\nIn this Part, unless the context otherwise requires, \"the State\" means the Federal Government, Majlis-e-Shoora (Parliament), a Provincial Government, a Provincial Assembly, and such local or other authorities in Pakistan as are by law empowered to impose any tax or cess.",
    "8": "Article 8: Laws inconsistent with or in derogation of fundamental rights to be void\n1. Any law, or any custom or usage having the force of law, in so far as it is inconsistent with the rights conferred by this Chapter, shall, to the extent of such inconsistency, be void.\n2. The State shall not make any law which takes away or abridges the rights so conferred and any law made in contravention of this clause shall, to the extent of such contravention, be void.\n3. The provisions of this Article shall not apply to-\na. any law relating to members of the Armed Forces, or of the police or of such other forces as are charged with the maintenance of public order, for the purpose of ensuring the proper discharge of their duties or the maintenance of discipline among them; or\nb. any of the-\ni. laws specified in the First Schedule as in force immediately before the commencing day or as amended by any of the laws specified in that Schedule;\nii. other laws specified in Part I of the First Schedule; and no such law nor any provision thereof shall be void on the ground that such law or provision is inconsistent with, or repugnant to, any provision of this Chapter.\n4. Notwithstanding anything contained in paragraph (b) of clause (3), within a period of two years from the commencing day, the appropriate Legislature shall bring the laws specified in Part II of the First Schedule into conformity with the rights conferred by this Chapter: Provided that the appropriate Legislature may by resolution extend the said period of two years by a period not exceeding six months.\nExplanation:- If in respect of any law Majlis-e-Shoora (Parliament) is the appropriate Legislature, such resolution shall be a resolution of the National Assembly.\n5. The rights conferred by this Chapter shall not be suspended except as expressly provided by the Constitution.",
    "9": "Article 9: Security of person\nNo person shall be deprived of life or liberty saves in accordance with law.",
    "10": "Article 10: Safeguards as to arrest and detention\n1. No person who is arrested shall be detained in custody without being informed, as soon as may be, of the\ngrounds for such arrest, nor shall he be denied the right to consult and be defended by a legal practitioner of his choice.\n2. Every person who is arrested and detained in custody shall be produced before a magistrate within a period of twenty-four hours of such arrest, excluding the time necessary for the journey from the place of arrest to the court of the nearest magistrate, and no such person shall be detained in custody beyond the said period without the authority of a magistrate.\n3. Nothing in clauses (1) and (2) shall apply to any person who is arrested or detained under any law providing for preventive detention.\n4. No law providing for preventive detention shall be made except to deal with persons acting in a manner prejudicial to the integrity, security or defence of Pakistan or any part thereof, or external affairs of Pakistan, or public order, or the maintenance of supplies or services, and no such law shall authorise the detention of a person for a period exceeding three months unless the appropriate Review Board has, after affording him an opportunity of being heard in person, reviewed his case and reported, before the expiration of the said period,\nthat there is, in its opinion, sufficient cause for such detention, and, if the detention is continued after the said period of three months, unless the appropriate Review Board has reviewed his case and reported, before the expiration of each period of three months, that there is, in its opinion, sufficient cause for such detention.\nExplanation I.- In this Article, \"the appropriate Review Board\" means,-\ni. in the case of a person detained under a Federal law, a Board appointed by the Chief Justice of Pakistan and consisting of a Chairman and two other persons, each of whom is or has been a\nJudge of the Supreme Court or a High Court; and\nii. in the case of a Person detained under a Provincial law, a Board appointed by the Chief Justice of the High Court concerned and consisting of a Chairman and two other persons, each of whom is or\nhas been a Judge of a High Court.\nExplanation II.- The opinion of a Review Board shall be expressed in terms of the views of the majority of its members.\n5. When any person is detained in pursuance of an order made under any law providing for preventive detention, the authority making the order shall, within fifteen days from such detention, communicate to such person the grounds on which the order has been made, and shall afford him the earliest opportunity of\nmaking a representation against the order: Provided that the authority making any such order may refuse to disclodisclose facts which such authority considers it to be against the public interest to disclose.\n6. The authority making the order shall furnish to the appropriate Review Board all documents relevant to the case unless a certificate, signed by a Secretary to the Government concerned, to the effect that it is not in the public interest to furnish any documents, is produced.\n7. Within a period of twenty-four months commencing on the day of his first detention in pursuance of an order made under a law providing for preventive detention, no person shall be detained in pursuance of any such order for more than a total period of eight months in the case of a person detained for acting in a\nmanner prejudicial to public order and twelve months in any other case: Provided that this clause shall not apply to any person who is employed by, or works for, or acts on instructions received from, the enemy or who is acting or attempting to act in a manner prejudicial to the integrity, security or defence of\nPakistan or any part thereof or who commits or attempts to commit any act which amounts to an anti-national activity as defined in a Federal law or is a m ember of any association which has for its objects, or which indulges in, any such antinational activity.\n8. The appropriate Review Board shall determine the place of detention of the person detained and fix a reasonable subsistence allowance for his family.\n9. Nothing in this Article shall apply to any person who for the time being is an enemy alien.",
    "11": "Article 10A: Right to fair trial\nFor the determination of his civil rights and obligations or in any criminal charge against him a person shall be entitled to a fair trial and due process.",
    "12": "Article 11: Slavery, forced labour, etc., prohibited\n1. Slavery is non-existent and forbidden and no law shall permit or facilitate its introduction into Pakistan in any form.\n2. All forms of forced labour and traffic in human beings are prohibited.\n3. No child below the age of fourteen years shall be engaged in any factory or mine or any other hazardous employment.\n4. Nothing in this Article shall be deemed to affect compulsory service-                                                       \na. by any person undergoing punishment for an offence against any law; or\nb. required by any law for public purpose: Provided that no compulsory service shall be of a cruel nature or\nincompatible with human dignity.",
    "13": "Article 12: Protection against retrospective punishment\n1. No law shall authorize the punishment of a person-\na. for an act or omission that was not punishable by law at the time of the act or omission; or\nb. for an offence by a penalty greater than, or of a kind different from, the penalty prescribed by law for that offence at the time the offence was committed.\n2. Nothing in clause (1) or in Article 270 shall apply to any law making acts of abrogation or subversion of a Constitution in force in Pakistan at any time since the twenty-third day of March, one thousand nine hundred and fifty-six, an offence.",
    "14": "Article 13: Protection against double punishment and self incrimination\nNo person-\n(a) shall be prosecuted or punished for the same offence more than\nonce; or\n(b) shall, when accused of an offence, be compelled to be a witness\nagainst himself.",
    "15": "Article 14: Inviolability of dignity of man, etc\n1. The dignity of man and, subject to law, the privacy of home, shall be inviolable.\n2. No person shall be subjected to torture for the purpose of extracting evidence.",
    "16": "Article 15: Freedom of movement, etc\nEvery citizen shall have the right to remain in, and, subject to any reasonable restriction imposed by law in the public interest, enter and move freely throughout Pakistan and to reside and settle in any part thereof.",
    "17": "Article 16: Freedom of assembly\nEvery citizen shall have the right to assemble peacefully and without arms, subject to any reasonable restrictions imposed by law in the interest of public order.",
    "18": "Article 17: Freedom of association\n1. Every citizen shall have the right to form associations or unions, subject to any reasonable restrictions imposed by law in the interest of sovereignty or integrity of Pakistan, public order or morality.\n2. Every citizen, not being in the service of Pakistan, shall have the right to form or be a member of a political party, subject to any reasonable restrictions imposed by law in the interest of the sovereignty or integrity of\nPakistan and such law shall provide that where the Federal Government declares that any political party has been formed or is operating in a manner prejudicial to the sovereignty or integrity of Pakistan, the Federal Government shall, within fifteen days of such declaration, refer the matter to the Supreme\nCourt whose decision on such reference shall be final.\n3. Every political party shall account for the source of its funds in accordance with law.",
    "19": "Article 18: Freedom of trade, business or profession\nSubject to such qualifications, if any, as may be prescribed by law, every citizen shall have the\nright to enter upon any lawful profession or occupation, and to conduct any lawful\ntrade or business:\nProvided that nothing in this Article shall prevent-\na. the regulation of any trade or profession by a licensing system; or\nb. the regulation of trade, commerce or industry in the interest of free competition therein; or\nc. the carrying on, by the Federal Government or a Provincial Government, or by a corporation controlled by any such Government, of any trade, business, industry or service, to the exclusion, complete or partial, of other persons.",
    "20": "Article 19: Freedom of speech\nEvery citizen shall have the right to freedom of speech and expression, and there shall be freedom of the press, subject to any reasonable restrictions imposed by law in the interest of the glory of Islam or the integrity, security or defence of Pakistan or any part thereof, friendly relations with foreign States, public order, decency or morality, or in relation to contempt of court, commission of or incitement to an offence.",
    "21": "Article 19A: Right to information\nEvery citizen shall have the right to have access to information in all matters of public importance subject to regulation and reasonable restrictions imposed by law.",
    "22": "Article 20: Freedom to profess religion and to manage religious institutions\nSubject to law, public order and morality,\na. every citizen shall have the right to profess, practise and propagate his religion; and\nb. every religious denomination and every sect thereof shall have the right to establish, maintain and manage its religious institutions.",
    "23": "Article 21: Safeguard against taxation for purposes of any particular religion.\nNo person shall be compelled to pay any special tax the proceeds of which are to be spent on the propagation or maintenance of any religion other than his own.",
    "24": "Article 22: Safeguards as to educational institutions in respect of religion, etc\n1. No person attending any educational institution shall be required to receive religious instruction, or take part in any religious ceremony, or attend religious worship, if such instruction, ceremony or worship relates to a religion other than his own.\n2. In respect of any religious institution, there shall be no discrimination against any community in the granting of exemption or concession in relation to taxation.\n3. Subject to law,\na. no religious community or denomination shall be prevented from providing religious instruction for pupils of that community or denomination in any educational institution maintained wholly by that community or denomination; and\nb. no citizen shall be denied admission to any educational institution receiving aid from public revenues on the ground only of race, religion, caste or place of birth.\n4. Nothing in this Article shall prevent any public authority from making provision for the advancement of any socially or educationally backward class of citizens.",
    "25": "Article 23: Provision as to property\nEvery citizen shall have the right to acquire, hold and dispose of property in any part of Pakistan, subject to the Constitution and any reasonable restrictions imposed by law in the public interest.",
    "26": "Article 24: Protection of property rights\n1. No person shall be compulsorily deprived of his property save in accordance with law.\n2. No property shall be compulsorily acquired or taken possession of save for a public purpose, and save by the authority of law which provides for compensation therefore and either fixes the amount of compensation or specifies the principles on and the manner in which compensation is to be determined and given.\n3. Nothing in this Article shall affect the validity of-\na. any law permitting the compulsory acquisition or taking possession of any property for preventing danger to life, property or public health; or\nb. any law permitting the taking over of any property which has been acquired by, or come into the possession of, any person by any unfair means, or in any manner, contrary to law; or\nc. any law relating to the acquisition, administration or disposal of any property which is or is deemed to be enemy property or evacuee property under any law (not being property which has ceased to be\nevacuee property under any law); or\nd. any law providing for the taking over of the management of any property by the State for a limited period, either in the public interest or in order to secure the proper management of the property, or for\nthe benefit of its owner; or\ne. any law providing for the acquisition of any class of property for the purpose of-\ni. providing education and medical aid to all or any specified class of citizens; or                                   ii. providing housing and public facilities and services such as roads, water supply, sewerage, gas and electric power to all or any specified class of citizens; or                                                                          iii. providing maintenance to those who, on account of unemployment, sickness, infirmity or old age, are unable to maintain themselves; or\nf. any existing law or any law made in pursuance of Article 253.\n4. The adequacy or otherwise of any compensation provided for by any such law as is referred to in this Article, or determined in pursuance thereof, shall not be called in question in any court.",
    "27": "Article 25: Equality of citizens\n1. All citizens are equal before law and are entitledto equal protection of law.\n2. There shall be no discrimination on the basis of sex.\n3. Nothing in this Article shall prevent the State from making any special provision for the protection of women and children.",
    "28": "Article 25A: Right to education\nThe State shall provide free and compulsory education to all children of the age of five to sixteen years in such manner as may be determined by law.",
    "29": "Article 26: Non-discrimination in respect of access to public places\n1. In respect of access to places of public entertainment or resort not intended for religious\npurposes only, there shall be no discrimination against any citizen on the ground only of race, religion, caste, sex, residence or place of birth.\n2. Nothing in clause (1) shall prevent the State from making any special provision for women and children.",
    "30": "Article 27: Safeguard against discrimination in services\n1. No citizen otherwise qualified for appointment in the service of Pakistan shall be discriminated against\nin respect of any such appointment on the ground only of race, religion, caste, sex, residence or place of birth.\nProvided that, for a period not exceeding forty years from the commencing day, posts may be reserved for persons belonging to any class or area to secure their adequate representation in the service of Pakistan.\nProvided further that, in the interest of the said service, specified posts or services may be reserved for members of either sex if such posts or services entail the performance of duties and functions which cannot be adequately performed by members of the other sex.\nProvided also that under-representation of any class or area in the service of Pakistan may be redressed in such manner as may be determined by an Act of Majlis-e-Shoora (Parliament).\n2. Nothing in clause (1) shall prevent any Provincial Government, or any local or other authority in a Province, from prescribing, in relation to any post or class of service under that Government or authority, conditions as to residence in the Province, for a period not exceeding three years, prior to appointment under that Government or authority.",
    "31": "Article 28: Preservation of language, script and culture\nSubject to Article 251 any section of citizens having a distinct language, script or culture shall have the right\nto preserve and promote the same and subject to law, establish institutions for that purpose.",
    "32": "Article 29: Principles of Policy\n1. The Principles set out in this Chapter shall be known as the Principles of Policy, and it is the responsibility of each organ and authority of the State, and of each person performing functions on behalf of an\norgan or authority of the State, to act in accordance with those Principles in so far as they relate to the functions of the organ or authority.\n2. In so far as the observance of any particular Principle of Policy may be dependent upon resources being available for the purpose, the Principle shall be regarded as being subject to the availability of resources.\n3. In respect of each year, the President in relation to the affairs of the Federation, and the Governor of each Province in relation to the affairs of his Province, shall cause to be prepared and laid before the each House of Majlis-e-Shoora (Parliament) or, as the case may be, the Provincial Assembly, a report on the observance and implementation of the Principles of Policy, and provision shall be made in the rules of procedure of the National Assembly and the Senate or, as the case may be, the Provincial Assembly, for discussion on such report.",
    "33": "Article 30: Responsibility with respect to Principles of Policy\n1. The responsibility of deciding whether any action of an organ or authority of the State, or of a person performing functions on behalf of an organ or authority of the State, is in accordance with the Principles of Policy is that of the organ or authority of the State, or of the person, concerned.\n2. The validity of an action or of a law shall not be called in question on the ground that it is not in accordance with the Principles of Policy, and no action shall lie against the State or any organ or authority of the State or any person on such ground.",
    "34": "Article 31: Islamic way of life\n1. Steps shall be taken to enable the Muslims of Pakistan, individually and collectively, to order their lives in accordance with the fundamental principles and basic concepts of Islam and to provide facilities\nwhereby they may be enabled to understand the meaning of life according to the Holy Quran and Sunnah.\n2. The state shall endeavour, as respects the Muslims of Pakistan,-\na. to make the teaching of the Holy Quran and Islamiat compulsory, to encourage and facilitate the learning of Arabic language and to secure correct and exact printing and publishing of the Holy Quran;\nb. to promote unity and the observance of the Islamic moral standards; and\nc. to secure the proper organisation of zakat, ushr, auqaf and mosques.",
    "35": "Article 32: Promotion of local Government institutions\nThe State shall encourage local Government institutions composed of elected representatives of the areas\nconcerned and in such institutions special representation will be given to peasants, workers and women.",
    "36": "Article 33: Parochial and other similar prejudices to be discouraged\nThe State shall discourage parochial, racial, tribal sectarian and provincial prejudices among the citizens.",
    "37": "Article 34: Full participation of women in national life\nSteps shall be taken to ensure full participation of women in all spheres of national life.",
    "38": "Article 35: Protection of family, etc\nThe State shall protect the marriage, the family, the mother and the child.",
    "39": "Article 36: Protection of minorities\nThe State shall safeguard the legitimate rights and interests of minorities, including their due representation in the Federal and Provincial services.",
    "40": "Article 37: Promotion of social justice and eradication of social evils\nThe State shall-\na. promote, with special care, the educational and economic interests of backward classes or areas.\nb. remove illiteracy and provide free and compulsory secondary education within minimum possible period.\nc. make technical and professional education generally available and higher education equally accessible to all on the basis of merit.\nd. ensure inexpensive and expeditious justice.\ne. make provision for securing just and humane conditions of work, ensuring that children and women are not employed in vocations unsuited to their age or sex, and for maternity benefits for women in employment.\nf. enable the people of different areas, through education, training, agricultural and industrial development and other methods, to participate fully in all forms of national activities, including employment in the service of Pakistan.\ng. prevent prostitution, gambling and taking of injurious drugs, printing, publication, circulation and display of obscene literature and advertisements;\nh. prevent the consumption of alcoholic liquor otherwise than for medicinal and, in the case of non-Muslims, religious purposes; and\ni. decentralise the Government administration so as to facilitate expeditious disposal of its business to meet the convenience and requirements of the public.",
    "41": "Article 38: Promotion of social and economic well-being of the people\nThe State shall-\na. secure the well-being of the people, irrespective of sex, caste, creed or race, by raising their standard of living, by preventing the concentration of wealth and means of production and distribution in\nthe hands of a few to the detriment of general interest and by ensuring equitable adjustment of rights between employers and employees, and landlords and tenants.\nb. provide for all citizens, within the available resources of the country, facilities for work and adequate livelihood with reasonable rest and leisure.\nc. provide for all persons employed in the service of Pakistan or otherwise, social security by compulsory social insurance or other means.\nd. provide basic necessities of life, such as food, clothing, housing, education and medical relief, for all such citizens, irrespective of sex, caste, creed or race, as are permanently or temporarily unable to\nearn their livelihood on account of infirmity, sickness or unemployment.\ne. reduce disparity in the income and earnings of individuals, including persons in the various classes of the service of Pakistan.\nf. eliminate riba as early as possible; and\ng. ensure that the shares of the Provinces in all Federal services, including autonomous bodies and corporations established by, or under the control of, the Federal Government, shall be secured and any omission in the allocation of the shares of the Provinces in the past shall be rectified.",
    "42": "Article 39: Participation of people in Armed Forces\nThe State shall enable people from all parts of Pakistan to participate in the Armed Forces of Pakistan.",
    "43": "Article 40: Strengthening bonds with Muslim world and promoting international peace\nThe State shall endeavour to preserve and strengthen fraternal relations among Muslim countries based on Islamic unity, support the common interests of the peoples of Asia, Africa and Latin America, promote international peace and security, foster goodwill and friendly relations among all nations and encourage the settlement of international disputes by peaceful means.",
    "44": "Article 41: The President\n1. There shall be a President of Pakistan who shall be the Head of State and shall represent the unity of the Republic.\n2. A person shall not be qualified for election as President unless he is a Muslim of not less than forty-five years of age and is qualified to be elected as member of the National Assembly.\n3. The President shall be elected in accordance with the provisions of the Second Schedule by the members of an electoral college consisting of:\na the members of both Houses; and\nb. the members of the Provincial Assemblies.\n4. Election to the office of President shall be held not earlier than sixty days and not later than thirty days before the expiration of the term of the President in office: Provided that, if the election cannot be held within the period aforesaid because the National Assembly is dissolved, it shall be held within thirty days of\nthe general election to the Assembly.\n5. An election to fill a vacancy in the office of President shall be held not later than thirty days from the occurrence of the vacancy: Provided that, if the election cannot be held within the period aforesaid\nbecause the National Assembly is dissolved, it shall be held within thirty days of the general election to the Assembly.\n6. The validity of the election of the President shall not be called in question by or before any court or other authority.",
    "45": "Article 42: Oath of President\nBefore entering upon office, the President shall make before the Chief Justice of Pakistan oath in the form set out in the Third Schedule.",
    "46": "Article 43: Conditions of President's office\n1. The President shall not hold any office of profit in the service of Pakistan or occupy any other position carrying the right to remuneration for the rendering of services.\n2. The President shall not be a candidate for election as a member of Majlis-e-Shoora (Parliament) or a Provincial Assembly; and, if a member of Majlise- Shoora (Parliament) or a Provincial Assembly is elected as President, his seat in Majlis-e-Shoora (Parliament) or, as the case may be, the Provincial Assembly shall become vacant on the day he enters upon his office.",
    "47": "Article 44: Term of office of President\n1. Subject to the Constitution, the President shall hold office for a term of five years from the day he enters upon his office: Provided that the President shall, notwithstanding the expiration of his terms, continue to hold office until his successor enters upon his office.\n2. Subject to the Constitution, a person holding office as President shall be eligible for re-election to that office, but no person shall hold that office for more than two consecutive terms.\n3. The President may, by writing under his hand addressed to the Speaker of the National Assembly, resign his office.",
    "48": "Article 45: President's power to grant pardon, etc\nThe President shall have power to grant pardon, reprieve and respite, and to remit, suspend or commute any\nsentence passed by any court, tribunal or other authority.",
    "49": "Article 46: President to be kept informed\nThe Prime Minister shall keep the President informed on all matters of internal and foreign policy and on all legislative proposals the Federal Government intends to bring before Majlis-e-Shoora (Parliament).",
    "50": "Article 47: Removal or impeachment of President\n1. Notwithstanding anything contained in the Constitution, the President may, in accordance with the provisions\nof this Article, be removed from office on the ground of physical or mental incapacity or impeached on a charge of violating the Constitution or gross misconduct.\n2. Not less than one-half of the total membership of either House may give to the Speaker of the National Assembly or, as the case may be, the Chairman written notice of its intention to move a resolution for the removal of, or, as the case may be, to impeach, the President; and such notice shall set out the particulars of his incapacity or of the charge against him.\n3. If a notice under clause (2) is received by the Chairman, he shall transmit it forthwith to the Speaker.\n4. The Speaker shall, within three days of the receipt of a notice under clause (2) or clause (3), cause a copy of the notice to be transmitted to the President.\n5. The Speaker shall summon the two Houses to meet in a joint sitting not earlier than seven days and not later than fourteen days after the receipt of the notice by him.\n6. The joint sitting may investigate or cause to be investigated the ground or the charge upon which the notice is founded.\n7. The President shall have the right to appear and be represented during the investigation, if any, and before the joint sitting.\n8. If, after consideration of the result of the investigation, if any, a resolution is passed at the joint sitting by the votes of not less than two-thirds of the total membership of Majlis-e-Shoora (Parliament) declaring that the President is unfit to hold the office due to incapacity or is guilty of violating the Constitution or of gross misconduct, the President shall cease to hold office immediately on the passing of the resolution.",
    "51": "Article 48: President to act on advice, etc\n1. In the exercise of his functions, the President shall act on and in accordance with the advice of the Cabinet or the Prime Minister. Provided that within fifteen days the President may require the Cabinet\nor, as the case may be, the Prime Minister to reconsider such advice, either generally or otherwise, and the President shall  within ten days act in accordance with the advice tendered after such reconsideration.\n2. Notwithstanding anything contained in clause (1), the President shall act in his discretion in respect of any matter in respect of which he is empowered by the Constitution to do so and the validity of anything done by the President in his discretion shall not be called in question on any ground whatsoever.\n3. The question whether any, and if so what, advice was tendered to the President by the Cabinet, the Prime Minister, a Minister or Minister of State shall not be inquired into in, or by, any court, tribunal or other authority.\n4. Where the President dissolves the National Assembly, notwithstanding anything contained in clause (1), he shall,\na. appoint a date, not later than ninety days from the date of the dissolution, for the holding of a general election to the Assembly; and\nb. appoint a care-taker Cabinet.\n5. If at any time the Prime Minister considers it necessary to hold a referendum on any matter of national importance, he may refer the matter to a joint sitting of the Majlis-e-Shoora (Parliament) and if it is approved in a joint sitting, the Prime Minister may cause such matter to be referred to a referendum in the form of a question that is capable of being answered by either “Yes” or “No”.\n6. An act of Majlis-e-Shoora (Parliament) may lay down the procedure for the holding of a referendum and the compiling and consolidation of the result of a referendum.",
    "52": "Article 49: Chairman or Speaker to act as, or perform functions of, President\n1. If the office of President becomes vacant by reason of death, resignation or removal of the President, the Chairman or, if he is unable to perform the functions of the office of President, the Speaker of the National Assembly shall act as President until a President is elected in accordance with clause (3) of Article 41.\n2. When the President, by reason of absence from Pakistan or any other cause, is unable to perform his functions, the Chairman or, if he too is absent or unable to perform the functions of the office of President, the Speaker of the National Assembly shall perform the functions of President until the President returns to Pakistan or, as the case may be, resumes his functions.",
    "53": "Article 50: Majlis-e-Shoora (Parliament)\nThere shall be a Majlis-e-Shoora (Parliament) of Pakistan consisting of the President and two Houses to be known respectively as the National Assembly and the Senate.",
    "54": "Article 51: National Assembly\n1. There shall be three hundred and forty-two seats for members in the National Assembly, including seats reserved for women and non-Muslims.\n2. A person shall be entitled to vote if-\na. he is a citizen of Pakistan.\nb. he is not less than eighteen years of age.\nc. his name appears on the electoral roll; and\nd. he is not declared by a competent court to be of unsound mind.",
    "55": "Article 52: Duration of National Assembly\nThe National Assembly shall, unless sooner dissolved, continue for a term of five years from the day of its first meeting and shall stand dissolved at the expiration of its term.",
    "56": "Article 53: Speaker and Deputy Speaker of National Assembly.\n1. After a general election, the National Assembly shall, at its first meeting and to the exclusion of any other business, elect from amongst its members a Speaker and a Deputy Speaker and, so often as the office of Speaker or Deputy Speaker becomes vacant, the Assembly shall elect another member as Speaker or, as the case may be, Deputy Speaker.\n2. Before entering upon office, a member elected as Speaker or Deputy Speaker shall make before the National Assembly oath in the form set out in the Third Schedule.\n3. When the office of Speaker is vacant, or the Speaker is absent or is unable to perform his functions due to any cause, the Deputy Speaker shall act as Speaker, and if, at that time, the Deputy Speaker is also absent or is unable to act as Speaker due to any cause, such member as may be determined by the rules of procedure of the Assembly shall preside at the meeting of the Assembly.\n4. The Speaker or the Deputy Speaker shall not preside at a meeting of the Assembly when a resolution for his removal from office is being considered.\n5. The Speaker may, by writing under his hand addressed to the President, resign his office.\n6. The Deputy Speaker may, by writing under his hand addressed to the Speaker, resign his office.\n7. The office of Speaker or Deputy Speaker shall become vacant if-\na. he resigns his office;\nb. he ceases to be a member of the Assembly; or\nc. he is removed from office by a resolution of the Assembly, of which not less than seven days’ notice has been given and which is passed by the votes of the majority of the total membership of the Assembly.\n8. When the National Assembly is dissolved the Speaker shall continue in his office till the person elected to fill the office by the next Assembly enters upon his office.",
    "57": "Article 54: Summoning and prorogation of Majlis-e-Shoora (Parliament)\n1. The President may, from time to time, summon either House or both Houses or Majlise- Shoora (Parliament) in joint sitting to meet at such time and place as he thinks fit and may also prorogue the same.\n2. There shall be at least three sessions of the National Assembly every year, and not more than one hundred and twenty days shall intervene between the last sitting of the Assembly in one session and the date appointed for its first sitting in the next session: Provided that the National Assembly shall meet for not less than one\nhundred and thirty working days in each year.\nExplanation.- In this clause, \"working days\" includes any day on which there is a joint sitting and any period, not exceeding two days, for which the National Assembly is adjourned.\n3. On a requisition signed by not less than one-fourth of the total membership of the National Assembly, the Speaker shall summon the National Assembly to meet, at such time and place as he thinks fit, within fourteen days of the receipt of the requisition; and when the Speaker has summoned the Assembly\nonly he may prorogue it.",
    "58": "Article 55: Voting in Assembly and quorum\n1. Subject to the Constitution, all decisions of the National Assembly shall be taken by majority of the members\npresent and voting, but the person presiding shall not vote except in the case of equality of votes.\n2. If at any time during a sitting of the National Assembly the attention of the person presiding is drawn to the fact that less than one-fourth of the total membership of the Assembly is present, he shall either adjourn the Assembly or suspend the meeting until at least one-fourth of such membership is present.",
    "59": "Article 56: Address by President\n1. The President may address either House or both Houses assembled together and may for that purpose require the attendance of the members.\n2. The President may send messages to either House, whether with respect to a Bill then pending in the Majlis-e-Shoora (Parliament) or otherwise, and a House to which any message is so sent shall with all convenient dispatch consider any matter required by the message to be taken into consideration.\n3. At the commencement of the first session after each general election to the National Assembly and at the commencement of the first session of each year the President shall address both Houses assembled together and inform the Majlis-e-Shoora (Parliament) of the causes of its summons.\n4. Provision shall be made in the rules for regulating the procedure of a House and the conduct of its business for the allotment of time for discussion of the matters referred to in the address of the President.",
    "60": "Article 57: Right to speak in Majlis-e-Shoora (Parliament)\nThe Prime Minister, a Federal Minister, a Minister of State and the Attorney General shall have the right\nto speak and otherwise take part in the proceedings of either House, or a joint sitting or any committee thereof, of which he may be named a member, but shall not by virtue of this Article be entitled to vote.",
    "61": "Article 58: Dissolution of the National Assembly\n1. The President shall dissolve the National Assembly if so advised by the Prime Minister; and the\nNational Assembly shall, unless sooner dissolved, stand dissolved at the expiration of forty-eight hours after the Prime Minister has so advised\nExplanation.- Reference in this Article to “Prime Minister” shall not be construed to include reference to a Prime Minister against whom a notice of a resolution for a vote of no-confidence has been given in the National Assembly but has not been voted upon or against whom such a resolution has been passed or who is continuing in office after his resignation or after the dissolution of the National Assembly.\n2. Notwithstanding anything contained in clause (2) of Article 48, the President may also dissolve the National Assembly in his discretion where, a vote of no-confidence having been passed against the Prime Minister, no other member of the National Assembly commands the confidence of the majority of the members of the National Assembly in accordance with the provisions of the Constitution, as ascertained in a session of the National Assembly summoned for the purpose.",
    "62": "Article 59: The Senate\n1. The Senate shall consist of one hundred and four members, of whom,\na. fourteen shall be elected by the members of each Provincial Assembly;\nb. eight shall be elected from the Federally Administered Tribal Areas, in such manner as the President may, by Order, prescribe;\nc. two on general seats, and one woman and one technocrat including aalim shall be elected from the Federal Capital in such manner as the President may, by Order, prescribe;\nd. four women shall be elected by the members of each Provincial Assembly;\ne. four technocrats including ulema shall be elected by the members of each Provincial Assembly; and\nf. four non-Muslims, one from each Province, shall be elected by the members of each Provincial Assembly:\nProvided that paragraph (f) shall be effective from the next Senate election after the commencement of the Constitution (Eighteenth Amendment) Act, 2010.\n2. Election to fill seats in the Senate allocated to each Province shall be held in accordance with the system of proportional representation by means of the single transferable vote.\n3. The Senate shall not be subject to dissolution but the term of its members, who shall retire as follows, shall be six years:\na. of the members referred to in paragraph (a) of clause (1), seven shall retire after the expiration of the first three years and seven shall retire after the expiration of the next three years;\nb. of the members referred to in paragraph (b) of the aforesaid clause, four shall retire after the expiration of the first three years and four shall retire after the expiration of the next three years;\nc. of the members referred to in paragraph (c) of the aforesaid clause,\ni. one elected on general seat shall retire after the expiration of the first three years and the other one shall retire after the expiration of the next three years; and\nii. one elected on the seat reserved for technocrat shall retire after first three years and the one elected on the seat reserved for women shall retire after the expiration of the next three years;\nd. of the members referred to in paragraph (d) of the aforesaid clause, two shall retire after the expiration of the first three years and two shall retire after the expiration of the next three years;\ne. of the members referred to in paragraph (e) of the aforesaid clause, two shall retire after the expiration of the first three years and two shall retire after the expiration of the next three years; and\nf. of the members referred to in paragraph (f) of the aforesaid clause, two shall retire after the expiration of first three years and two shall retire after the expiration of next three years:\nProvided that the Election Commission for the first term of seats for non-Muslims shall draw a lot as to which two members shall\nretire after the first three years.\n4. The term of office of a person elected to fill a casual vacancy shall be the unexpired term of the member whose vacancy he has filled",
    "63": "Article 60: Chairman and Deputy Chairman\n1.  After the Senate has been duly constituted, it shall, at its first meeting and to the exclusion of any other business, elect from amongst its members a Chairman and a Deputy Chairman and, so often as the office of Chairman or Deputy Chairman becomes vacant, the Senate shall elect another member as Chairman or, as the case may be, Deputy Chairman.\n2.  The term of office of the Chairman or Deputy Chairman shall be three years from the day on which he enters upon his office.",
    "64": "Article 61: Other provisions relating to Senate\nThe provisions of clauses (2) to (7) of Article 53, clauses (2) and (3) of Article 54 and Article 55 shall apply to the Senate as they apply to the National Assembly and, in their application to the Senate, shall have effect as if references therein to the National Assembly, Speaker and Deputy Speaker were references, respectively, to the Senate, Chairman and Deputy Chairman and as if, in the proviso to the said clause (2) of Article 54, for the words one hundred and thirty, the word one hundred and ten were substituted.",
    "65": "Article 62: Qualifications for membership of Majlis-e-Shoora (Parliament)\n1. A person shall not be qualified to be elected or chosen as a member of Majlis-e-Shoora (Parliament) unless-\na. he is a citizen of Pakistan;\nb. he is, in the case of the National Assembly, not less than twentyfive years of age and is enrolled as a voter in any electoral roll in-\ni. any part of Pakistan, for election to a general seat or a seat reserved for non-Muslims; and\nii. any area in a Province from which she seeks membership for election to a seat reserved for women.\n f. he is sagacious, righteous, non-profligate, honest and ameen, there being no declaration to the contrary by a court of law; and\ng. he has not, after the establishment of Pakistan, worked against the integrity of the country or opposed the ideology of Pakistan.\n2. The disqualifications specified in paragraphs (d) and (e) shall not apply to a person who is a non-Muslim, but such a person shall have good moral reputation.",
    "66": "Article 63: Disqualifications for membership of Majlis-e-Shoora (Parliament)\n1. A person shall be disqualified from being elected or chosen as, and from being, a member of the Majlis-e-Shoora (Parliament), if-\na. he is of unsound mind and has been so declared by a competent  court; or\nb. he is an undischarged insolvent; or\nc. he ceases to be a citizen of Pakistan, or acquires the citizenship of a foreign State; or\nd. he holds an office of profit in the service of Pakistan other than an office declared by law not to disqualify its holder; or\ne. he is in the service of any statutory body or any body which is owned or controlled by the Government or in which the Government has a controlling share or interest; or\nf. being a citizen of Pakistan by virtue of section 14B of the Pakistan Citizenship Act, 1951 (II of 1951), he is for the time being disqualified under any law in force in Azad Jammu and Kashmir from being elected as a member of the Legislative Assembly of Azad Jammu and Kashmir; or\ng. he has been convicted by a court of competent jurisdiction for propagating any opinion, or acting in any manner, prejudicial to the ideology of Pakistan, or the sovereignty, integrity or security of Pakistan, or the integrity or independence of the judiciary of Pakistan, or which defames or brings into ridicule the judiciary or the Armed Forces of Pakistan, unless a period of five years has elapsed since his release; or\nh. he has been, on conviction for any offence involving moral turpitude, sentenced to imprisonment for a term of not less than two years, unless a period of five years has elapsed since his release; or\ni. he has been dismissed from the service of Pakistan or service of a corporation or office set up or controlled by the Federal Government, Provincial Government or a Local Government on the ground of misconduct, unless a period of five years has elapsed since his dismissal; or\nj. he has been removed or compulsorily retired from the service of Pakistan or service of a corporation or office set up or controlled by the Federal Government, Provincial Government or a Local Government on the ground of misconduct, unless a period of three years has elapsed since his removal or compulsor retirement; or\nk. he has been in the service of Pakistan or of any statutory body or any body which is owned or controlled by the Government or in which the Government has a controlling share or interest, unless a period of two years has elapsed since he ceased to be in such service; or\nl. he, whether by himself or by any person or body of persons in trust for him or for his benefit or on his account or as a member of a Hindu undivided family, has any share or interest in a contract, not being a contract between a cooperative society and Government, for the supply of goods to, or for the execution of any contract or for the performance of any service undertaken by, Government: Provided that the disqualification under this paragraph shall no apply to a person-\ni. where the share or interest in the contract devolves on him by inheritance or succession or as a legatee, executor or administrator, until the expiration of six months after it has so devolved on him;\nii. where the contract has been entered into by or on behalf of a public company as defined in the Companies Ordinance, 1984 (XLVII of 1984), of which he is ashareholder but is not a director holding an office of profit under the company; or\niii. where he is a member of a Hindu undivided family and the contract has been entered into by any other member of that family in the course of ca rrying on a separate business in which he has no share or interest;\nExplanation.— In this Article “goods” does not include agricultural produce or commodity grown or produced by him or such goods as he is, under any directive of Government or any law for the time being in force, under a duty or obligation to supply; or\nm. he holds any office of profit in the service of Pakistan other than the following offices, namely:-\ni.. an office which is not whole time office remunerated either by salary or by fee;\nii. the office of Lumbardar, whether called by this or any other title;\niii. the Qaumi Razakars;\niv. any office the holder whereof, by virtue of such office, is liable to be called up for military training or military service under any law providing for the constitution or raising of a Force; or\nn. he has obtained a loan for an amount of two million rupees or more, from any bank, financial institution, cooperative society or   cooperative body in his own name or in the name of his spouse or any of his dependents, which remains unpaid for more than one year from the due date, or has got such loan written off; or\no. he or his spouse or any of his dependents has defaulted in payment of government dues and utility expenses, including telephone, electricity, gas and water charges in excess of ten thousand rupees, for over six months, at the time of filing his nomination papers; or\np. he is for the time being disqualified from being elected or chosen as a member of the Majlis-e-Shoora (Parliament) or of a Provincial Assembly under any law for the time being inforce.\nExplanation.- For the purposes of this paragraph “law” shall not include an Ordinance promulgated under Article 89 or Article128.\n2. If any question arises whether a member of the Majlis-e-Shoora (Parliament) has become disqualified from being a member, the Speaker or, as the case may be, the Chairman shall, unless he decides that no such\nquestion has arisen, refer the question to the Election Commission within thirty days and if he fails to do so within the aforesaid period it shall be deemed to have been referred to the Election Commission.\n3. The Election Commission shall decide the question within ninety days from its receipt or deemed to have been received and if it is of the opinion that the member has become disqualified, he shall cease to be a\nmember and his seat shall become vacant.",
    "67": "Article 64: Vacation of seats\n1. A Member of Majlis-e-Shoora (Parliament) may, by writing under his hand addressed to the Speaker or, as the case may be, the Chairman resign his seat, and thereupon his seat shall become vacant.\n2. A House may declare the seat of a member vacant if, without leave of the House, he remains absent for forty consecutive days of its sittings.",
    "68": "Article 65: Oath of members\nA person elected to a House shall not sit or vote until he has made before the House oath in the form set out in the Third Schedule.",
    "69": "Article 66: Privileges of members, etc\n1. Subject to the Constitution and to the rules of procedure of Majlis-e-Shoora (Parliament), there shall be freedom of speech in Majlis-e-Shoora (Parliament) and no member shall be liable to any proceedings in any court in respect of anything said or any vote given by him in Majlis-e-Shoora (Parliament), and no person shall be so liable in respect of the publication by or under the authority of Majlis-e-Shoora (Parliament) of any report, paper, votes or proceedings.\n2. In other respects, the powers, immunities and privileges of Majlis-e- Shoora, (Parliament), and the immunities and privileges of the members of Majlise- Shoora (Parliament), shall be such as may from time to time be defined by law and, until so defined, shall be such as were, immediately before the commencing\nday, enjoyed by the National Assembly of Pakistan and the committees thereof and its members.\n3. Provision may be made by law for the punishment, by a House, of persons who refuse to give evidence or produce documents before a committee of the House when duly required by the chairman of the committee so to do:\nProvided that any such law-\na. may empower a court to punish a person who refuses to give evidence or produce documents; and\nb. shall have effect subject to such Order for safeguarding confidential matters from disclosure as may be made by the President.\n4. The provisions of this Article shall apply to persons who have the right to speak in, and otherwise to take part in the proceedings of, Majlis-e-Shoora (Parliament) as they apply to members.\n5. In this Article, Majlis-e-Shoora (Parliament) means either House or a joint sitting, or a committee thereof.",
    "70": "Article 67: Rules of Procedure, etc\n1. Subject to the Constitution, a House may make rules for regulating its procedure and the conduct of its business, and shall have power to act notwithstanding any vacancy in the membership thereof, and any proceedings in the House shall not be invalid on the ground that some persons who were not entitled to do so sat, voted or otherwise took part in the proceedings.\n2. Until rules are made under clause (1), the procedure and conduct of business in a House shall be regulated by the rules of procedure made by the President.",
    "71": "Article 68: Restriction on discussion in Majlis-e-Shoora (Parliament)\nNo discussion shall take place in Majlis-e-Shoora (Parliament) with respect to the conduct of any Judge of the Supreme Court or of a High Court in the discharge of his duties.",
    "72": "Article 69: Courts not to inquire into proceedings of Majlis-e-Shoora (Parliament)\n1. The validity of any proceedings in Majlis-e-Shoora (Parliament) shall not be called in question on the ground of any irregularity of procedure.\n2. No officer or member of Majlis-e-Shoora (Parliament) in whom powers are vested by or under the Constitution for regulating procedure or the conduct of business, or for maintaining order in Majlis-e-Shoora (Parliament), shall be subject to the jurisdiction of any court in respect of the exercise by him of those powers.\n3. In this Article, Majlis-e-Shoora (Parliament) has the same meaning as in Article 66.",
    "73": "Article 70: Introduction and passing of Bills\n1. A Bill with respect to any matter in the Federal Legislative List may originate in either House and shall,\nif it is passed by the House in which it originated, be transmitted to the other House; and, if the Bill is passed without amendment by the other House also, it shall be presented to the President for assent.\n2. If a Bill transmitted to a House under clause (1) is passed with amendments it shall be sent back to the House in which it originated and if that House passes the Bill with those amendments it shall be presented to the President for assent.\n3. If a Bill transmitted to a House under clause (1) is rejected or is not passed within ninety days of its laying in the House or a Bill sent to a House under clause (2) with amendments is not passed by that House with\nsuch amendments, the Bill, at the request of the House in which it originated, shall be considered in a joint sitting and if passed by the votes of the majority of the members present and voting in the joint sitting it shall be presented to the President for assent.\n4. In this Article and the succeeding provisions of the Constitution, “Federal Legislative List” means the Federal Legislative List in the Fourth Schedule.",
    "74": "Article 71: This Article has been omitted\nThis article was omitted in a previous amendment of 'Constitution of Pakistan'",
    "75": "Article 72: Procedure at joint sittings\n1. The President, after consultation with the Speaker of the National Assembly and the Chairman, may make rules as to the procedure with respect to the joint sittings of, and communications between, the two Houses.\n2. At a joint sitting, the Speaker of the National Assembly or, in his absence, such person as may be determined by the rules made under clause (1), shall preside.\n3. The rules made under clause (1) shall be laid before a joint sitting and may be added to, varied, amended or replaced at a joint sitting.\n4. Subject to the Constitution, all decisions at a joint sitting shall be taken by the votes of the majority of the members present and voting.",
    "76": "Article 73: Procedure with respect to Money Bill\n1. Notwithstanding anything contained in Article 70, a Money Bill shall originate in the National Assembly:\nProvided that simultaneously when a Money Bill, including the Finance Bill containing the Annual Budget Statement, is presented in the National Assembly, a copy thereof shall be transmitted to the Senate which may,\nwithin fourteen days, make recommendations thereon to the National Assembly; and (1A) The National Assembly shall consider the recommendations of the Senate and after the Bill has been passed by the Assembly with or without incorporating the recommendations of the Senate, it shall be presented to the President for assent.\n2. For the purpose of this Chapter, a Bill or amendment shall be deemed to be a Money Bill if it contains provisions dealing with all or any of the following matters, namely:\na. the imposition, abolition, remission, alteration or regulation of any tax;\nb. the borrowing of money, or the giving of any guarantee, by the Federal government, or the amendment of the law relating to the financial obligations of that Government;\nc. the custody of the Federal Consolidated Fund, the payment of moneys into, or the issue of moneys from, that Fund;\nd. the imposition of a charge upon the Federal Consolidated Fund, or the abolition or alteration of any such charge;\ne. the receipt of moneys on account of the Public Account of the Federation, the custody or issue of such moneys;\nf. the audit of the accounts of the Federal Government or a Provincial Government; and\ng. any matter incidental to any of the matters specified in the preceding paragraphs.\n3. A Bill shall not be deemed to be a Money Bill by reason only that it provides-\na. for the imposition or alteration of any fine or other pecuniary penalty, or for the demand or payment of a licence fee or a fee or charge for any service rendered; or\nb. for the imposition, abolition, remission, alteration or regulation of any tax by any local authority or body for local purposes.\n4. If any question arises whether a Bill is a Money Bill or not, the decision of the Speaker of the National Assembly thereon shall be final.\n5. Every Money Bill presented to the President for assent shall bear a certificate under the hand of the Speaker of the National Assembly that it is a Money Bill, and such",
    "77": "Article 74: Federal Government's consent required for financial measures\nA Money Bill or a Bill or amendment which if enacted and brought into operation would involve expenditure from the Federal Consolidated Fund or withdrawal from the Public Account of the Federation or affect the coinage or currency of Pakistan or the constitution or functions of the State Bank of Pakistan shall not be introduced or moved in Majlis-e-Shoora (Parliament) except by or with the consent of the Federal Government.",
    "78": "Article 75: President's assent to Bills\n1. When a Bill is presented to the President for assent, the President shall, within 36[ten] days,-\na. assent to the Bill; or\nb. in the case of a Bill other than a Money Bill, return the Bill to the Majlis-e-Shoora (Parliament) with a message requesting that the Bill or any specified provision thereof, be reconsidered and that any amendment specified in the message be considered.\n2. When the President has returned a Bill to the Majlis-e-Shoora (Parliament), it shall be reconsidered by the Majlis-e-Shoora (Parliament) in joint sitting and, if it is again passed, with or without amendment, by the\nMajlis-e-Shoora (Parliament), by the votes of the majority of the members of both Houses present and voting, it shall be deemed for the purposes of the Constitution to have been passed by both Houses and shall be presented to the President, and the President shall give his assent within ten days, failing which such assent shall be deemed to have been given. ; and\n3. When the President has assented or is deemed to have assented to a Bill, it shall become law and be called an Act of Majlis-e-Shoora (Parliament).\n4. No act of Majlis-e-Shoora (Parliament), and no provision in any such Act, shall be invalid by reason only that some recommendation, previous sanction or consent required by the Constitution was not given if that Act was assented to in accordance with the Constitution.",
    "79": "Article 76: Bill not to lapse on prorogation, etc\n1. A Bill pending in either House shall not lapse by reason of the prorogation of the House.\n2. A Bill pending in the Senate which has not been passed by the National Assembly shall not lapse on the dissolution of the National Assembly.\n3. A Bill pending in the National Assembly, or a Bill which having been passed by the National Assembly is pending in the Senate, shall lapse on the dissolution of the National Assembly.",
    "80": "Article 77: Tax to be levied by law only\nNo tax shall be levied for the purposes of the Federation except by or under the authority of Act of Majlis-e-Shoora (Parliament).",
    "81": "Article 78: Federal Consolidated Fund and Public Account\n1. All revenues received by the Federal Government, all loans raised by that Government and all moneys received by it in repayment of any loan, shall form part of a consolidated fund, to be known as the Federal Consolidated Fund.\n2. All other moneys-\na. received by or on behalf of the Federal Government; or\nb. received by or deposited with the Supreme Court or any other court established under the authority of the Federation; shall be credited to the Public Account of the Federation.",
    "82": "Article 79: Custody, etc., of Federal Consolidated Fund and Public Account\nThe custody of the Federal Consolidated Fund, the payment Or moneys into that Fund, the withdrawal of moneys therefrom, the custody of other moneys received by or on behalf of the Federal Government, their payment into, and withdrawal from, the Public Account of the Federation, and all matters connected with or ancillary to the matters aforesaid shall be regulated by Act of Majlis-e-Shoora (Parliament) or, until provision in that behalf is so made, by rules made by the President.",
    "83": "Article 80: Annual Budget Statement\n1. The Federal Government shall, in respect of every financial year, cause to be laid before the National Assembly a statement of the estimated receipts and expenditure of the Federal Government for that year, in this Part referred to as the Annual Budget Statement.\n2. The Annual Budget Statement shall show separately-\na. the sums required to meet expenditure described by the Constitution as expenditure charged upon the Federal Consolidated Fund; and\nb. the sums required to meet other expenditure proposed to be made from the Federal Consolidated Fund; and shall distinguish expenditure on revenue account from other expenditure.",
    "84": "Article 81: Expenditure charged upon Federal Consolidated Fund\nThe following expenditure shall be expenditure charged upon the Federal Consolidated Fund:-\na. the remuneration payable to the President and other expenditure relating to his office, and the remuneration payable to-\ni. the Judges of the Supreme Court 39[and the Islamabad High Court];\nii. the Chief Election Commissioner;\niii. the Chairman and the Deputy Chairman;\niv. the Speaker and the Deputy Speaker of the National Assembly;\nv. the Auditor-General;\nb. the administrative expenses, including the remuneration payable to officers and servants, of the Supreme Court, the Islamabad High Court, the department of the Auditor-General, the Office of the Chief Election Commissioner and of the Election Commission and the Secretariats of the Senate and the National Assembly;\nc. all debt charges for which the Federal Government is liable, including interest, sinking fund charges, the repayment or amortisation of capital, and other expenditure in connection with the raising of loans,\nand the service and redemption of debt on the security of the Federal Consolidated Fund;\nd. any sums required to satisfy any judgment, decree or award against Pakistan by any court or tribunal; and\ne. any other sums declared by the Constitution or by Act of Majlis-e- Shoora (Parliament) to be so charged.",
    "85": "Article 82: Procedure relating to Annual Budget Statement\n1. So much of the Annual Budget Statement as relates to expenditure charged upon the Federal Consolidated Fund may be discussed in, but shall not be submitted to the vote of, the National Assembly.\n2. So much of the Annual Budget Statement as relates to other expenditure shall be submitted to the National Assembly in the form of demands for grants, and the Assembly shall have power to assent to, or to refuse to assent to, any demand, or to assent to any demand subject to a reduction of the amount specified therein;\nProvided that, for a period of ten years from the commencing day or the holding of the second general election to the National Assembly, whichever occurs later, a demand shall be deemed to have been assented to without any reduction of the amount specified therein, unless, by the votes of a majority of the total membership of the Assembly, it is refused or assented to subject to a reduction of the amount specified therein.\n3. No demand for a grant shall be made except on the recommendation of the Federal Government.",
    "86": "Article 83: Authentication of schedule of authorised expenditure\n1. The Prime Minister shall authenticate by his signature a schedule specifying-\na. the grants made or deemed to have been made by the National Assembly under Article 82, and\nb. the several sums required to meet the expenditure charged upon the Federal Consolidated Fund but not exceeding, in the case of any sum, the sum shown in the statement previously laid before the National Assembly.\n2. The schedule so authenticated shall be laid before the National Assembly, but shall not be open to discussion or vote thereon.\n3. Subject to the Constitution, no expenditure from the Federal Consolidated Fund shall be deemed to be duly authorised unless it is specified in the schedule so authenticated and such schedule is laid before the National Assembly as required by clause (2).",
    "87": "Article 84: Supplementary and excess grants\nIf in respect of any financial year it is found-\na. that the amount authorized to be expended for a particular service for the current financial year is insufficient, or that a need has arisen for expenditure upon some new service not included in the Annual\nBudget Statement for that year; or\nb. that any money has been spent on any service during a financial year in excess of the amount granted for that service for that year; the Federal Government shall have power to authorize expenditure from the Federal Consolidated Fund, whether the expenditure is charged by the Constitution upon that Fund or not, and shall cause to be laid before the National Assembly a Supplementary Budget Statement or, as the case may be, an Excess Budget Statement, setting out the amount of that expenditure, and the provisions of Articles 80 to 83 shall apply to those statements as they apply to the Annual Budget Statement.",
    "88": "Article 85: Votes on account\nNotwithstanding anything contained in the foregoing provisions relating to financial matters, the National Assembly shall have power to make any grant in advance in respect of the estimated expenditure for a part of\nany financial year, not exceeding four months, pending completion of the procedure prescribed in Article 82 for the voting of such grant and the authentication of the schedule of authorized expenditure in accordance with the\nprovisions of Article 83 in relation to the expenditure.",
    "89": "Article 86: Power to authorise expenditure when Assembly stands dissolved\nNotwithstanding anything contained in the foregoing provisions relating to financial matters, at any time when the National Assembly stands dissolved, the Federal Government may authorize expenditure from the Federal Consolidated Fund in respect of the estimated expenditure for a period not exceeding four months in any financial year, pending completion of the procedure prescribed in Article 82 for the voting of grants and the authentication of the schedule of authorized expenditure in accordance with the provisions of Article 83 in relation to the expenditure.",
    "90": "Article 87: Secretariats of Majlis-e-Shoora (Parliament)\n1. Each House shall have a separate Secretariat: Provided that nothing in this clause shall be construed as preventing the creation of posts common to both Houses.\n2. Majlis-e-Shoora (Parliament) may by law regulate the recruitment and the conditions of service of persons appointed to the Secretarial staff of either House.\n3. Until provision is made by Majlis-e-Shoora (Parliament) under clause (2), the Speaker or, as the case may be, the Chairman may, with the approval of the President, make rules regulating the recruitment and the conditions of service, of persons appointed to the secretarial staff of the National Assembly or the\nSenate.",
    "91": "Article 88: Finance Committees\n1. The expenditure of the National Assembly and the Senate within authorised appropriations shall be controlled by the National Assembly or, as the case may be, the Senate acting on the advice of its Finance Committee.\n2. The Finance Committee shall consist of the Speaker or, as the case may be, the Chairman, the Minister of Finance and such other members as may be elected thereto by the National Assembly or, as the case may be, the Senate.\n3. The Finance Committee may make rules for regulating its procedure.",
    "92": "Article 89: Power of President to promulgate Ordinances.\n1. The President may, except when the Senate or National Assembly is in session, if satisfied that circumstances exist which render it necessary to take immediate action, make and promulgate an Ordinance as the circumstances may require.\n2. An Ordinance promulgated under this Article shall have the same force and effect as an Act of Majlis-e-Shoora (Parliament) and shall be subject to like restrictions as the power of Majlis-e-Shoora (Parliament) to make law, but every such Ordinance-\na. shall be laid-\ni. before the National Assembly if it contains provisions dealing with all or any of the matters specified in clause (2) of Article 73, and shall stand repealed at the expiration of one hundred and twenty days from its promulgation or, if before the expiration of that period a resolution disapproving it is passed by the Assembly, upon the passing of that resolution: Provided that the National Assembly may by a resolution\nextend the Ordinance for a further period of one hundred and twenty days and it shall stand repealed at the expiration of the extended period, or if before the expiration of that period a resolution disapproving it is passed by the Assembly, upon the passing of that resolution:\nProvided further that extension for further period may be made only once; and\n\n(ii) before both Houses if it does not contain provisions dealing with any of the matters referred to in sub-paragraph (i), and shall stand repealed at the expiration of one hundred and\ntwenty days] from its promulgation or, if before the expiration of that period a resolution disapproving it is passed by either House, upon the passing of that resolution:\nProvided that either House may by a resolution extend it for a further period of one hundred and twenty days and it shall stand repealed at the expiration of the extended period, or if before the expiration of that period a resolution disapproving it is passed by a House, upon the passing of that resolution:\nProvided further that extension for a further period may be made only once; and\nb. may be withdrawn at any time by the President.\n3. without prejudice to the provisions of clause (2),-\na. an Ordinance laid before the National Assembly under subparagraph (i) of paragraph (a) of clause (2) shall be deemed to be a Bill introduced in the National Assembly; and\nb. an Ordinance laid before both Houses under sub-paragraph (ii)of paragraph (a) of clause (2) shall be deemed to be a Bill introduced in the House where it was first laid.",
    "93": "Article 90: The Federal Government\n1. Subject to the Constitution, the executive authority of the Federation shall be exercised in the name of the\nPresident by the Federal Government, consisting of the Prime Minister and the Federal Ministers, which shall act through the Prime Minister, who shall be the chief executive of the Federation.\n2. In the performance of his functions under the Constitution, the Prime Minster may act either directly or through the Federal Ministers.",
    "94": "Article 91: The Cabinet\n1. There shall be a Cabinet of Ministers, with the Prime Minister at its head, to aid and advise the President in the exercise of his functions.\n2. The National Assembly shall meet on the twenty-first day following the day on which a general election to the Assembly is held, unless sooner summoned by the President.\n3. After the election of the Speaker and the Deputy Speaker, the National Assembly shall, to the exclusion of any other business, proceed to elect without debate one of its Muslim members to be the Prime Minister.\n4. The Prime Minister shall be elected by the votes of the majority of the total membership of the National Assembly:\nProvided that, if no member secures such majority in the first poll, a second poll shall be held between the members who secure the two highest numbers of votes in the first poll and the member who secures a majority of votes of the members present and voting shall be declared to have been elected as Prime Minister:\n\nProvided further that, if the number of votes secured by two or more members securing the highest number of votes is equal, further poll shall be held between them until one of them secures a majority of votes of the members present and voting.\n\n5. The member elected under clause (4) shall be called upon by the President to assume the office of Prime Minister and he shall, before entering upon the office, make before the President oath in the form set out in the\nThird Schedule:\nProvided that there shall be no restriction on the number of terms for the office of the Prime Minister.\n6. The Cabinet, together with the Ministers of State, shall be collectively responsible to the Senate and the National Assembly.\n7. The Prime Minister shall hold office during the pleasure of the President, but the President shall not exercise his powers under this clause unless he is satisfied that the Prime Minister does not command the\nconfidence of the majority of the members of the National Assembly, in which case he shall summon the National Assembly and require the Prime Minister to obtain a vote of confidence from the Assembly.\n8. The Prime Minister may, by writing under his hand addressed to the President, resign his office.\n9. A Minister who for any period of six consecutive months is not a member of the National Assembly shall, at the expiration of that period, cease to be a Minister and shall not before the dissolution of that Assembly be again appointed a Minister unless he is elected a member of that Assembly:\nProvided that nothing contained in this clause shall apply to a Minister who is member of the Senate.\n10. Nothing contained in this Article shall be construed as disqualifying the Prime Minister or any other Minister or a Minister of State for continuing in office during any period during which the National Assembly\nstands dissolved, or as preventing the appointment of any person as Prime Minister or other Minister or a Minister of State during any such period.",
    "95": "Article 92: Federal Ministers and Ministers of State\n1. Subject to clauses (9) and (10) of Article 91, the President shall appoint Federal Ministers and Ministers\nof State from amongst the members of Majlis-e-Shoora (Parliament) on the advice of the Prime Minister:\nProvided that the number of Federal Ministers and Ministers of State who are members of the Senate shall not at any time exceed one-fourth of the number of Federal Ministers:\nProvided further that the total strength of the Cabinet, including Ministers of State, shall not exceed eleven percent of the total membership of Majlis-e-Shoora (Parliament):\nProvided also that the aforesaid amendment shall be effective from the next general election held after the commencement of the Constitution (Eighteenth Amendment) Act, 2010.\n2. Before entering upon office, a Federal Minister or Minister of State shall make before the President oath in the form set out in the Third Schedule.\n3. A Federal Minister or Minister of State may, by writing under his hand addressed to the President, resign his office or may be removed from office by the President on the advice of the Prime Minister.",
    "96": "Article 93: Advisers\n1. The President may, on the advice of the Prime Minister, appoint not more than five Advisers, on such terms and conditions as he may determine.\n2. The provisions of Article 57 shall also apply to an Adviser.",
    "97": "Article 94: Prime Minister continuing in office\nThe President may ask the Prime Minister to continue to hold office until his successor enters upon the office of\nPrime Minister.",
    "98": "Article 95: Vote of no-confidence against Prime Minister\n1. A resolution for a vote of no-confidence moved by not less than twenty per centum of the total\n membership of the National Assembly may be passed against the Prime Minister by the National Assembly.\n2. A resolution referred to in clause (1) shall not be voted upon before the expiration of three days, or later than seven days, from the day on which such resolution is moved in the National Assembly.\n3. A resolution referred to in clause (1) shall not be moved in the National Assembly while the National Assembly is considering demands for grants submitted to it in the Annual Budget Statement.\n4. If the resolution referred to in clause (1) is passed by a majority of the total membership of the National Assembly, the Prime Minister shall cease to hold office.",
    "99": "Article 96: This Article has been omitted\n [Omitted]",
    "100": "Article 97: Extent of executive authority of Federation\nSubject to the Constitution, the executive authority of the Federation shall extend to the matters with respect to\nwhich Majlis-e-Shoora (Parliament) has power to make laws, including exercise of rights, authority and jurisdiction in and in relation to areas outside Pakistan:\nProvided that the said authority shall not, save as expressly provided in the Constitution or in any law made by Majlis-e-Shoora (Parliament), extend in any Province to a matter with respect to which the Provincial Assembly has also power to make laws.",
    "101": "Article 98: Conferring of functions on subordinate authorities\nOn the recommendation of the Federal Government, Majlis-e-Shoora (Parliament) may by law confer functions upon officers or authorities subordinate to the Federal Government.",
    "102": "Article 99: Conduct of business of Federal Government\n1. All executive actions of the Federal Government shall be expressed to be taken in the name of the\nPresident.\n2. The Federal Government shall by rules specify the manner in which orders and other instruments made and executed in the name of the President shall be authenticated, and the validity of any order or instrument so authenticated shall not be questioned in any court on the ground that it was not made or executed by the President.\n3. The Federal Government shall also make rules for the allocation and transaction of its business.",
    "103": "Article 100: Attorney-General for Pakistan\n1. The President shall appoint a person, being a person qualified to be appointed a Judge of the Supreme Court, to be the Attorney-General for Pakistan.\n2. The Attorney-General shall hold office during the pleasure of the President and shall not engage in private practice so long as he holds the office of the Attorney-General.\n3. It shall be the duty of the Attorney-General to give advice to the Federal Government upon such legal matters, and to perform such other duties of a legal character as may be referred or assigned to him by the Federal Government, and in the performance of his duties he shall have the right of audience in all courts and tribunals in Pakistan.\n4. The Attorney-General may, by writing under his hand addressed to the President, resign his office.",
    "104": "Article 101: Appointment of Governor\n1. There shall be a Governor for each Province, who shall be appointed by the President on the advice of the Prime Minister.\n2. A person shall not be appointed a Governor unless he is qualified to be elected as member of the National Assembly and is not less that thirty-five years of age and is a registered voter and resident of the Province concerned.\n3. The Governor shall hold office during the pleasure of the President and shall be entitled to such salary, allowances and privileges as the President may determine.\n4. The Governor may, by writing under his hand addressed to the President, resign his office.\n5. The President may make such provision as he thinks fit for the discharge of the functions of a Governor in any contingency not provided for in this Part.",
    "105": "Article 102: Oath of office\nBefore entering upon office, the Governor shall make before the Chief Justice of the High Court oath in the form set out in the Third Schedule.",
    "106": "Article 103: Conditions of Governor's office\n1. The Governor shall not hold any office of profit in the service of Pakistan of occupy any other position carrying the right to remuneration for the rendering of services.\n2. The Governor shall not be a candidate for election as a member of Majlis-e-Shoora (Parliament)  or a Provincial Assembly and, if a member of Majlis-e-Shoora (Parliament) or a Provincial Assembly is appointed as Governor, his seat in Majlis-e-Shoora (Parliament) or, as the case may be, the Provincial Assembly shall become vacant on the day he enters upon his office.",
    "107": "Article 104: Speaker Provincial Assembly to act as, or perform functions of Governor in his absence\nWhen the Governor, by reason of absence from Pakistan or for any other cause, is unable to perform his functions, the Speaker of the Provincial Assembly and in his absence any other person as the President may nominate shall perform the functions of Governor until the Governor returns to Pakistan or, as the case may be, resumes his functions.",
    "108": "Article 105: Governor to act on advice, etc\n1. Subject to the Constitution, in the performance of his functions, the Governor shall act on and in accordance with the advice of the Cabinet, or the Chief Minister. Provided that within fifteen days the Governor may require the Cabinet or, as the case may be, the Chief Minister to reconsider such advice, whether generally or otherwise, and the Governor shall 60[, within ten days, act in accordance with the advice tendered after such reconsideration.\n2. The question whether any, and if so what, advice was tendered to the Governor by the Chief Minister or the Cabinet shall not be inquired into in, or by, any court, tribunal or other authority.(3) Where the Governor dissolves the Provincial Assembly, notwithstanding anything contained in clause (1), he shall,-\na. appoint a date, not later than ninety days from the date of dissolution, for the holding of a general election to the Assembly; and\nb. appoint a care-taker Cabinet.\n4. 62[***]\n5. The provisions of clause (2) of Article 48 shall have effect in relation to a Governor as if reference therein to \"President\" were reference to \"Governor\".",
    "109": "Article 106: Constitution of Provincial Assemblies\n1. Each Provincial Assembly shall consist of general seats and seats reserved for women and\nnon-Muslims as specified herein below.\n        General Seats     Women     Non-Muslims      Total\nBalochistan                               51               11                  3                   65\nKhyber Pakhtunkhwa               99               22                  3                   124\nPunjab                                     297              66                  8                   371\nSindh                                       130              29                  9                  168\n2. A person shall be entitled to vote if-\na. he is a citizen of Pakistan;\nb. he is not less than eighteen years of age;\nc. his name appears on the electoral roll for any area in the Province; and\nd. he is not declared by a competent court to be of unsound mind.\n3. For the purpose of election to a Provincial Assembly,-\na. the constituencies for the general seats shall be single member territorial constituencies and the members to fill such seats shall be elected by direct and free vote;\nb. each Province shall be a single constituency for all seats reserved for women and non-Muslims allocated to the respectivem Provinces under clause (1);\nc. the members to fill seats reserved for women and non-Muslims allocated to a Province under clause (1) shall be elected in accordance with law through proportional representation system of political parties' lists of candidates on the basis of the total number of general seats secured by each political party in the Provincial Assembly.\nProvided that for the purpose of this sub-clause, the total number of general seats won by a political party shall include the independent returned candidate or candidates who may duly join such political party within three days of the publication in the official Gazette of the names of the returned candidates.",
    "110": "Article 107: Duration of Provincial Assembly\nA Provincial Assembly shall, unless sooner dissolved, continue for a term of five years from the day of its first meeting and shall stand dissolved at the expiration of its term.",
    "111": "Article 108: Speaker and Deputy Speaker\nAfter a general election, a Provincial Assembly shall, at its first meeting and to the exclusion of any other business,\nelect from amongst its members a Speaker and a Deputy Speaker and, so often as the office of Speaker or Deputy Speaker becomes vacant, the Assembly shall elect another member as Speaker or, as the case may be, Deputy Speaker.",
    "112": "Article 109: Summoning and prorogatino of Provincial Assembly\nThe Governor may from time to time-\na. summon the Provincial Assembly to meet at such time and place as he thinks fit; and\nb. prorogue the Provincial Assembly.",
    "113": "Article 110: Right of Governor to address Provincial Assembly\nThe Governor may address the Provincial Assembly and may for that purpose require the attendance of the members.",
    "114": "Article 111: Right to speak in Provincial Assembly\nThe Advocate-General shall have the right to speak and otherwise take part in the proceedings of the Provincial Assembly or any committee thereof of which he may be named a member, but shall not by virtue of this Article be entitled to vote.",
    "115": "Article 112: Dissolution of Provincial Assembly\n1. The Governor shall dissolve the Provincial Assembly if so advised by the Chief Minister; and the Provincial Assembly shall, unless sooner dissolved, stand dissolved at the expiration of forty-eight hours after the Chief Minister has so advised.\nExplanation.- Reference in this Article to ‘Chief Minister’ shall not be construed to include reference to a Chief Minister against whom a notice of a resolution for a vote of no-confidence has been given in the Provincial Assembly but has not been voted upon or against whom a resolution for a vote of no-confidence has been passed.\n2. The Governor may also dissolve the Provincial Assembly in his discretion, but subject to the previous approval of the President, where a vote of no-confidence having been passed against the Chief Minister, no other member of the Provincial Assembly commands the confidence of the majority of the members of the Provincial Assembly in accordance with the provisions of the Constitution, as ascertained in a session of the Provincial Assembly summoned for the purpose.",
    "116": "Article 113: Qualifications and disqualifications for membership of Provincial Assembly\nThe qualifications and disqualifications for membership of the National Assembly set out in Articles 62 and 63 shall also apply for membership of a Provincial Assembly as if reference there into \"National Assembly\" were a\nreference to \"Provincial Assembly\".",
    "117": "Article 114: Restriction on discussion in Provincial Assembly\nNo discussion shall take place in a Provincial Assembly with respect to the conduct of any Judge of the Supreme Court or of a High Court in the discharge of his duties.",
    "118": "Article 115: Provincial Government's consent required for financial measures\n1. A Money Bill, or a Bill or amendment which if enacted and brought into operation would involve expenditure from the Provincial Consolidated Fund or withdrawal from the Public Account of the Province shall not be introduced or moved in the Provincial Assembly except by or with the consent of the Provincial Government.\n2. For the purpose of this Article, a Bill or amendment shall be deemed to be a Money Bill if it contains provisions dealing with all or any of the following matters, namely:-\na. the imposition, abolition, remission, alteration or regulation of any tax;\nb. the borrowing of money, or the giving of any guarantee, by the Provincial Government or the amendment of the law relating to the financial obligations of that Government;\nc. the custody of the Provincial Consolidated Fund, the payment of moneys into, or issue of moneys from, that Fund;\nd. the imposition of a charge upon the Provincial Consolidated Fund, or the abolition or alteration of any such charge;\ne. the receipt of moneys on account of the Public Account of the Province, the custody or issue of such moneys; and\nf. any matter incidental to any of the matters specified in the preceding paragraphs.\n3. A Bill shall not be deemed to be a Money Bill by reason only that it provides-\na. for the imposition or alteration of any fine or other pecuniary penalty or for the demand or payment of a licence fee or a fee or charge for any service rendered; or\nb. for the imposition, abolition, remission, alteration or regulation of any tax by any local authority or body for local purposes.\n4. If any question arises whether a Bill is a Money Bill or not, the decision of the Speaker of the Provincial Assembly thereon shall be final.\n5. Every Money Bill presented to the Governor for assent shall bear a certificate under the hand of the Speaker of the Provincial Assembly that it is a Money Bill and such certificate shall be conclusive for all purposes and shall not be called in question.",
    "119": "Article 116: Governor's assent to Bills\n1. When a Bill has been passed by the Provincial Assembly, it shall be presented to the Governor for assent.\n2. When a Bill is presented to the Governor for assent, the Governor shall, within ten days.\na. assent to the Bill; or\nb. in the case of a Bill other than a Money Bill, return the Bill to the Provincial Assembly with a message requesting that the Bill, or any specified provision thereof, be reconsidered and that any amendment specified in the message be considered.\n3. When the Governor has returned a Bill to the Provincial Assembly it shall be reconsidered by the Provincial Assembly and, if it is again passed, with or without amendment, by the Provincial Assembly, by the votes of the majority of the members of the Provincial Assembly present and voting, it shall be again Presented to the Governor and the Governor shall give his assent within ten days, failing which such assent shall be deemed to have been given.\n4. When the Governor has assented or is deemed to have assented to a Bill, it shall become law and be called an Act of Provincial Assembly.\n5. No Act of a Provincial Assembly, and no provision in any such Act, shall be invalid by reason only that some recommendation, previous sanction or consent required by the Constitution was not given if that Act was assented to accordance with the Constitution.",
    "120": "Article 117: Bill not to lapse on prorogation, etc\n1. A Bill pending in a Provincial Assembly shall not lapse by reason of the prorogation of the Assembly.\n2. A Bill pending in a Provincial Assembly shall lapse on the dissolution of the Assembly",
    "121": "Article 118: Provincial Consolidated Fund and Public Account\n1. All revenues received by the Provincial Government, all loans raised by that Government, and all moneys received by it in repayment of any loan, shall form part of a consolidated fund, to be known as the Provincial Consolidated Fund.\n2. All other moneys-\na. received by or on behalf of the Provincial Government; or\nb. received by or deposited with the High Court or any other court established under the authority of the Province; shall be credited to the Public Account of the Province.",
    "122": "Article 119: Custody, etc., of Provincial Consolidated Fund and Public Account\nThe custody of the Provincial Consolidated Fund, the payment of moneys into that Fund, the withdrawal of moneys therefrom, the custody of other moneys received by or on behalf of the Provincial Government, their payment into, and withdrawal from, the Public Account of the Province, and all matters connected with or ancillary to the matters aforesaid, shall be regulated by Act of the Provincial Assembly or, until provision in that behalf is so made, by rules made by the Governor.",
    "123": "Article 120: Annual Budget Statement\n1. The Provincial Government shall, in respect of every financial year, cause to be laid before the Provincial Assembly a statement of the estimated receipts and expenditure of the Provincial Government for that year, in this Chapter referred to as the Annual Budget Statement.\n2. The Annual Budget Statement shall show separately.\na. the sums required to meet expenditure described by the Constitution as expenditure charged upon the Provincial Consolidated Fund; and\nb. the sums required to meet other expenditure proposed to be made from the Provincial Consolidated Fund; and shall distinguish expenditure on revenue account from other expenditure.",
    "124": "Article 121: Expenditure charged upon Provincial Consolidated Fund\nThe following expenditure shall be expenditure charged upon the Provincial Consolidated Fund:\na. the remuneration payable to the Governor and other expenditure relating to his office, and the remuneration payable to :-\ni. the Judges of the High Court; and\nii. the Speaker and Deputy Speaker of the Provincial Assembly;\nb. the administrative expenses, including the remuneration payable to officers and servants, of the High Court and the Secretariat of the Provincial Assembly;\nc. all debt charges for which the Provincial Government is liable, including interest, sinking fund charges, the repayment or amortisation of capital, and other expenditure in connection with the raising of loans, and the service and redemption of debt on the security of the Provincial Consolidation Fund;\nd. any sums required to satisfy any judgment, decree or award against the Province by any Court or tribunal; and\ne. any other sums declared by the Constitution or by Act of the Provincial Assembly to be so charged.",
    "125": "Article 122: Procedure relating to Annual Budget Statement\n1. So much of the Annual Budget Statement as relates to expenditure charged upon the Provincial Consolidated Fund may be discussed in, but shall not be submitted to the vote of, the Provincial Assembly.\n2. So much of the Annual Budget Statement as relates to other expenditure shall be submitted to the Provincial Assembly in the form of demands for grants, and that Assembly shall have power to assent to, or to refuse to assent to, any demand, or to assent to any demand subject to a reduction of the amount specified there in: 68[***]\n3. No demand for a grant shall be made except on the recommendation of the Provincial Government.",
    "126": "Article 123: Authentication of schedule of authorized expenditure\n1. The Chief Minister shall authenticate by his signature a schedule specifying.\na. the grants made or deemed to have been made by the Provincial Assembly under Article 122 and;\nb. the several sums required to meet the expenditure charged upon the Provincial Consolidated Fund but not exceeding, in the case of any sum, the sum shown in the statement previously laid before the\nAssembly.\n2. The schedule so authenticated shall be laid before the Provincial Assembly, but shall not be open to discussion or vote thereon.\n3. Subject to the Constitution, no expenditure from the Provincial Consolidated Fund shall be deemed to be duly authorized unless it is specified in the schedule so authenticated and such schedule is laid before the Provincial Assembly as required by clause (2).",
    "127": "Article 124: Supplementary and excess grant\nIf in respect of any financial year it is found.\na. that the amount authorized to be expended for a particular service for the current financial year is insufficient, or that a need has arisen for expenditure upon some new service not included in the Annual Budget Statement for that year; or\nb. that any money has been spent on any service during a financial year in excess of the amount granted for that service for that year; the Provincial Government shall have power to authorize expenditure from the Provincial Consolidated Fund, whether the expenditure is charged by the Constitution upon that Fund or not, and shall cause to be laid before the Provincial Assembly a Supplementary Budget Statement or, as the case may be, an Excess Budget Statement, setting out the amount of that expenditure, and the provisions of Article 120 to 123 shall apply to those statements as they apply to the Annual Budget Statement.",
    "128": "Article 125: Votes on account\nNotwithstanding anything contained in the foregoing provisions relating to financial matters, the Provincial Assembly shall have power to make any grant in advance in respect of the estimated expenditure for a part of\nany financial year, not exceeding three months, pending completion of the procedure prescribed in Article 122 for the voting of such grant and the authentication of the schedule of expenditure in accordance with the provisions of\nArticle 123 in relation to the expenditure.",
    "129": "Article 126: Power to authorize expenditure when Assembly stands dissolved\nNotwithstanding anything contained in the foregoing provisions relating to financial matters, at any time when the Provincial Assembly stands dissolved, the Provincial Government may authorize expenditure from the Provincial Consolidated Fund in respect of the estimated expenditure for a period not exceeding four months in any financial year, pending completion of the procedure prescribed in Article 122 for the voting of grants and the authentication of the schedule of authorized expenditure in accordance with the provisions of Article 123 in relation to the expenditure.",
    "130": "Article 127: Provisions relating to National Assembly, etc., to apply to Provincial Assembly, etc\nSubject to the Constitution, the provisions of clauses (2) to (8) of Article 53, clauses (2) and (3) of Article 54, Article 55, Articles 63 to 67, Article 69, Article 77, Article 87 and Article 88 shall apply to and in relation to a Provincial Assembly or a committee or members thereof or the Provincial Government, but so that\na. any reference in those provisions to Majlis-e-Shoora (Parliament), a House or the National Assembly shall be read as a reference to the Provincial Assembly;\nb. any reference in those provisions to the President shall be read as a reference to the Governor of the Province;\nc. any reference in those provisions to the Federal Government shall be, read as a reference to the Provincial Government;\nd. any reference in those provisions to the Prime Minister shall be read as a reference to the Chief Minister;\ne. any reference in those provisions to a Federal Minister shall be read as a reference to a Provincial Minister;\nf. any reference in those provisions to the National Assembly of Pakistan shall be read as a reference to the Provincial Assembly in existence immediately before the commencing day ; and\ng. the said clause (2) of Article 54 shall have effect as if, in the proviso thereto, for the words \"one hundred and thirty\" the word one hundred were substituted.",
    "131": "Article 128: Power of Governor to promulgate Ordinances\n1. The Governor may, except when the Provincial Assembly is in session, if satisfied that circumstances\nexist which render it necessary to take immediate action, make and promulgate an Ordinance as the circumstances may require.\n2. An Ordinance promulgated under this Article shall have the same force and effect as an Act of the Provincial Assembly and shall be subject to like restrictions as the power of the Provincial Assembly to make laws, but every such Ordinance.\na. shall be laid before the Provincial Assembly and shall stand repealed at the expiration of ninety days from its promulgation or, if before the expiration of that period a resolution disapproving it is passed by\nthe Assembly, upon the passing of that resolution.\nProvided that the Provincial Assembly may by a resolution extend the Ordinance for a further period of ninety days and it shall stand repealed at the expiration of the extended period, or if before the expiration of that period a resolution disapproving it is passed by the Assembly, upon the passing of that resolution: Provided further that extension for a further period may be made only once.\nb. may be withdrawn at any time by the Governor.\n3. Without prejudice to the provisions of clause (2), an Ordinance laid before the Provincial Assembly shall be deemed to be a Bill introduced in the Provincial Assembly.",
    "132": "Article 129: The Provincial Government\n1. Subject to the Constitution, the executive authority of the Province shall be exercised in the name of the\nGovernor by the Provincial Government, consisting of the Chief Minister and Provincial Ministers, which shall act through the Chief Minister.\n2. In the performance of his functions under the Constitution, the Chief Minister may act either directly or through the Provincial Ministers.",
    "133": "Article 130: The Cabinet\n1. There shall be a Cabinet of Ministers, with the Chief Minister at its head, to aid and advise the Governor in the exercise of his functions.\n2. The Provincial Assembly shall meet on the twenty-first day following the day on which a general election to the Assembly is held, unless sooner summoned by the Governor.\n3. After the election of the Speaker and the Deputy Speaker, the Provincial Assembly shall, to the exclusion of any other business, proceed to elect without debate one of its members to be the Chief Minister.\n4. The Chief Minister shall be elected by the votes of the majority of the total membership of the Provincial Assembly:\nProvided that, if no member secures such majority in the first poll, a second poll shall be held between the members who secure the two highest numbers of votes in the first poll and the member who secures a majority of votes of the members present and voting shall be declared to have been elected as Chief Minister: Provided further that, if the number of votes secured by two or more members securing the highest number of votes is equal, further polls shall be held between them until one of them secures a majority of votes of the members present and voting.\n5. The member elected under clause (4) shall be called upon by the Governor to assume the office of Chief Minister and he shall, before entering upon the office, make before the Governor oath in the form set out in the\nThird Schedule:\nProvided that there shall be no restriction on the number of terms for the office of the Chief Minister.\n6. The Cabinet shall be collectively responsible to the Provincial Assembly and the total strength of the Cabinet shall not exceed fifteen members or eleven percent of the total membership of a Provincial Assembly,\nwhichever is higher:\nProvided that the aforesaid limit shall be effective from the next general elections after the commencement of the Constitution (Eighteenth Amendment) Act, 2010\n\n7. The Chief Minister shall hold office during the pleasure of the Governor, but the Governor shall not exercise his powers under this clause unless he is satisfied that the Chief Minister does not command the\nconfidence of the majority of the members of the Provincial Assembly, in which case he shall summon the Provincial Assembly and require the Chief Minister to obtain a vote of confidence from the Assembly.\n8. The Chief Minister may, by writing under his hand addressed to the Governor, resign his office.\n9. A Minister who for any period of six consecutive months is not a member of the Provincial Assembly shall, at the expiration of that period, cease to be a Minister and shall not before the dissolution of that Assembly\nbe again appointed a Minister unless he is elected a member of that Assembly.\n10. Nothing contained in this Article shall be construed as disqualifying the Chief Minister or any other Minister for continuing in office during any period during which the Provincial Assembly stands dissolved, or\nas preventing the appointment of any person as Chief Minister or other Minister during any such period.\n11. The Chief Minister shall not appoint more than five Advisers.",
    "134": "Article 131: Governor to be kept informed\nThe Chief Minister shall keep the Governor informed on matters relating to Provincial administration and on all\nlegislative proposals the Provincial Government intends to bring before the Provincial Assembly.",
    "135": "Article 132: Provincial Minister\n1. Subject to clauses (9) and (10) of Article 130, the Governor shall appoint Provincial Ministers from amongst members of the Provincial Assembly on the advice of the Chief Minister.\n2. Before entering upon office, a Provincial Minister shall make before the Governor oath in the form set out in the Third Schedule.\n3. A Provincial Minister may, by writing under his hand addressed to the Governor, resign his office or may be removed from office by the Governor on the advice of the Chief Minister.",
    "136": "Article 133: Chief Minister continuing in office\nThe Governor may ask the Chief Minister to continue to hold office until his successor enters upon the office of\nChief Minister.",
    "137": "Article 134: This Article has been omitted\n[omitted]",
    "138": "Article 135: This Article has been omitted\n[omitted]",
    "139": "Article 136: Vote of no-confidence against Chief Minister\n1. A resolution for a vote of no-confidence moved by not less than twenty per centum of the total membership of the Provincial Assembly may be passed against the Chief Minister by the Provincial Assembly.\n2. A resolution referred to in clause (1) shall not be voted upon before the expiration of three days, or later than seven days, from the day on which such resolution is moved in the Provincial Assembly.\n3. If the resolution referred to in clause (1) is passed by a majority of the total membership of the Provincial Assembly, the Chief Minister shall cease to hold office",
    "140": "Article 137: Extent of executive authority of Province\nSubject to the Constitution, the executive authority of the Province shall extend to the matters with respect to which the Provincial Assembly has power to make laws.\nProvided that, in any matter with respect to which both Majlis-e-Shoora (Parliament) and the Provincial Assembly of a Province have power to make laws, the executive authority of the Province shall be subject to, and limited by, the executive authority expressly conferred by the Constitution or by law made by Majlis-e-Shoora (Parliament) upon the Federal Government or authorities thereof.",
    "141": "Article 138: Conferring of functions on subordinate authorities\nOn the recommendation of the Provincial Government, the Provincial Assembly may by law confer functions upon officers or authorities subordinate to the Provincial Government.",
    "142": "Article 139: Conduct of business of Provincial Government\n1. All executive actions of the Provincial Government shall be expressed to be taken in the name of the Governor.\n2. The Provincial Government shall by rules specify the manner in which orders and other instruments made and executed in the name of Governor shall be authenticated, and the validity of any order or instrument so authenticated shall not be questioned in any court on the ground that it was not made or executed by the Governor.\n3. The Provincial Government shall also make rules for the allocation and transaction of its business.",
    "143": "Article 140: Advocate-General for a Province\n1. The Governor of each Province shall appoint a person, being a person qualified to be appointed a Judge of the High Court, to be the Advocate-General for the Province.\n2. It shall be the duty of the Advocate-General to give advice to the Provincial Government upon such legal matters, and to perform such other duties of a legal character, as may be referred or assigned to him by the Provincial government.\n3. The Advocate-General shall hold office during the pleasure of the Governor and shall not engage in private practice so long as he holds the office of the Advocate-General.\n4. The Advocate-General may, by writing under his hand addressed to the Governor, resign his office.",
    "144": "Article 140A: Local Government\n1.Each Province shall, by law, establish a local government system and devolve political, administrative and financial responsibility and authority to the elected representatives of the local governments.\n2. Elections to the local governments shall be held by the Election Commission of Pakistan.",
    "145": "Article 141: Extent of Federal and Provincial laws\nSubject to the Constitution, Majlis-e-Shoora (Parliament) may make laws including laws having extraterritorial\noperation  for the whole or any part of Pakistan, and a Provincial Assembly may make laws for the Province or any part thereof.",
    "146": "Article 142: Subject-matter of Federal and Provincial laws\nSubject to the Constitution-\n(a) Majlis-e-Shoora (Parliament) shall have exclusive power to make laws with respect to any matter in the Federal Legislative List;\n(b) Majlis-e-Shoora (Parliament) and a Provincial Assembly shall have power to make laws with respect to criminal law, criminal procedure and evidence.\n(c) Subject to paragraph (b), a Provincial Assembly shall, and Majlis-e-Shoora (Parliament) shall not, have power to make laws with respect to any matter not enumerated in the Federal Legislative List.”.\n(d) Majlis-e-Shoora (Parliament) shall have exclusive power to make laws with respect to all matters pertaining to such areas in the Federation as are not included in any Province.",
    "147": "Article 143: Inconsistency between Federal and Provincial law\nIf any provision of an Act of a Provincial Assembly is repugnant to any provision of an Act of Majlis-e-Shoora (Parliament) which Majlis-e-Shoora (Parliament) is competent to enact, then the Act of Majlis-e-Shoora (Parliament), whether passed before or after the Act of the Provincial Assembly, shall prevail and the Act of the Provincial Assembly shall, to the extent of the repugnancy, be void.",
    "148": "Article 144: Power of Majlis-e-Shoora (Parliament) to legislate for 84[one] or more Provinces by consent\n If one or more Provincial Assemblies pass resolutions to the effect that Majlis-e-Shoora (Parliament) may by law regulate any matter not enumerated in the Federal Legislative List in the Fourth Schedule, it shall be lawful for Majlis-e-Shoora (Parliament) to pass an Act for regulating that matter accordingly, but any act so passed may, as respects any Province to which it applies, be amended or repealed by Act of the Assembly of that Province.",
    "149": "Article 145: Power of President to direct Governor to discharge certain functions as his Agent\n1.The President may direct the Governor of any Province to discharge as his Agent, either generally or in any particular matter, such functions relating to such areas in the Federation which are not included in any Province as\nmay be specified in the direction.\n2. The provisions of Article 105 shall not apply to the discharge by the Governor of his functions under clause(1)",
    "150": "Article 146: Power of Federation to confer powers, etc., on Provinces, in certain cases\n1. Notwithstanding anything contained in the Constitution, the Federal Government may, with the consent of the Government of a Province, entrust either conditionally or unconditionally to that Government, or to its officers functions in relation to any matter to which the executive authority of the Federation extends.\n2. An Act of Majlis-e-Shoora (Parliament) may, notwithstanding that it relates to a matter with respect to which a Provincial Assembly has no power to make laws, confer powers and impose duties upon a province or officers and authorities thereof.\n3. Where by virtue of this Article powers and duties have been conferred or imposed upon a Province or officers or authorities thereof, there shall be paid by the Federation to the Province such sum as may be agreed or, in default of agreement, as may be determined by an arbitrator appointed by the Chief Justice of Pakistan, in respect of any extra costs of administration incurred by the Province in connection with the exercise of those powers or the discharge of those duties.",
    "151": "Article 147: Power of the Provinces to entrust functions to the Federation\nNotwithstanding anything contained in the Constitution, the Government of a Province may, with the consent of the Federal Government, entrust, either conditionally or unconditionally, to the Federal Government, or to its officers, functions in relation to any matter to which the executive authority of the Province extends.\nProvided that the Provincial Government shall get the functions so entrusted ratified by the Provincial Assembly within sixty days.",
    "152": "Article 148: Obligation of Provinces and Federation\n1. The executive authority of every Province shall be so exercised as to secure compliance with Federal laws\nwhich apply in that Province.\n2. Without prejudice to any other provision of this Chapter, in the exercise of the executive authority of the Federation in any Province regard shall be had to the interests of that Province.\n3. It shall be the duty of the Federation to protect every Province against external aggression and internal disturbances and to ensure that the Government of every Province is carried on in accordance with the provisions of the Constitution.",
    "153": "Article 149: Directions to Provinces in certain cases\n1. The executive authority of every Province shall be so exercised as not to impede or prejudice the exercise of the executive authority of the Federation, and the executive authority of the Federation shall extend to the giving of such directions to a Province as may appear to the Federal Government to be necessary for that purpose.\n2. 88[***]\n3. The executive authority of the Federation shall also extend to the giving of directions to a Province as to the construction and maintenance of means of communication declared in the direction to be of national or strategic importance.\n4. The executive authority of the Federation shall also extend to the giving of directions to a Province as to the manner in which the executive authority thereof is to be exercised for the purpose of preventing any grave menace to the peace or tranquility or economic life of Pakistan or any part thereof.",
    "154": "Article 150: Full faith and credit for public acts, etc\nFull faith and credit shall be given throughout Pakistan to public acts and records, and judicial proceedings of\nevery Province.",
    "155": "Article 151: Inter-Provincial trade\n1. Subject to clause (2), trade, commerce and intercourse throughout Pakistan shall be free.\n2. Majlis-e-Shoora (Parliament) may by law impose such restrictions on the freedom of trade, commerce or intercourse between one Province and another or within any part of Pakistan as may be required in the public interest.\n3. A Provincial Assembly or a Provincial Government shall not have power to-\na. make any law, or take any executive action, prohibiting or restricting the entry into, or the export from, the Province of goods of any class or description, or\nb. impose a tax which, as between goods manufactured or produced in the Province and similar goods not so manufactured or produced, discriminates in favour of the former goods or which, in the case of goods manufactured or produced outside the Province discriminates between goods manufactured or produced in any area in Pakistan and similar goods manufactured or produced in any other area in Pakistan.\n4. An Act of a Provincial Assembly which imposes any reasonable restriction in the interest of public health, public order or morality, or for the purpose of protecting animals or plants from disease or preventing or alleviating any serious shortage in the Province of an essential commodity shall not, if it was made with the consent of the President, be invalid.",
    "156": "Article 152: Acquisition of land for Federal purposes\nThe Federation may, if it deems necessary to acquire any land situate in a Province for any purpose connected with a matter with respect to which Majlis-e-Shoora (Parliament) has power to make laws, require the Province to acquire the land on behalf, and at the expense, of the Federation or, if the land belongs to the Province, to transfer it to the Federation on such terms as may be agreed or, in default of agreement, as may be determined by an arbitrator appointed by the Chief Justice of Pakistan.",
    "157": "Article 153: Council of Common Interests\n1. There shall be a Council of Common Interests, in this Chapter referred to as the Council, to be appointed by the President.\n2. The Council shall consist of -\na. the Prime Minister who shall be the Chairman of the Council;\nb. the Chief Ministers of the Provinces; and\nc. three members from the Federal Government to be nominated by the Prime Minister from time to time.\n3. 90[***]\n4. The Council shall be responsible to Majlis-e-Shoora (Parliament) and shall submit an Annual Report to both House of Majlis-e-Shoora (Parliament).",
    "158": "Article 154: Functions and rules of procedure\n1. The Council shall formulate and regulate policies in relation to matters in Part II of the Federal Legislative\nList and shall exercise supervision and control over related institutions.\n2. The Council shall be constituted within thirty days of the Prime Minister taking oath of office.\n3. The Council shall have a permanent Secretariat and shall meet at least once in ninety days: Provided that the Prime Minister may convene a meeting on the request of a Province on an urgent matter.\n4. The decisions of the Council shall be expressed in terms of the opinion of the majority.\n5. Until Majlis-e-Shoora (Parliament) makes provision by law in this behalf, the Council may make its rules of procedure.\n6. Majlis-e-Shoora (Parliament) in joint sit ting may from time to time by resolution issue directions through the Federal Government to the Council generally or in a particular matter to take action as Majlis-e-Shoora (Parliament) may deem just and proper and such directions shall be binding on the Council.\n7. If the Federal Government or a Provincial Government is dissatisfied with a decision of the council, it may refer the matter to Majlis-e-Shoora (Parliament) in a joint sitting whose decision in this behalf shall be final.",
    "159": "Article 155: Complaints as to interference with water supplies\n1. If the interests of a Province, the Federal Capital or the Federally Administered Tribal Areas, or any of the inhabitants thereof, in water from any natural source of supply or reservoir have been or are likely to be affected prejudicially by-\na. any executive act or legislation taken or passed or proposed to be taken or passed, or\nb. the failure of any authority to exercise any of its powers with respect to the use and distribution or control of water from that source, the Federal Government or the Provincial Government concerned may make a complaint in writing to the Council.\n2. Upon receiving such complaint, the Council shall, after having considered the matter, either give its decision or request the President to appoint a commission consisting of such persons having special knowledge and experience in irrigation, engineering, administration, finance or law as he may think fit, hereinafter referred to as the Commission.\n3. Until Majlis-e-Shoora (Parliament) makes provision by law in this behalf, the provisions of the Pakistan Commissions of Inquiry Act, 1956, as in force immediately before the commencing day shall apply to the Council or the Commission as if the Council or the Commission were a commission appointed under that Act to which all the provisions of section 5 thereof applied and upon which the power contemplated by section 10A thereof had been conferred.\n4. After considering the report and supplementary report, if any, of the Commission, the Council shall record its decision on all matters referred to the Commission.\n5. Notwithstanding any law to the contrary, but subject to the provisions of clause (5) of Article 154, it shall be the duty of the Federal Government and the Provincial Government concerned in the matter in issue to give effect to the decision of the Council faithfully according to its terms and tenor.\n6. No proceeding shall lie before any court at the instance of any party to a matter which is or has been in issue before the Council. or of any person whatsoever, in respect of a matter which is actually or has been or might or ought to have been a proper subject of complaint to the Council under this Article",
    "160": "Article 156: National Economic Council\n1. The President shall constitute a National Economic Council which shall consist of -\na. the Prime Minister, who shall be the Chairman of the Council;\nb. the Chief Ministers and one member from each Province to be nominated by the Chief Minister; and\nc. four other members as the Prime Minister may nominate from time to time.\n2. The National Economic Council shall review the overall economic condition of the country and shall, for advising the Federal Government and the Provincial Governments, formulate plans in respect of financial, commercial, social and economic policies; and in formulating such plans it shall, amongst other factors, ensure balanced development and regional equity and shall also be guided by the Principles of Policy set out in\nChapter 2 of Part-II.\n3. The meetings of the Council shall be summoned by the Chairman or on a requisition made by one-half of the members of the Council.\n(4) The Council shall meet at least twice in a year and the quorum for a meeting of the Council shall be one-half of its total membership.\n(5) The Council shall be responsible to the Majlis-e-Shoora (Parliament) and shall submit an Annual Report to each House of Majlis-e-Shoora (Parliament).",
    "161": "Article 157: Electricity\n1. The Federal Government may in any Province construct or cause to be constructed hydro-electric or thermal power installations or grid stations for the generation of electricity and lay or cause to be laid inter-provincial transmission lines:\nProvided that the Federal Government, prior to taking a decision to construct or cause to be constructed, hydro-electric power stations in any Province, shall consult the Provincial Government concerned.; and\n2. The Government of a Province may-\na. to the extent electricity is supplied to that Province from the national grid, require supply to be made in bulk for transmission and distribution within the Province:\nb. levy tax on consumption of electricity within the Province;\nc. construct power houses and grid stations and lay transmission lines for use within the Province; and\nd. determine the tariff for distribution of electricity within the Province.\n3. In case of any dispute between the Federal Government and a Provincial Government in respect of any matter under this Article, any of the said Governments may move the Council of Common Interests for resolution of the dispute.",
    "162": "Article 158: Priority of requirements of natural gas\nThe Province in which a wellhead of natural gas is situated shall have precedence over other parts of Pakistan\nin meeting the requirements from the well-head, subject to the commitments and obligations as on the commencing day.",
    "163": "Article 159: Broadcasting and telecasting\n1. The Federal Government shall not un reasonably refuse to entrust to a Provincial Government such functions with respect to broadcasting and telecasting as may be necessary to enable that Government-\na. to construct and use transmitters in the Province; and\nb. to regulate, and impose fees in respect of, the construction and use of transmitters and the use of receiving apparatus in the Province:\nProvided that nothing in this clause shall be construed as requiring the Federal Government to entrust to any Provincial Government any control over the use of transmitters constructed or maintained by the Federal Government or by persons authorised by the Federal Government, or over the use of receiving apparatus by person so authorised.\n2. Any functions so entrusted to a Provincial Government shall be exercised subject to such conditions as may be imposed by the Federal Government, including, notwithstanding anything contained in the Constitution,\nany conditions with respect to finance, but it shall not be lawful for the Federal Government so to impose any conditions regulating the matter broadcast or telecast by, or by authority of, the Provincial Government.\n3. Any Federal law with respect to broadcasting and telecasting shall be such as to secure that effect can be given to the foregoing provisions of this Article.\n4. If any question arises whether any conditions imposed on any Provincial Government are lawfully imposed, or whether any refusal by the Federal Government to entrust functions is unreasonable, the question shall be determined by an arbitrator appointed by the Chief Justice of Pakistan.\n5. Nothing in this article shall be construed as restricting the powers of the Federal Government under the Constitution for the prevention of any grave menace to the peace or tranquility of Pakistan or any part thereof.",
    "164": "Article 160: National Finance Commission\n1. Within six months of the commencing day and thereafter at intervals not exceeding five years, the President shall constitute a National Finance Commission consisting of the Minister of Finance of the Federal Government, the Ministers of Finance of the Provincial Governments, and such other persons as may be appointed by the President after consultation with the Governors of the Provinces.\n2. It shall be the duty of the National Finance Commission to make recommendations to the President as to-\na. the distribution between the.Federation and the Provinces of the net proceeds of the taxes mentioned in clause (3);\nb. the making of grants-in-aid by the Federal Government to the Provincial Governments;\nc. the exercise by the Federal Government and the Provincial Governments of the borrowing powers conferred by the Constitution; and\nd. any other matter relating to finance referred to the Commission by the President.\n3. The taxes refer red to in paragraph (a) of clause (2) are the following taxes raised under the authority of Majlis-e-Shoora (Parliament), namely-\ni. taxes on income, including corporation tax, but not including taxes on income consisting of remuneration paid out of the Federal Consolidated Fund;\nii. taxes on the sales and purchases of goods imported, exported, produced, manufactured or consumed;\niii. export duties on cotton, and such other export duties as may be specified by the President;\niv. export duties on cotton, and such other export duties as may be specified by the President;\nv. such duties of exercise as may be specified by the President; and\nvi. such other taxes as may be specified by the President.\n3A. The share of the Provinces in each Award of National Finance Commission shall not be less than the share given to the Provinces in the previous Award.\n3B. The Federal Finance Minister and Provincial Finance Ministers shall monitor the implementation of the Award biannually and lay their reports before both Houses of Majlis-e-Shoora (Parliament) and the Provincial\nAssemblies.\n4. As soon as may be after receiving the recommendation, of the National Finance Commission, the President shall, by Order, specify, in accordance with the recommendations of the Commission under paragraph (a) of\nclause (2), the share of the net proceeds of the taxes mentioned in clause (3) which is to be allocated to each Province, and that share shall be paid to the Government of the Province concerned, and, notwithstanding the provision of Article 78 shall not form part of the Federal Consolidated Fund.\n5. The recommendations of the National Finance Commission, together with an explanatory memorandum as to the action taken thereon, shall be laid before both Houses and the Provincial Assemblies.\n6. At any time before an Order under clause (4) is made, the President may, by Order, make such amendments or modifications in the law relating to the distribution of revenues between the Federal Government and the Provincial Governments as he may deem necessary or expedient.\n7. The President may, by Order, make grants-in-aid of the revenues of the Provinces in need of assistance and such grants shall be charged upon the Federal Consolidated Fund.",
    "165": "Article 161: Natural gas and hydro-electric power\n1. Notwithstanding the provisions of Article 78,-\na. The net proceeds of the Federal duty of excise on natural gas levied at well-head and collected by the Federal Government and of the royalty collected by the Federal Government, shall not form part of the Federal Consolidated Fund and shall be paid to the Province in which the well-head of natural gas is situated;\nb. The net proceeds of the Federal duty of excise on oil levied at well-head and collected by the Federal Government, shall not form part of the Federal Consolidated Fund and shall be paid to the Province in which the well-head of oil is situated.\n2. The net profits earned by the Federal Government, or any undertaking established or administered by the Federal Government from the bulk generation of power at a hydro-electric station shall be paid to the Province in which the hydro-electric station is situated.\nExplanation- For the purposes of this clause \"net profits\" shall be computed by deducting from the revenues accruing from the bulk supply of power from the bus-bars of a hydro-electric station at a rate to be determined by the Council of Common Interests, the operating expenses of the station, which shall include any sums payable as taxes, duties, interest or return on investment, and depreciations and element of obsolescence, and over-heads, and provision for reserves.",
    "166": "Article 162: Prior sanction of President to Bills affecting taxation in which Provinces are interested\nNo Bill or amendment which imposes or varies a tax or duty the whole or part of the net proceeds whereof is assigned to any Province, or which varies the meaning of the expression \"agricultural income\" as defined for\nthe purpose of the enactments relating to income-tax, or which affects the principles on which under any of the foregoing provisions of this Chapter moneys are or may be distributable to Provinces, shall be introduced or moved in the National Assembly except with the previous sanction of the President.",
    "167": "Article 163: Provincial taxes in respect of professions, etc\nA Provincial Assembly may by Act impose taxes, not exceeding such limits as may from time to time be\nfixed by Act of Majlis-e-Shoora (Parliament), on persons engaged in professions, trades, callings or employments, and no such Act of the Assembly shall be regarded as imposing a tax on income.",
    "168": "Article 164: Grants out of Consolidated Fund\nThe Federation or a Province may make grants for any purpose, notwithstanding that the purpose is not one with\nrespect to which Majlis-e-Shoora (Parliament) or, as the case may be, a Provincial Assembly may make laws.",
    "169": "Article 165: Exemption of certain public property from taxation\n1. The Federal Government shall not, in respect of its property or income, be liable to taxation under any Act of Provincial Assembly and, subject to clause (2), a Provincial Government shall not, in respect of its property or income, be liable to taxation under Act of Majlis-e-Shoora (Parliament) or under Act of the Provincial Assembly of any other Province.\n2. If a trade or business of any kind is carried on by or on behalf of the Government of a Province outside that Province, that Government may, in respect of any property used in connection with that trade or business or any income arising from that trade or business, be taxed under Act of Majlis-e-Shoora (Parliament) or under Act of the Provincial Assembly of the Province in which that trade or business is carried on.\n3. Nothing in this Article shall prevent the imposition of fees for services rendered.",
    "170": "Article 165A: Power of Majlis-e-Shoora (Parliament) to impose tax on the income of certain corporations, etc\n1. For the removal of doubt, it is hereby declared that Majlis-e-Shoora (Parliament) has, and shall be deemed always to have had, the power to make a law to provide for the levy and recovery of a tax on the income of a corporation, company or other body or institution established by or under a\nFederal law or a Provincial law or an existing law or a corporation, company or other body or institution owned or controlled, either directly or indirectly, by the Federal Government or a Provincial Government, regardless of the ultimate destination of such income.\n2. All orders made, proceedings taken and acts done by any authority or person, which were made, taken or done, or purported to have been made, taken or done, before the commencement of the Constitution (Amendment) Order 1985, in exercise of the powers derived from any law referred to in clause (1), or in execution of any orders made by any authority in the exercise or purported exercise of powers as aforesaid, shall, notwithstanding any judgment of any court or tribunal, including the Supreme Court and a High Court, be deemed to be and always to have been validly made, taken or done and-shall not be called in question in any court, including the Supreme Court and a High Court, on any ground whatsoever.\n3. Every judgment or order of any court or tribunal, including the Supreme Court and a High Court, which is repugnant to the provisions of clause (1) or clause (2) shall be, and shall be deemed always to have been, void and of no effect whatsoever.",
    "171": "Article 166: Borrowing by Federal Government\nThe executive authority of the Federation extends to borrowing upon the security of the Federal Consolidated\nFund within such limits, if any, as may from time to time be fixed by Act of Majlise- Shoora (Parliament), and to the giving of guarantees within such limits, if any, as may be so fixed.",
    "172": "Article 167: Borrowing by Provincial Government\n1. Subject to the provisions of this Article, the executive authority of a Province extends to borrowing upon the security of the Provincial Consolidated Fund within such limits, if any, as may from time to time be fixed by Act of the Provincial Assembly, and to the giving of guarantees within such limits, if any, as may be so fixed.\n2. The Federal Government may, subject to such conditions, if any, as it may think fit to impose, make loans to, or so long as any limits fixed under Article 166 are not exceeded give guarantees in respect of loans raised by, any Province, and any sums required for the purpose of making loans to a Province shall be charged upon the Federal Consolidated Fund.\n3. A Province may not, without the consent of the Federal Government, raise any loan if there is still outstanding any part of a loan made to the Province by the Federal Government, or in respect of which guarantee has been given by the Federal Government; and consent under this clause may be granted subject to\nsuch conditions, if any, as the Federal Government may think fit to impose.\n4. A Province may raise domestic or international loan, or give guarantees on the security of the Provincial Consolidated Fund within such limits and subject to such conditions as may be specified by the National\nEconomic Council.",
    "173": "Article 168: Auditor-General of Pakistan\n1. There shall be an Auditor-General of Pakistan, who shall be appointed by the President.\n2. Before entering upon office, the Auditor-General shall make before the Chief Justice of Pakistan oath in the form set out in the Third Schedule.\n3. The Auditor-General shall, unless he sooner resigns or is removed from office in accordance with clause(5)  hold office for a term of four years from the date on which he assumes such office or attains the age of sixty-five years, whichever is earlier.\n3A. The other terms and conditions of service of the Auditor-General shall be determined by Act of Majlis-e-Shoora (Parliament); and, until so determined, by Order of the President; and\n4. A person who has held office as Auditor-General shall not be eligible for further appointment in the service of Pakistan before the expiration of two years after he has ceased to hold that office.\n5. The Auditor-General shall not be removed from office except in the like manner and on the like grounds as a Judge of the Supreme Court.\n6. At any time when the office of the Auditor-General is vacant or the Auditor-General is absent or is unable to perform the functions of his office due to any cause, the President may appoint the most senior officer in the Office of the Auditor-General to act as Auditor-General and perform the functions of that office.",
    "174": "Article 169: Functions and powers of Auditor-General\nThe Auditor-General shall, in relation to-\na. the accounts of the Federation and of the Provinces; and\nb. the accounts of any authority or body established by the Federation or a Province, perform such functions and exercise such powers as may be determined by or under Act of' Majlis-e-Shoora (Parliament) and, until so determined, by Order of the President.",
    "175": "Article 170: Power of Auditor-General to give directions as to accounts\n1. The accounts of the Federation and of the Provinces shall be kept in such form and in accordance with such principles and methods as the Auditor-General may, with the approval of the President, prescribe.\n2. The audit of the accounts of the Federal and of the Provincial Governments and the accounts of any authority or body established by, or under the control of, the Federal or a Provincial Government shall be conducted by the Auditor-General, who shall determine the extent and nature of such audit.",
    "176": "Article 171: Reports of Auditor-General\nThe reports of the Auditor-General relating to the accounts of the Federation shall be submitted to the President, who shall cause them to be laid before both Houses of Majlis-e-Shoora (Parliament) and the reports of the Auditor-General relating to the accounts of a Province shall be submitted to the Governor of the Province, who shall cause them to be laid before the Provincial Assembly.",
    "177": "Article 172: Ownerless property\n1. Any property which has no rightful owner shall, if located in a Province, vest in the Government of that Province, and in every other case, in the Federal Government.\n2. All lands, minerals and other things of value within the continental shelf or underlying the ocean beyond the territorial waters of Pakistan shall vest in the Federal Government.\n3. Subject to the existing commitments and obligations, mineral oil and natural gas within the Province or the territorial waters adjacent thereto shall vest jointly and equally in that Province and the Federal Government.",
    "178": "Article 173: Power to acquire property and to make contracts, etc\n1. The executive authority of the Federation and of a Province shall extend, subject to any Act of the appropriate Legislature, to the grant, sale, disposition or mortgage of any property vested in, and to the purchase or acquisition of property on behalf of, the Federal Government or, as the case may be, the Provincial Government, and to the making of contracts.\n2. All property acquired for the purposes of the Federation or of a Province shall vest in the Federal Government or, as the case may be, in the Provincial Government.\n3. All contracts made in the exercise of the executive authority of the Federation or of a Province shall be expressed to be made in the name of the President or, as the case may be, the Governor of the Province, and all such contracts and all assurances of property made in the exercise of that authority shall be executed on behalf of the President or Governor by such persons and in such manner as he may direct or authorize.\n4. Neither the President, nor the Governor of a Province, shall be personally liable in respect of any contract or assurance made or executed in the exercise of the executive authority of the Federation or, as the case may be, the Province, nor shall any person making or executing any such contract or assurance on behalf of any of them be personally liable in respect thereof.\n5. Transfer of land by the Federal Government or a Provincial Government shall be regulated by law.",
    "179": "Article 174: Suits and proceedings\nThe Federation may sue or be sued by the name of Pakistan and a Province may sue or be sued by the name of the Province.",
    "180": "Article 175: Establishment and Jurisdiction of Courts\n1. There shall be a Supreme Court of Pakistan, a High Court for each Province and a High Court for the\nIslamabad Capital Territory, and such other courts as may be established by law.\nExplanation:-- Unless the context otherwise, the words “High Court” wherever occurring in the constitution shall include “Islamabad High Cout\".\n2. No court shall have any jurisdiction save as is or may be conferred on it by the Constitution or by or under any law.\n3. The Judiciary shall be separated progressively from the Executive within fourteen years from the commencing day.",
    "181": "Article 175A: Appointment of Judges to the Supreme Court, High Courts and the Federal Shariat Court\n1. There shall be a Judicial Commission of Pakistan, hereinafter in this Article referred to as the Commission, for appointment of Judges of the Supreme Court, High Courts and the Federal Shariat Court, as hereinafter provided.\n2. For appointment of Judges of the Supreme Court, the Commission shall consist of-\ni. Chief Justice of Pakistan;                                         Chairman\nii. four most senior Judges of the Supreme Court;        Members\niii. a former Chief Justice or a former Judge of the Supreme Court of Pakistan to be nominated by the Chief Justice of Pakistan, in consultation with the four member Judges, for a term of two years; Member\niv. Federal Minister for Law and Justice;                     Member\nv. Attorney-General for Pakistan; and                         Member\nvi. a Senior Advocate of the Supreme Court of Pakistan nominated by the Pakistan Bar Council for a term of two years.                                                     Member\n\n3. Notwithstanding anything contained in clause (1) or clause (2), the President shall appoint the most senior Judge of the Supreme Court as the Chief Justice of Pakistan.\n4. The Commission may make rules regulating its procedure.\n5. For appointment of Judges of a High Court, the Commission in clause (2) shall also include the following, namely:-\ni. Chief Justice of the High Court to which the appointment is being made;     Member\nii. the most senior Judge of that High Court;                 Member\niii. Provincial Minister for Law; and                              Member\niv. an advocate having not less than fifteen years practice in the High Court to be nominated by\nthe concerned Bar Council for a term of two years;      Member\nProvided that for appointment of the Chief Justice of a High Court the most Senior Judge mentioned in paragraph (ii) shall not be member of the Commission:\nProvided further that if for any reason the Chief Justice of a High Court is not available, he shall substituted by a former Chief Justice or formerm Judge of the Court, to be nominated by the Chief Justice of Pakistan in consultation with the four member Judges of the Commission mentioned in paragraph (ii) of clause (2).\n6. For appointment of Judges of the Islamabad High Court, the Commission in clause (2) shall also include the following, namely:-\ni. Chief Justice of the Islamabad High Court; and     Member\nii. the most senior Judge of that High Court;             Member\nProvided that for initial appointment of the Chief Justice and the Judges of t he Islamabad High Court, the Chief Justices of the four Provincial High Courts shall also be members of the Commission:\nProvided further that subject to the foregoing proviso, in case of appointment of Chief Justice of Islamabad High Court, the provisos to clause (5) shall, mutatis mutandis, apply.\n7. For appointment of Judges of the Federal Shariat Court, the Commission in clause (2) shall also include the Chief Justice of the Federaln Shariat Court and the most senior Judge of that Court as its members:\nProvided that for appointment of Chief Justice of Federal Shariat Court, the provisos to clause (5) shall, mutatis mutandis, apply.\n8. The Commission by majority of its total membership shall nominate to the Parliamentary Committee one person, for each vacancy of a Judge in the Supreme Court, a High Court or the Federal Shariat Court, as\nthe case may be;\n9. The Parliamentary Committee, hereinafter in this Article referred to as the Committee, shall consist of the following eight members, namely:-\ni. four members from the Senate; and\nii. four members from the National Assembly\nProvided that when the National Assembly is dissolved, the total membership of the Parliamentary Committee shall consist of the members from the Senate only mentioned in paragraph (i) and the provisions of this Article shall, mutatis mutandis, reply.\n10. Out of the eight members of the Committee, four shall be from the Treasury Benches, two from each House and four from the Opposition Benches, two from each House. The nomination of members from the\nTreasury Benches shall be made by the Leader of the House and from the Opposition Benches by the Leader of the Opposition.\n11. Secretary, Senate shall act as the Secretary of the Committee.\n12. The Committee on receipt of a nomination from the Commission may confirm the nominee by majority of its total membership within fourteen days, failing which the nomination shall be deemed to have been confirmed:\nProvided that the Committee, for reasons to be recorded may not be confirm the nomination by three-fourth majority of its total membership within the said period, and,\nProvided further that if a nomination is not confirmed by the Committee it shall forward its decision with reasons so recorded to the Commission through the Prime Minister:\nProvided further that if a nomination is not confirmed, the Commission\nshall send another nomination.\n13. The Committee shall send the name of the nominee confirmed by it or deemed to have been confirmed to the Prime Minister who shall forward the same to the President for appointment.\n14. No action or decision taken by the Commission or a Committee shall be invalid or called in question only on the ground of the existence of a vacancy therein or of the absence of any member from any meeting thereof.\n15. The meetings of the Committee shall be held in camera and the record of its proceedings shall be maintained.\n16. The provisions of Article 68 shall not apply to the proceedings of the Committee.\n17. The Committee may make rules for regulating its procedure.",
    "182": "Article 176: Constitution of Supreme Court\nThe Supreme Court shall consist of a Chief Justice to be known as the Chief Justice of Pakistan and so many other Judges as may be determined by Act of Majlis-e-Shoora(Parliament) or, until so determined, as may be fixed by the President.",
    "183": "Article 177: Appointment of Supreme Court Judges\n1. The Chief Justice of Pakistan and each of the other Judges of the Supreme Court shall be appointed by the President in accordance with Article 175A.\n2. A person shall not be appointed a Judge of the Supreme Courtunless he is a citizen of Pakistan and-\na. has for a period of, or for periods aggregating, not less than five years been a judge of a High Court including a High Court which existed in Pakistan at any time before the commencing day or\nb. has for a period of, or for periods aggregating not less than fifteen years been an advocate of a High Court including a High Court which existed in Pakistan at any time before the commencing day.",
    "184": "Article 178: Oath of Office\nBefore entering upon office, the Chief Justice of Pakistan shall make before the President, and any other Judge of the Supreme Court shall make before the Chief Justice, oath in the form set out in the Third Schedule.",
    "185": "Article 179: Retiring Age\nA judge of the Supreme Court shall hold office until he attains the age of sixty five years, unless he sooner resigns or is removed from office in accordance with the Constitution.",
    "186": "Article 180: Acting Chief Justice\nAt any time when-\na. the office of Chief Justice of Pakistan is vacant; or\nb. the Chief Justice of Pakistan is absent or is unable to perform the functions of his office due to any other cause, the President shall appoint the most senior of the other Judges of the Supreme Court to act as Chief Justice of Pakistan.",
    "187": "Article 181: Acting Judges\n1. At any time when-\na. the office of a Judge of the Supreme Court is vacant; or\nb. a Judge of the Supreme Court is absent or is unable to perform the functions of his office due to any other cause, the President may, in the manner provided in clause (1) of Article 177, appoint a Judge of a High Court who is qualified for appointment as a Judge of the Supreme Court to act temporarily as a Judge of the Supreme Court.\nExplanation.-In this clause, 'Judge of a High Court' includes a person who has retired as a Judge of a High Court.\n2. An appointment under this Article shall continue in force until it is revoked by the President.",
    "188": "Article 182: Appointment of ad hoc Judges\nIf at any time it is not possible for want of quorum of Judges of the Supreme Court to hold or continue any sitting of the Court, or for any other reason it is necessary to increase temporarily the number of Judges of the Supreme Court, the Chief Justice of Pakistan in consultation with the Judicial Commission as provided in clause (2) of Article 175 A, may, in writing,-\na. with the approval of the President, request any person who has held the office of a Judge of that Court and since whose ceasing to hold that office three years have not elapsed; or\nb. with the approval of the President and with the consent of the Chief justice of a High Court, require a Judge of that Court qualified for appointment as a judge of the Supreme Court, to attend sittings of the Supreme Court as an ad hoc Judge for such period as may be necessary and while so attending an ad hoc Judge shall have the same power and jurisdiction as a Judge of the Supreme Court.",
    "189": "Article 183: Seat of the Supreme Court\n1. The permanent seat of the Supreme Court shall, subject to clause (3), be at Islamabad.\n2. The Supreme Court may from time to time to time sit in such other places as the Chief Justice of Pakistan, with the approval of the President, may appoint.\n3. Until provision is made for establishing the Supreme Court at Islamabad, the seat of the Court shall be at such place as the President may appoint.",
    "190": "Article 184: Original Jurisdiction of Supreme Court\n1. The Supreme Court shall, to the exclusion of every other court, have original jurisdiction in any dispute between any two or more Governments.\nExplanation.- In this clause, \"Governments\" means the Federal Government and the Provincial Governments.\n2. In the exercise of the jurisdiction conferred on it by clause (1), the Supreme Court shall pronounce declaratory judgments only.\n3. Without prejudice to the provisions of Article 199, the Supreme Court shall, if it considers that a question of public importance with reference to the enforcement of any of the Fundamental Rights conferred by Chapter I of Part II is involved have the power to make an order of the nature mentioned in the said Article.",
    "191": "Article 185: Appellate Jurisdiction of Supreme Court\n1. Subject to this Article, the Supreme Court shall have jurisdiction to hear and determine appeals from\njudgments, decrees, final orders or sentences of a High Court.\n2. An appeal shall lie to the Supreme Court from any judgment, decree, final order or sentence-\na. if the High Court has on appeal reversed an order of acquittal of an accused person and sentenced him to death or to transportation forn life or imprisonment for life; or, on revision, has enhanced a sentence to a sentence as aforesaid; or\nb. if the High Court has withdrawn for trial before itself any case from any court subordinate to it and has in such trial convicted the accused person and sentenced him as aforesaid; or\nc. if the High Court has imposed any punishment on any person for contempt of the High Court; or\nd. if the amount or value of the subject matter of the dispute in the court of first instance was, and also in dispute in appeal is, not less than fifty thousand rupees or such other sum as may be specified in that behalf by Act of Majlis-e-Shoora(Parliament) and the judgment, decree or final order appealed from has varied or set aside the judgment, decree or final order of the court immediately below; or\ne. if the judgment, decree or final order involves directly or indirectly some claim or question respecting property of the like amount or value and the judgment, decree or final order appealed from has\nvaried or set aside the judgment, decree or final order of the court immediately below; or\nf. if the High Court certifies that the case involves a substantial question of law as to the interpretation of the Constitution.\n3. An appeal to the Supreme Court from a judgment, decree, order or sentence of a High Court in a case to which clause (2) does not apply shall lie only if the Supreme Court grants leave to appeal.",
    "192": "Article 186: Advisory Jurisdiction\n1. If, at any time, the President considers that it is desirable to obtain the opinion of the Supreme Court on any question of law which he considers of public importance, he may refer the question to the Supreme Court for consideration.\n2. The Supreme Court shall consider a question so referred and report its opinion on the question to the President.",
    "193": "Article 186A: Power of Supreme Court to Transfer Cases\n The Supreme Court may, if it considers it expedient to do so in the interest of justice, transfer any case, appeal or other proceedings pending before any High Court to any other High Court or withdraw any ease, appeal or other proceeding pending before a High Court to it and dispose of the same.",
    "194": "Article 187: Issue and Execution of Processes of Supreme Court\n1. Subject to clause (2) of Article 175, the Supreme Court shall have power to issue such directions, orders or decrees as may be necessary for doing complete justice in any case or matter pending before it, including an order for the purpose of securing the attendance of any person or the discovery or production of any document.\n2. Any such direction, order or decree shall be enforceable throughout Pakistan and shall, where it is to be executed in a Province, or a territory or an area not forming part of a Province but within the jurisdiction of the High Court of the Province, be executed as if it had been issued by the High Court of that Province.\n3. If a question arises as to which High Court shall give effect to a direction, order or decree of the Supreme Court, the decision of the Supreme Court on the question shall be final.",
    "195": "Article 188: Review of Judgments or Orders by the Supreme Court\nThe Supreme Court shall have power, subject to the provisions of any Act of Majlis-e-Shoora (Parliament) and of any rules made by the Supreme Court, to review any judgment pronounced or any order made by it.",
    "196": "Article 189: Decisions of Supreme Court binding on other Courts\nAny decision of the Supreme Court shall, to the extent that it decides a question of law or is based upon or enunciates a principle of law, be binding on all other courts in Pakistan.",
    "197": "Article 190: Action in aid of Supreme Court\nAll executive and judicial authorities through out Pakistan shall act in aid of the Supreme Court.",
    "198": "Article 191: Rules of Procedure\nSubject to the Constitution and law, the Supreme Court may make rules regulating the practice and procedure of the Court.",
    "199": "Article 192: Constitution of High Court\n1. A High Court shall consist of a Chief Justice and so many other Judges as may be determined by law or, until so determined, as may be fixed by the President.\n2. The Sindh and Balochistan High Court shall cease to function as a common High Court for the Provinces of Balochistan and Sindh.\n3. The President shall, by Order, establish a High Court for each of the Provinces of Balochistan and Sindh and may make such provision in the Order for the principal seats of the two High Courts, transfer of the Judges of the common High Court, transfer of cases pending in the common High Court immediately before the establishment of two High Courts and, generally, for matters consequential or ancillary to the common High Court ceasing to function and the establishment of the two High Courts as he may deem fit.\n4. The jurisdiction of a High Court may, by Act of Majlis-e-Shoora (Parliament), be extended to any area in Pakistan not forming part of a Province.",
    "200": "Article 193: Appointment of High Court Judges\n1. The Chief Justice and each of other Judges of a High Court shall be appointed by the President in\naccordance with Article 175A.\n2. A person shall not be appointed a Judge of a High Court unless he is a citizen of Pakistan, is not less than forty-five years of age, and-\na. he has for a period of, or for periods aggregating, not less than ten years been an advocate of a High Court (including a High Court which existed in Pakistan at any time before the commencing day); or\nb. he is, and has for a period of not less than ten years been, a member of a civil service prescribed by law for the purposes of this paragraph, and has, for a period of not less than three years, served as or exercised the functions of a District Judge in Pakistan; or\nc. he has, for a period of not less than ten years, held a judicial office in Pakistan.\nExplanation.- In computing the period during which a person has been an advocate of a High Court or held judicial office, there shall be included any period during which he has held judicial office after he became an advocate or, as the case may be, the period during which he has been an advocate after having held judicial office.\n3. In this Article, \"District Judge\" means Judge of a principal civil court of original jurisdiction.",
    "201": "Article 194: Oath of Office\nBefore entering upon office, the Chief Justice of a High Court shall make before the Governor, and any other Judge of the Court shall make before the Chief Justice, oath in the form set out in the Third Schedule.\nProvided that the Chief Justice of the Islamabad High Court shall make oath before the President and other Judges of that Court shall make oath before the Chief Justice of the Islamabad High Court.",
    "202": "Article 195: Retiring Age\nA judge of the High Court shall hold office until he attains the age of sixty-two years, unless he sooner resigns or is removed from office in accordance with the Constitution.",
    "203": "Article 196: Acting Chief Justice\nAt any time when-\n(a) the office of Chief Justice of a High Court is vacant, or\n(b) the Chief Justice of a High Court is absent or is unable to perform the functions of his office due to any other cause, the President shall appoint one of the other Judges of the High Court, or may request one of the Judges of the Supreme Court, to act as Chief Justice.",
    "204": "Article 197: Additional Judges\nAt any time when-\n(a) the office of a Judge of a High Court is vacant; or\n(b) a Judge of a High Court is absent or is unable to perform the functions of his office due to any other cause; or\n(c) for any reason it is necessary to increase the number of Judges of a High Court, the President may, in the manner provided in clause (1) of Article 193, appoint a person qualified for appointment as a Judge\nof the High Court to be Additional Judge of the Court for such period as the President may determine, being a period not exceeding such period, if any, as may be prescribed by law.",
    "205": "Article 198: Seat of the High Court\n1. Each High Court in existence immediately before the commencing day shall continue to have its principal seat at the place where it had such seat before that day.\n1A. The High Court for Islamabad Capital Territory shall have its principal seat at Islamabad.\n2. Each High Court and the Judges and divisional courts thereof shall sit at its principal seat and the seats of its Benches and may hold, at any place within its territorial jurisdiction, circuit courts consisting of such of the Judges as may be nominated by the Chief Justice.\n3. The Lahore High Court shall have a Bench each at Bahawalpur, Multan and Rawalpindi; the High Court of Sindh shall have a Bench at Sukkur; the Peshawar High Court shall have a Bench each at Abbottabad Mingora and Dera Ismail Khan and the High Court of Balochistan shall have a Bench at Sibi and Turbat.\n4. Each of the High Courts may have Benches at such other places as the Governor may determine on the advice of the Cabinet and in consultation with the Chief Justice of the High Court.\n5. A Bench referred in clause (3), or established under clause (4), shall consist of such of the Judges of the High Court as may be nominated by the Chief Justice from time to time for a period of not less than one year.\n6. The Governor in consultation with the Chief Justice of the High Court shall make rules to provide the following matters, that is to say-\na. assigning the area in relation to which each Bench shall exercise jurisdiction vested in the High Court; and\nb. for all incidental, supplemental or consequential matters.",
    "206": "Article 199: Jurisdiction of High Court\n1. Subject to the Constitution, a High Court may, if it is satisfied that no other adequate remedy is provided by law-\na. on the application of any aggrieved party, make an order-\ni. directing a person performing, within the territorial jurisdiction of the Court, functions in connection with the affairs of the Federation, a Province or a local authority, to refrain from doing anything he is not permitted by law to do, or to do anything he is required by law to do; or\nii. declaring that any act done or proceeding taken within the territorial jurisdiction of the Court by a person performing functions in connection with the affairs of the Federation, a Province or a local authority has been done or taken without lawful authority and is of no legal effect; or\nb. on the application of any person, make an order-\ni. directing that a person in custody within the territorial jurisdiction of the Court be brought before it so that the Court may satisfy itself that he is not being held in custody without lawful authority or in an unlawful manner; or\nii. requiring a person within the territorial jurisdiction of the Court holding or purporting to hold a public office to show under what authority of law he claims to hold that office; or\nc. on the application of any aggrieved person, make an order giving such directions to any person or authority, including any Government exercising any power or performing any function in, or in relation to, any territory within the jurisdiction of that Court as may be appropriate for the enforcement of any of the Fundamental Rights conferred by Chapter 1 of Part II.\n2. Subject to the Constitution, the right to move a High Court for the enforcement of any of the Fundamental Rights conferred by Chapter 1 of Part II shall not be abridged.\n3. An order shall not be made under clause (1) on application made by or in relation to a person who is a member of the Armed Forces of Pakistan, or who is for the time being subject to any law relating to any of those Forces, in respect of his terms and conditions of service, in respect of any matter arising out of his service, or in respect of any action taken in relation to him as a member of the Armed Forces of Pakistan or as a person subject to such law.\n4. Where-\na. an application is made to a High Court for an order under paragraph (a) or paragraph (c) of clause (1), and\nb. the making of an interim order would have the effect of prejudicing or interfering with the carrying out of a public work or of otherwise being harmful to public interest or State property or of impeding the assessment or collection of public revenues, the Court shall not make an interim order unless the prescribed law officer has been given notice of the application and he or any person authorised by him in that behalf has had an opportunity of being heard and the Court, for reasons to be recorded in writing, is satisfied that the interim order-\ni. would not have such effect as aforesaid; or\nii. would have the effect of suspending an order or proceeding which on the face of the record is without jurisdiction.\n4A. An interim order made by a High Court on an application made to it to question the validity or legal effect of any order made, proceeding taken or act done by any authority or person, which has been made, taken or done or purports to have been made, taken or done under any law which is specified in Part I of the First Schedule or relates to, or is connected with, State property or assessment or collection of public revenues shall cease to have effect on the expiration of a period of six months following the day on\nwhich it is made:\nProvided that the matter shall be finally decided by the High Court within six months from the date on which the interim order is made.\n5. In this Article, unless the context otherwise requires,- \"person\" includes any body politic or corporate, any authority of or under the control of the Federal Government or of a Provincial Government, and any Court or tribunal, other than the Supreme Court, a High Court or a Court or tribunal established under a law relating to the Armed Forces of Pakistan; and \"prescribed law officer\" means\na. in relation to an application affecting the Federal Government or an authority of or under the control of the Federal Government, the Attorney-General, and\nb. in any other case, the Advocate-General for the Province in which the application is made.",
    "207": "Article 200: Transfer of High Court Judges\n1. The President may transfer a Judge of a High Court from one High Court to another High Court, but no Judge shall be so transferred except with his consent and after consultation by the President with the Chief Justice of Pakistan and the Chief Justices of both High Courts.\nExplanation.- In this Article, \"Judge\" does not include a Chief Justice but includes a Judge for the time being acting as Chief Justice of a High Court other than a Judge of the Supreme Court acting as such in pursuance of a request made under paragraph (b) of Article 196.\n2. Where a Judge is so transferred or is appointed to an office other than the principal seat of the High Court, he shall, during the period for which he serves as a judge of the High Court to which he is transferred, or holds such other office, be entitled to such allowances and privileges, in addition to his salary, as the President may, by Order, determine.\n3. If at any time it is necessary for any reason to increase temporarily the number of Judges of a High Court, the Chief Justice of that Court may require a Judge of any other High Court to attend sittings of the former High Court for such period as may be necessary and, while so attending the sittings of the High Court,\nthe Judge shall have the same power and jurisdiction as a Judge of that High Court.\nProvided that a Judge shall not be so required except with his consent and the approval of the President and after consultation with the Chief Justice of Pakistan and the Chief Justice of the High Court of which he is a Judge.\nExplanation.- In this Article, \"High Court\" includes a Bench of a High Court.",
    "208": "Article 201: Decision of High Court binding on Subordinate Courts\nSubject to Article 189, any decision of a High Court shall, to the extent that it decides a question of law or is based upon or enunciates a principle of law, be binding on all courts subordinate to it.",
    "209": "Article 202: Rules of Procedure\nSubject to the Constitution and law, a High Court may make rules regulating the practice and procedure of the Court or of any court subordinate to it.",
    "210": "Article 203: High Court to superintend Subordinate Courts\nEach High Court shall supervise and control all courts subordinate to it.",
    "211": "Article 203A: Provisions of Chapter to override other Provisions of Constitution\nThe provisions or this Chapter shall have effect notwithstanding anything contained in the Constitution.",
    "212": "Article 203B: Definitions\nIn this Chapter, unless there is anything repugnant in the subject or context,-\na. \"Chief Justice\" means, Chief Justice of the Court;\nb. \"Court\" means the Federal Shariat Court constituted in pursuance of Article 203C;\nbb. \"judge\" means judge of the Court;\nc. \"law\" includes any custom or usage having the force of law but does not include the Constitution, Muslim personal law, any law relating to the procedure of any Court or tribunal or, until the expiration of ten years from the commencement of this Chapter, any fiscal law or any law relating to the levy and collection of taxes and fees or banking or insurance practice and procedure; and",
    "213": "Article 203C: The Federal Shariat Court\n1. There shall be constituted for the purposes of this Chapter a court to be called the Federal Shariat Court.\n2. The Court shall consist of not more than eight Muslim Judges, including the Chief Justice, to be appointed by the President 130[in accordance with Article 175A.\n3. The Chief Justice shall be a person who is, or has been, or is qualified, to be, a Judge of the Supreme Court or who is or has been a permanent Judge of a High Court.\n3A. Of the Judges, not more than four shall be persons each one of whom is, or has been, or is qualified to be, a Judge of a High Court and not more than three shall be ulema having at least fifteen years experience in Islamic law, research or instruction.\n4. The Chief Justice and a Judge shall hold office for a period not exceeding three years, but may be appointed for such further term or terms as the President may determine:\nProvided that a Judge of a High Court shall not be appointed to be a Judge 132[**] except with his consent and except where the Judge is, himself the Chief Justice, after consultation by the President with the Chief Justice of the High Court.\n4A. The Chief Justice, if he is not a Judge of the Supreme Court, and a Judge who is not a Judge of a High Court, may, by writing under his hand addressed to the President, resign his office.\n4B. The Chief Justice and a Judge shall not be removed from office except in the like manner and on the like grounds as a Judge of the Supreme Court.\n4C. 134[***]\n5. 135[****]\n6. The Principal seat of the Court shall be at Islamabad, but Court may from time to time sit in such other places in Pakistan as the Chief Justice may, with the approval of the President, appoint.\n7. Before entering upon office, the Chief Justice and a Judge shall make before the President or a person nominated by him oath in the form set out in the Third Schedule.\n8. At any time when the Chief Justice or a Judge is absent or is unable to perform the functions of his office, the President shall appoint another person qualified for the purpose to act as Chief Justice or, as the case may be, Judge.\n9. A Chief Justice who is not a Judge of the Supreme Court shall be entitled to the same remuneration, allowances and privileges as are admissible to a Judge of the Supreme Court and a Judge who is not a Judge\nof a High Court shall be entitled to the same remuneration, allowances and privileges as are admissible to a Judge of a High Court:\nProvided that where a Judge is already drawing a pension for any other post in the service of Pakistan, the amount of such pension shall be deducted from the pension admissible under this clause.]",
    "214": "Article 203CC: This Article has been omitted\n[Omitted]",
    "215": "Article 203D: Powers, Jurisdiction and Functions of the Court\n1. The Court may, either of its own motion or on the petition of a citizen of Pakistan or the Federal Government or a Provincial Government, examine and decide the question whether or not any law or provision of law is repugnant to the injunctions of Islam, as laid down in the Holy Quran and Sunnah of the Holy Prophet (PBUH), hereinafter referred to as the Injunctions of Islam.\n1A. Where the Court takes up the examination of any law or provision of law under clause (1) and such law or provision of law appears to it to be repugnant to the Injunctions of Islam, the Court shall cause to be given to the Federal Government in the case of a law with respect to a matter in the Federal Legislative List , or to the Provincial Government in the case of a law with respect to a matter not enumerated in the Federal Legislative List , a notice specifying the particular provisions that appear to it to be so repugnant, and afford to such Government adequate opportunity to have its point of view placed before the Court.\n2. If the Court decides that any law or provision of law is repugnant to the Injunctions of Islam, it shall set out in its decision:-\na. the reasons for its holding that opinion; and\nb. the extent to which such law or provision is so repugnant; and specify the day on which the decision shall take effect:\nProvided that no such decision shall be deemed to take effect before the expiration of the period within which an appeal therefrom may be preferred to the Supreme Court or, where an appeal has been so preferred, before the disposal of such appeal.\n3. If any law or provision of law is held by the Court to be repugnant to the Injunctions of Islam,-\na. the President in the case of a law with respect to a matter in the Federal Legislative List or the Concurrent Legislative List, or the Governor in the case of a law with respect to a matter not enumerated in either of those Lists, shall take steps to amend the law so as to bring such law or provision into conformity with the Injunctions of Islam; and\nb. such law or provision shall, to the extent to which it is held to be so repugnant, cease to have effect on the day on which the decision of the Court takes effect.",
    "216": "Article 203DD: Revision and other Jurisdiction of the Court\n1. The Court may call for and examine the record of any case decided by any criminal court under any law relating to the enforcement of Hudood for the purpose of satisfying itself as to the correctness, legality or propriety of any finding, sentence or order recorded or passed by, and as to the regularity of any proceedings of, such court and may, when calling for such record, direct that the execution of any sentence be suspended and, if the accused is in confinement, that he be released on bail or on his own bond pending the examination of the record.\n2. In any case the record of which has been called for by the Court, the Court may pass such order as it may deem fit and may enhance the sentence:\nProvided that nothing in this Article shall be deemed to authorize the Court to convert a finding of acquittal into one of conviction and no order under this Article shall be made to the prejudice of the accused unless he has had an opportunity of being heard in his own defence.\n3. The Court shall have such other jurisdiction as may be conferred on it by or under any law.",
    "217": "Article 203E: Powers and Procedure of the Court\n1. For the purposes of the performance of its functions, the Court shall have the powers of a civil court trying\na suit under the Code of Civil Procedure, 1908 (Act V of 1908), in respect of the following matters, namely:-\na. summoning and enforcing the attendance of any person and examining him on oath;\nb. requiring the discovery and production of any document;\nc. receiving evidence on affidavits; and\nd. issuing commissions for the examination of witnesses or documents.\n2. The Court shall have power to conduct its proceedings and regulate its procedure in all respects as it deems fit.\n3. The Court shall have the power of a High Court to punish its own contempt.\n4. A party to any proceedings before the Court under clause (1) of Article 203D may be represented by a legal practitioner who is a Muslim and has been enrolled as an advocate of a High Court for a period of not less than five years or as an advocate of the Supreme Court or by a jurisconsult selected by the party from out of a panel of jurisconsults maintained by the Court for the purpose.\n5. For being eligible to have his name borne on the panel of jurisconsults referred to in clause (4), a person shall be an Aalim who, in the opinion of the Court, is well-versed in Shariat.\n6. A legal practitioner or jurisconsult representing a party before the Court shall not plead for the party but shall state, expound and interpret the Injunctions of Islam relevant to the proceedings so far as may be known to him and submit to the Court a written statement of his interpretation of such Injunctions\nof Islam.\n7. The Court may invite any person in Pakistan or abroad whom the Court considers to be well-versed in Islamic law to appear before it and render such assistance as may be required of him.\n8. No court fee shall be payable in respect of any petition or application made to the Court under Article 203D.\n9. The Court shall have power to review any decision given or order made by it.",
    "218": "Article 203F: Appeal to Supreme Court\n1. Any party to any proceedings before the Court under Article 203D aggrieved by the final decision of the Court in such proceedings may, within sixty days of such decision, prefer an appeal to the Supreme Court:\nProvided that an appeal on behalf of the Federation or of a Province may be preferred within six months of such decision.\n2. The provisions of clauses (2) and (3) of Article 203D and clauses (4) to (8) of Article 203E shall apply to and in relation to the Supreme Court as if reference in those provisions to Court were a reference to the Supreme Court.\n2A. An appeal shall lie to the Supreme Court from any judgment, final order or sentence of the Federal Shariat Court-\na. if the Federal Shariat Court has on appeal reversed an order of acquittal of an accused person and sentenced him to death or imprisonment for life or imprisonment for a term exceeding fourteen years; or, on revision, has enhanced a sentence as aforesaid; or\nb. if the Federal Shariat Court has imposed any punishment on any person for contempt of the Court.\n2B. An appeal to the Supreme Court from a judgment, decision, order or sentence of the Federal Shariat Court in a case to which the preceding clauses do not apply shall lie only if the Supreme Court grants leave to appeal.\n3. For the purpose of the exercise of the jurisdiction conferred by this Article, there shall be constituted in the Supreme Court a Bench to be called the Shariat Appellate Bench and consisting of,\na. three Muslim Judges of the Supreme Court; and\nb. not more than two Ulema to be appointed by the President to attend sittings of the Bench as ad-hoc members thereof from amongst the Judges of the Federal Shariat Court or from out of a panel of Ulema\nto he drawn up by the President in consultation with the Chief Justice.\n4. A person appointed under paragraph (b) of clause (3) shall hold office for such period as the President may determine.\n5. Reference in clauses (1) and (2) to Supreme Court shall be construed as a reference to the Shariat Appellate Bench.\n6. While attending sittings of the Shariat Appellate Bench, a person appointed under paragraph (b) of clause3 shall have the same power and jurisdiction, and be entitled to the same privileges, as a Judge of the Supreme Court and be paid such allowances as the President may determine.",
    "219": "Article 203G: Bar of Jurisdiction\nSave as provided in Article 203F, no court or tribunal, including the Supreme Court and a High Court, shall entertain any proceeding or exercise any power or jurisdiction in respect of any matter within the power or\njurisdiction of the Court.",
    "220": "Article 203GG: Decision of Court binding on High Court and Courts subordinate to it\nSubject to Article 203D and 203F, any decision of the Court in the exercise of its jurisdiction under this Chapter shall be binding on a High Court and on all courts subordinate to a High Court.",
    "221": "Article 203H: Pending proceedings to continue, etc\n1. Subject to clause (2) nothing in this Chapter shall be deemed to require any proceedings pending in any court or tribunal immediately before the commencement of this Chapter or initiated after such commencement, to be adjourned or stayed by reason only of a petition having been made to the Court for a decision as to whether or not a law or provision of law relevant to the decision of the point in issue in such proceedings is repugnant to the Injunctions of Islam; and all such proceedings shall continue, and the point in issue therein shall be decided, in accordance with the law for the time being in force.\n2. All proceedings under clause (1) of Article 203B of the Constitution that may be pending before any High Court immediately before the commencement of this Chapter shall stand transferred to the Court and shall be\ndealt with by the Court from the stage from which they are so transferred.\n3. Neither the Court nor the Supreme Court shall in the exercise of its jurisdiction under this Chapter have power to grant an injunction or make any interim order in relation to any proceedings pending in any other court or tribunal.",
    "222": "Article 203I: This Article has been omitted\n[Omitted]",
    "223": "Article 203J: Power to make Rules\n1. The Court may, by notification in the official Gazette, make rules for carrying out the purposes of this Chapter.\n2. In particular, and without prejudice to the generality of the foregoing power, such rules may make provision in respect of all or any of the following matters, namely: -\na. the scale of payment of honorarium to be made to jurisconsults, experts and witnesses summoned by the Court to defray the expenses, if any, incurred by them in attending for the purposes of the proceedings before the Court;\nb. the form of oath to be made by a jurisconsult, expert or witness appearing before the Court;\nc. the powers and functions of the Court being exercised or performed by Benches consisting of one or more members constituted by the Chairman;\nd. the decision of the Court being expressed in terms of the opinion of the majority of its members or, as the case may be, of the members constituting a Bench; and\ne. the decision of cases in which the members constituting a Bench are equally divided in their opinion.\n3. Until rules are made under clause (1), the Shariat Benches of Superior Courts Rules, 1979, shall, with the necessary modifications and so far as they are not inconsistent with the provisions of this Chapter, continue in force.",
    "224": "Article 204: Contempt of Court\n1. In this Article, \"Court\" means the Supreme Court or a High Court.\n2. A Court shall have power to punish any person who-\na. abuses, interferes with or obstructs the process of the Court in any way or disobeys any order of the Court;\nb. scandalizes the Court or otherwise does anything which tends to bring the Court or a Judge of the Court into hatred, ridicule or contempt;\nc. does anything which tends to prejudice the determination of a matter pending before the Court; or\nd. does any other thing which, by law, constitutes contempt of the Court.\n3. The exercise of the power conferred on a Court by this Article may be regulated by law and, subject to law, by rules made by the Court.",
    "225": "Article 205: Remuneration, etc., of Judges\nThe remuneration and other terms and conditions of service of a Judge of the Supreme Court or of a High Court shall be as provided in the Fifth Schedule.",
    "226": "Article 206: Resignation\n1. A Judge of the Supreme Court or a High Court may resign his office by writing under his hand addressed to the President.\n2. A Judge of a High Court who does not accept appointment as a Judge of the Supreme Court shall be deemed to have retired from his office and, on such retirement, shall be entitled to receive a pension calculated on the basis of the length of his service as Judge and total service, if any, in the service of Pakistan.",
    "227": "Article 207: Judge not to hold Office of Profit, etc\n1. A Judge of the Supreme Court or of a High Court shall not-\na. hold any other office of profit in the service of Pakistan if his remuneration is thereby increased; or\nb. occupy any other position carrying the right to remuneration for the rendering of services.\n2. A person who has held office as a Judge of the Supreme Court or of a High Court shall not hold any office of profit in the service of Pakistan, not being a judicial or quasi-judicial office or the office of Chief Election Commissioner or of Chairman or member of a law commission or of Chairman or member of the Council of Islamic Ideology, before the expiration of two years after he has ceased to hold that office.\n3. A person who has held office as a permanent Judge,\na. of the Supreme Court, shall not plead or act in any Court or before any authority in Pakistan;\nb. of a High Court, shall not plead or act in any Court or before any authority within its jurisdiction; and\nc. of the High Court of West Pakistan as it existed immediately before the coming into force of the Province of West Pakistan (Dissolution) Order, 1970, shall not plead or act in any Court or before any authority within the jurisdiction of the principal seat of that High Court or, as the case may be, the Permanent Bench of that High Court to which he was assigned.",
    "228": "Article 208: Officers and Servants of Courts\nThe Supreme Court and the Federal Shariat Court, with the approval of the President and a High Court, with the\napproval of the Governor concerned, may make rules providing for the appointment by the Court of officers and servants of the Court and for their terms and conditions of employment:\nProvided that in case of the High Court for Islamabad Capital Territory the rules may be made with the approval of the President.",
    "229": "Article 209: Supreme Judicial Council\n1. There shall be a Supreme Judicial Council of Pakistan, in this Chapter referred to as the Council.\n2. The Council shall consist of,\na. the Chief Justice of Pakistan;\nb. the two next most senior Judges of the Supreme Court; and\nc. the two most senior Chief Justices of High Courts.\nExplanation:- For the purpose of this clause, the inter se seniority of the Chief Justices of the High Courts shall be determined with reference to their dates of appointment as Chief Justice otherwise than as acting Chief Justice, and in case the dates of such appointment are the same, with reference to their dates of appointment as Judges of any of the High Courts.\n3. If at any time the Council is inquiring into the capacity or conduct of a Judge who is a member of the Council, or a member of the Council is absent or is unable to act due to illness or any other cause, then\na. if such member is a Judge of the Supreme Court, the Judge of the Supreme Court who is next in seniority below the Judges referred to in paragraph (b) of clause (2), and\nb. if such member is the Chief Justice of a High Court; the Chief Justice of another High Court who is next in seniority amongst the Chief Justices of the remaining High Courts, shall act as a member of the Council in his place.\n4. If, upon any matter inquired into by the Council, there is a difference of opinion amongst its members, the opinion of the majority shall prevail, and the report of the Council to the President shall be expressed in terms of the view of the majority.\n5. If, on information from any source, the Council or the President is of the opinion that a Judge of the Supreme Court or of a High Court-\na. may be incapable of properly perfor ming the duties of his office by reason of physical or mental incapacity; or\nb. may have been guilty of misconduct, the President shall direct the Council to, or the Council may, on its own motion, inquire into the matter.\n6. If, after inquiring into the matter, the Council reports to the President that it is of the opinion-\na. that the Judge is incapable of performing the duties of his office or has been guilty of misconduct, and\nb. that he should be removed from office, the President may remove the Judge from office.\n7. A Judge of the Supreme Court or of a High Court shall not be removed from office except as provided by this Article.\n8. The Council shall issue a code of conduct to be observed by Judges of the Supreme Court and of the High Courts.",
    "230": "Article 210: Power of Council to enforce attendance of persons, etc\n1. For the purpose of inquiring into any matter, the Council shall have the same power as the Supreme Court has to issue directions or orders for securing the attendance of any person or the discovery or production of any document; and any such direction or order shall be enforceable as if it had been issued by the Supreme Court.\n2. The provisions of Article 204 shall apply to the Council as they apply to the Supreme Court and a High Court.",
    "231": "Article 211: Bar of Jurisdiction\nThe proceedings before the Council, its report to the President and the removal of a Judge under clause (6) of Article 209 shall not be called in question in any court.",
    "232": "Article 212: Administrative Courts and Tribunals\n1. Notwithstanding anything hereinbefore contained, the appropriate Legislature may by Act provide for the establishment of one or more Administrative Courts or Tribunals to exercise exclusive jurisdiction in respect of\na. matters relating to the terms and conditions of persons who are or have been in the service of Pakistan, including disciplinary matters;\nb matters relating to claims arising from tortious acts of Government, or any person in the service of Pakistan, or of any local or other authority empowered by law to levy any tax or cess and any servant of such authority acting in the discharge of his duties as such servant; or\nc. matters relating to the acquisition, administration and disposal of any property which is deemed to be enemy property under any law.\n2. Notwithstanding anything hereinbefore contained, where any Administrative Court or Tribunal is established under clause (1), no other court shall grant an injunction, make any order or entertain any proceedings in respect of any matter to which the jurisdiction of such Administrative Court or Tribunal extends and all proceedings in respect of any such matter which may be pending before such other court immediately before the establishment of the Administrative Court or Tribunal other than an appeal pending before the Supreme Court, shall abate on such establishment:\nProvided that the provisions of this clause shall not apply to an Administrative Court or Tribunal established under an Act of a Provincial Assembly unless, at the request of that Assembly made in the form of a resolution, Majlis-e- Shoora (Parliament) by law extends the provisions to such a Court or Tribunal.\n3. An appeal to the Supreme Court from a judgment, decree, order or sentence of an Administrative Court or Tribunal shall lie only if the Supreme Court, being satisfied that the case involves a substantial question of law of public importance, grants leave to appeal.",
    "233": "Article 212A: This Article has been omitted\n[ Omitted]",
    "234": "Article 212B: This Article has been omitted\n[ Omitted]",
    "235": "Article 213: Chief Election Commissioner\n1. There shall be a Chief Election Commissioner (in this Part referred to as the Commissioner), who shall be\nappointed by the President 140[***].\n2. No person shall be appointed to be Commissioner unless he is, or has been, a Judge of the Supreme Court or is, or has been, a Judge of a High Court and is qualified under paragraph (a) of clause (2) of Article 177 to be appointed a Judge of the Supreme Court.\n2A. The Prime Minister shall in consultation with the Leader of the Opposition in the National Assembly, forward three names for appointment of the Commissioner to a Parliamentary Committee for hearing and confirmation of any one person.\n2B. The Parliamentary Committee to be constituted by the Speaker shall comprise fifty percent members from the Treasury Benches and fifty percent from the Opposition Parties, based on their strength in Majlis-e-Shoora (Parliament), to be nominated by the respective Parliamentary Leaders: Provided that in case there is no consensus between the Prime Minister and the Leader of the Opposition, each shall forward separate lists to the Parliamentary Committee for consideration which may confirm any one name:\nProvided further that the total strength of the Parliamentarym Committee shall be twelve members out of which one-third shall be from the Senate, and\nProvided also that when the National Assembly is dissolved and vacancy occurs in the office of the Chief Election Commissioner, the 143[total membership of the Parliamentary committee shall consist of] the members from the Senate only and the foregoing provisions of this clause shall, mutatis mutandis, apply.\n3. The Commissioner shall have such powers and functions as are conferred on him by the Constitution and law.",
    "236": "Article 214: Commissioner's oath of office\nBefore entering upon office, the Commissioner shall make before the Chief Justice of Pakistan oath in the form\nset-out in the Third Schedule.",
    "237": "Article 215: Term of office of Commissioner\n1. The Commissioner shall, subject to this Article, hold office for a term of five years from the day he enters upon his office:\nProvided that the aforesaid amendment shall be effective after the expiry of current tenure of the present incumbent.\n2. The Commissioner shall not be removed from office except in the manner prescribed in Article 209 for the removal from office of a Judge and, in theapplication of the Article for the purposes of this clause, any reference in that Article to a Judge shall be construed as a reference to the Commissioner.\n3. The Commissioner may, by writing under his hand addressed to the, President, resign his office.",
    "238": "Article 216: Commissioner not to hold office of profit\n1. The Commissioner shall not;\na. hold any other office of profit in the service of Pakistan; or\nb. occupy any other position carrying the right to remuneration for the rendering of services.\n2. A person who has held office as Commissioner shall not hold any office of profit in the service of Pakistan before the expiration of two years after he has ceased to hold that office:\nProvided that-\na. this clause shall not be construed as preventing a person who was a Judge of the Supreme Court or of a High Court immediately before his appointment as Commissioner from resuming his duties as such Judge on the expiration of his term as Commissioner.\nb. 147 [***]",
    "239": "Article 217: Acting Commissioner\nAt any time when,\na. the office of Commissioner is vacant, or\nb. the Commissioner is absent or unable to perform the functions of his office due to any other cause,\na Judge of the Supreme Court nominated by the Chief Justice of Pakistan shall Act as Commissioner.",
    "240": "Article 218: Election Commission\n1. For the purpose of election to both Houses of Majlis-e-Shoora (Parliament), Provincial Assemblies and for election to such other public offices as may be specified by law, a permanent Election Commission shall be constituted in accordance with this Article;\n2. The Election Commission shall consist of,-\na. the Commissioner who shall be the Chairman of the Commission; and\nb. four members, each of whom has been a Judge of a High Court from each Province, appointed by the President in the manner provided for appointment of the Commissioner in clauses (2A) and (2B) of Article 213.\n3. It shall be the duty of the Election Commission constituted in relation to an election to organize and conduct the election and to make such arrangements as are necessary to ensure that the election is conducted honestly, justly, fairly and in accordance with law, and that corrupt practices are guarded against.",
    "241": "Article 219: Duties of Commission\nThe Commission shall be charged with the duty of,\na. preparing electoral rolls for election to the National Assembly and the Provincial Assemblies, and revising such rolls annually;\nb. organizing and conducting election to the Senate or to fill casual vacancies in a House or a Provincial Assembly; and\nc. appointing Election Tribunals;\nd. the holding of general elections to the National Assembly, Provincial Assemblies and the local governments; and\ne. such other functions as may be specified by an Act of Majlis-e-Shoora (Parliament).",
    "242": "Article 220: Executive authorities to assist Commission, etc\nIt shall be the duty of all executive authorities in the Federation and in the Provinces to assist the Commissioner and the Election Commission in the discharge of his or their functions.",
    "243": "Article 221: Officers and servants\nUntil Majlis-e-Shoora (Parliament) by law otherwise provides, the Election Commission may, with the approval of the President, make rules providing for the appointment by the Election Commission of officers and servants to be employed in connection with the functions of the Election Commission and for their terms and conditions of employment.",
    "244": "Article 222: Electoral laws\nSubject to the Constitution, Majlis-e-Shoora (Parliament) may by law provide for:\na. the allocation of seats in the National Assembly as required by clauses (3) and (4) of Article 51;\nb. the delimitation of constituencies by the Election Commission;\nc. the preparation of electoral rolls, the requirements as to residence in a constituency, the determination of objections pertaining to and the commencement of electoral rolls;\nd. the conduct of elections and election petitions the decision of doubts and disputes arising in connection with elections;\ne. matters relating to corrupt practices and other offences in connection with elections; and\nf. all other matters necessary for the due constitution of the two Houses and the Provincial Assemblies; but no such law shall have the effect of taking away or abridging any of the powers of the Commissioner or an Election Commission under this Part.",
    "245": "Article 223: Bar against double membership\n1. No person shall, at the same time, be a member of-\na. both Houses; or\nb. a House and a Provincial Assembly; or\nc. the Assemblies of two or more Provinces; or\nd. a House or a Provincial Assembly in respect of more than one seat.\n2. Nothing in clause (1) shall prevent a person from being a candidate for two or more seats at the same time, whether in the same body or in different bodies, but if he is elected to more than one seat he shall, within a period of thirty days after the declaration of the result for the last such seat, resign all but one of his seats, and if he does not so resign, all the seats to which he has been elected shall become vacant at the expiration of the said period of thirty days except the seat to which he has been elected last or, if he has been elected to more than one seat on the same day, the seat for election to which his nomination was filed last.\nExplanation:- In this clause, \"body\" means either House or a Provincial Assembly.\n3. A person to whom clause (2) applies shall not take a seat in either House or the Provincial Assembly to which he has been elected until he has resigned all but one of his seats.\n4. Subject to clause (2), if a member of either House or of a Provincial Assembly becomes a candidate for a second seat which, in accordance with clause (1), he may not hold concurrently with his first seat, then his first seat shall become vacant as soon as he is elected to the second seat.",
    "246": "Article 224: Time of election and by-election\n1. A general election to the National Assembly or a Provincial Assembly shall be held within a period of\nsixty days immediately following the day on which the term of the Assembly is due to expire, unless the Assembly has been sooner dissolved, and the results of the election shall be declared not later than fourteen days before that day.\n1A. On dissolution of the Assembly on completion of its term, or in case it is dissolved under Article 58 or Article 112, the President, or the Governor, as the case may be, shall appoint a care-taker Cabinet:\nProvided that the care-taker Prime Minister shall be selected by the President in consultation with the Prime Minister and the Leader of the Opposition in the outgoing National Assembly, and a care-taker Chief Minister shall be appointed by the Governor in consultation with the Chief Minister and the Leader of the Opposition in the outgoing Provincial Assembly:\nProvided further that the Members of the Federal and Provincial caretaker Cabinets shall be appointed on the advice of the care-taker Prime Minister or the care-taker Chief Minister, as the case may be.\n1B. Members of the care-taker Cabinets including the care-take Prime Minister and the care-taker Chief Minister and their immediate family members shall not be eligible to contest the immediately following elections to such Assemblies.\nExplanation.- In this clause “immediate family members” means spouse and children; and\n2. When the National Assembly or a Provincial Assembly is dissolved, a general election to the Assembly shall be held within a period of ninety days after the dissolution, and the results of the election shall be declared not later than fourteen days after the conclusion of the polls.\n3. An election to fill the seats in the Senate which are to become vacant on the expiration of the term of the members of the Senate shall be held not earlier than thirty days immediately preceding the day on which the vacancies are due to occur.\n4. When, except by dissolution of the National Assembly or a Provincial Assembly, a general seat in any such Assembly has become vacant not later than one hundred and twenty days before the term of that Assembly is due to expire, an election to fill the seat shall be held within sixty days from the occurrence of the\nvacancy.\n5. When a seat in the Senate has become vacant, an election to fill the seat shall be held within thirty days from the occurrence of the vacancy.\n6. When a seat reserved for women or non-Muslims in the National Assembly or a Provincial Assembly falls vacant, on account of death,  resignation or disqualification of a member, it shall be filled by the next person in order of precedence from the party list of the candidates to be submitted to the Election Commission by the political party whose member has vacatedsuch seat.",
    "247": "Article 225: Election dispute\nNo election to a House or a Provincial Assembly shall be called in question except by an election petition presented to such tribunal and in such manner as may be determined by Act of Majlis-e-Shoora (Parliament).",
    "248": "Article 226: Election by secret ballot\nAll elections under the Constitution, other than those of the Prime Minister and the Chief Minister, shall be by secret ballot.",
    "249": "Article 227: Provisions relating to the Holy Qur'an and Sunnah\n1. All existing laws shall be brought in conformity with the Injunctions of Islam as laid down in the Holy Quran and Sunnah, in this Part referred to as the Injunctions of Islam, and no law shall be enacted which is repugnant to such Injunctions.\nExplanation:- In the application of this clause to the personal law of any Muslim sect, the expression \"Quran and Sunnah\" shall mean the Quran and Sunnah as interpreted by that sect.\n2. Effect shall be given to the provisions of clause (1) only in the manner provided in this Part.\n3. Nothing in this Part shall affect the personal laws of non-Muslim citizens or their status as citizens.",
    "250": "Article 228: Composition, etc. of Islamic Council\n1. There shall be constituted within a period of ninety days from the commencing day a Council of Islamic\nIdeology, in this part referred to as the Islamic Council.\n2. The Islamic Council shall consist of such members, being not less than eight and not more than twenty, as the President may appoint from amongst persons having knowledge of the principles and philosophy of Islam as enunciated in the Holy Quran and Sunnah, or understanding of the economic, political, legal or administrative problems of Pakistan.\n3. While appointing members of the Islamic Council the President shall ensure that-\na. so far as practicable various schools of thought are represented in the Council;\nb. not less than two of the members are persons each of whom is, or has been a Judge of the Supreme Court or of a High Court;\nc. not less than one-third  of the members are persons each of whom has been engaged, for a period of not less than fifteen years, in Islamic research or instruction; and\nd. at least one member is a woman.\n4.The President shall appoint one of the members of the Islamic Council to be the Chairman thereof.\n5. Subject to clause (6) a member of the Islamic Council shall hold office for a period of three years.\n6. A member may, by writing under his hand addressed to the President, resign his office or may be removed by the President upon the passing of a resolution for his removal by a majority of the total membership of the Islamic Council.",
    "251": "Article 229: Reference by Majlis-e-Shoora (Parliament), etc. to Islamic Council\nThe President or the Governor of a Province may, or if two-fifths of its total membership so requires, a House or a Provincial Assembly shall, refer to the Islamic Council for advice any question as to whether a proposed law is or is not repugnant to the Injunctions of Islam.",
    "252": "Article 230: Functions of Islamic Council\n1. The functions of the Islamic Council shall be-\na. to make recommendations to Majlis-e-Shoora (Parliament) and the Provincial Assemblies as to the ways and means of enabling and encouraging the Muslims of Pakistan to order their lives individually and collectively in all respects in accordance with the principles and concepts of Islam as enunciated in the Holy Quran and Sunnah;\nb. to advise a House, a Provincial Assembly, the President or a Governor on any question referred to the Council as to whether a proposed law is or is not repugnant to the Injunctions of Islam;\nc. to make recommendations as to the measures for bringing existing laws into conformity with the Injunctions of Islam and the stages by which such measures should be brought into effect; and\nd. to compile in a suitable form, for the guidance of Majlis-e-Shoora (Parliament) and the Provincial Assemblies, such Injunctions of Islam as can be given legislative effect.\n2. When, under Article 229, a question is referred by a House, a Provincial Assembly, the President or a Governor to the Islamic Council, the Council shall, within fifteen days thereof, inform the House, the Assembly, the President or the Governor, as the case may be, of the period within which the Council expects to be able to furnish that advice.\n3. Where a House, a Provincial Assembly, the President or the Governor, as the case may be, considers that, in the public interest, the making of the proposed law in relation to which the question arose should not be postponed until the advice of the Islamic Council is furnished, the law may be made before\nthe advice is furnished:\nProvided that, where a law is referred for advice to the Islamic Council and the Council advises that the law is repugnant to the Injunctions of Islam, the House or, as the case may be, the Provincial Assembly, the President or the Governor shall reconsider the law so made.\n4. The Islamic Council shall submit its final report within seven years of its appointment, and shall submit an annual interim report. The report, whether interim or final, shall be laid for discussion before both Houses and each Provincial Assembly within six months of its receipt, and Majlis-e-Shoora (Parliament) and the Assembly, after considering the report, shall enact laws in respect thereof within a period of two years of the final report.",
    "253": "Article 231: Rules of procedure\nThe proceedings of the Islamic Council shall be regulated by rules of procedure to be made by the Council with approval of the President.",
    "254": "Article 232: Proclamation of emergency on account of war, internal disturbance, etc\n1. If the President is satisfied that a grave emergency exists in which the security of Pakistan, or any part thereof, is threatened by war or external aggression, or by internal disturbance beyond the power of a Provincial Government to control, he may issue a Proclamation of Emergency:\nProvided that for imposition of emergency due to internal disturbances beyond the powers of a Provincial Government to control, a resolution from the Provincial Assembly of that Province shall be required:\nProvided further that if the President acts on his own, the Proclamation of Emergency shall be placed before both Houses of Majlis-e-Shoora (Parliament) for approval by each House within ten days.\n2. Notwithstanding anything in the Constitution, while a Proclamation of Emergency is in force-\na. Majlis-e-Shoora (Parliament) shall have power to make laws for a Province, or any part thereof, with respect to any matter not enumerated in the Federal Legislative List or the Concurrent Legislative List;\nb. the executive authority of the Federation shall extend to the giving of directions to a Province as to the mr in which the executive authority of the Province is to be exercised, and\nc. the Federal Government may by Order assume to itself, or direct the Governor of a Province to assume on behalf of the Federal Government, all or any of the functions of the Government of the Province, and all or any of the powers vested in, or exercisable by, any body or authority in the Province other than the Provincial Assembly, and make such incidental and consequential provisions as appear to the Federal Government to be necessary or desirable for giving effect to the objects of the Proclamation, including provisions for suspending, in whole or in part, the operation of any provisions of the Constitution relating to any body or authority in the province:\nProvided that nothing in paragraph (c) shall authorize the Federal Government to assume to itself, or direct the Governor of the Province to assume on its behalf, any of the powers vested in or exercisable by a High Court, or to suspend either in whole or in part the operation of any provisions of the Constitution relating to High Courts.\n(3) The power of Majlis-e-Shoora (Parliament) to make laws for a Province with respect to any matter shall include power to make laws conferring powers and imposing duties, or authorizing the conferring of powers and the imposition of duties upon the Federation, or officers and authorities of the Federation, as respects that matter.\n4. Nothing in this Article shall restrict the power of a Provincial Assembly to make any law which under the Constitution it has power to make but if any provision of a Provincial law is repugnant to any provision of an Act of Majlise- Shoora (Parliament) which Majlis-e-Shoora (Parliament) has under this Article power to make, the Act of Majlis-e-Shoora (Parliament), whether passed before or after the Provincial law, shall prevail and the Provincial law shall, to the extent of the repugnancy, but so long only as the Act of Majlis-e-Shoora (Parliament) continues to have effect, be void.\n5. A law made by Majlis-e-Shoora (Parliament), which Majlis-e-Shoora (Parliament) would not but for the issue of a Proclamation of Emergency have been competent to make, shall, to the extent of the incompetency, cease to have effect on the expiration of a period of six months after the Proclamation of Emergency has ceased to be in force, except as respects things done or omitted to be done before the expiration of the said period.\n6. While a Proclamation of Emergencyis in force, Majlis-e-Shoora (Parliament) may by law extend the term of the National Assembly for a period not exceeding one year and not extending in any case beyond a perio d of six months after the Proclamation has ceased to be in force.\n7. A Proclamation of Emergency shall be laid before a joint sitting which shall be summoned by the President to meet within thirty days of the Proclamation being issued and-\na. shall cease to be in force at the expiration of two months unless before the expiration of that period it has been approved by a resolution of the joint sitting; and(b) shall, subject to the provisions of paragraph (a), cease to be in force upon a resolution disapproving the Proclamation being passed by the votes of the majority of the total memberships of the two Houses in joint sitting.\n(8) Notwithstanding anything contained in clause (7), if the National Assembly stands dissolved at the time when a Proclamation of Emergency is issued, the Proclamation shall continue in force for a period of four months but, if a general election to the Assembly is not held before the expiration of that period; it shall cease to be in force at the expiration of that period unless it has earlier been approved by a resolution of the Senate.",
    "255": "Article 233: Power to suspend Fundamental Rights, etc., during emergency period\n1. Nothing contained in Articles 15, 16, 17, 18, 19, and 24 shall, while a proclamation of Emergency is in force, restrict the power of the State as defined in Article 7 to make any law or to take any executive action which it would, but for the provisions in the said Articles, be competent to make or to take, but any law so made shall, to the extent of the incompetency, cease to have effect, and shall be deemed to have been repealed, at the time when the Proclamation is revoked or has ceased to be in force.\n2. While a Proclamation of Emergency is in force, the President may, by Order, declare that the right to move any Court for the enforcement of such of the Fundamental Rights conferred by Chapter 1 of Part II as may be specified in the Order, and any proceeding in any Court which is for the enforcement, or involves the determination of any question as to the infringement, of any of the Rights so specified, shall remain suspended for the period during which the Proclamation is in force, and any such Order may be made in respect of the whole or any part of Pakistan.\n3. Every Order made under this Article shall, as soon as may be, be laid before both Houses of Majlis e-Shoora (Parliament) separately for approval and the provisions of clauses (7) and (8) of Article 232 shall apply to such an Order as they apply to a Proclamation of Emergency.",
    "256": "Article 234: Power to issue Proclamation in case of failure of constitutional machinery in a Province\n1. If the President, on receipt of a report from the Governor of a Province is satisfied that a situation has arisen in which the Government of the Province cannot be carried on in accordance with the\nprovisions of the Constitution, the President may, or if a resolution in this behalf is passed by each House separately shall, by Proclamation,\na. assume to himself, or direct the Governor of the Province to assume on behalf of the President, all or any of the functions of the Government of the Province, and all or any of the powers vested in, or exercisable by, any body or authority in the Province, other than the Provincial Assembly;\nb. declare that the powers of the Provincial Assembly shall be exercisable by, or under the authority of, Majlis-e-Shoora (Parliament); and\nc. make such incidental and consequential provisions as appear to the President to be necessary or desirable for giving effect to the objects of the Proclamation, including provisions for suspending in whole or in part the operation of any provisions of the Constitution relating to any body or authority in the Province:\nProvided that nothing in this Article shall authorize the President to assume to himself, or direct the Governor of the Province to assume on his behalf, any of the powers vested in, or exercisable by, a High Court, or to suspend either in whole or in part the operation of any provisions of the Constitution relating to High Courts.\n2. The Provisions of Article 105 shall not apply to the discharge by the Governor of his functions under clause (1).\n3. A Proclamation issued under this Article shall be laid before a joint sitting and shall cease to be in force at the expiration of two months, unless before the expiration of that period it has been approved by resolution of the joint sitting and may by like resolution be extended for a further period not exceeding two months at a time; but no such Proclamation shall in any case remain in force for more than six months.\n4. Notwithstanding anything contained in clause (3), if the National Assembly stands dissolved at the time when a Proclamation is issued under this Article, the Proclamation shall continue in force for a period of three months but, if a general election to the Assembly is not held before the expiration or that period, it shall cease to be in force at the expiration of that period unless it has earlier been approved by a resolution of the Senate.\n5. Where by a Proclamation issued under this Article it has been declared that the powers of the Provincial Assembly shall be exercisable by or under the authority of Majlis-e-Shoora (Parliament), it shall be competent-\na. to Majlis-e-Shoora (Parliament)] in joint sitting to confer on the President the power to make laws with respect to any matter within the legislative competence of the Provincial Assembly;\nb. to Majlis-e-Shoora (Parliament) in joint sitting, or the President, when he is empowered under paragraph (a), to make laws conferring powers and imposing duties, or authorizing the conferring of powers and the imposition of duties, upon the Federation, or officers and authorities thereof;\nc. to the President, when Majlis-e-Shoora (Parliament) is not in session, to authorize expenditure from the Provincial Consolidated Fund, whether the expenditure is charged by the Constitution upon that fund or not, pending the sanction of such expenditure by Majlise- Shoora (Parliament) in joint sitting; and\nd. to Majlis-e-Shoora (Parliament) in joint sitting by resolution to sanction expenditure authorized by the President under paragraph (c).\n6. Any law made by Majlis-e-Shoora (Parliament) or the President which Majlis-e-Shoora (Parlia ment) or the President would not, but for the issue of a Proclamation under this Article, have been competent to make, shall, to the extent of the incompetency, cease to have affect on the expiration of a period of six months after the Proclamation under this Article has ceased to be in force, except as to things, done or omitted to be done before the expiration of the said period.",
    "257": "Article 235: Proclamation in case of financial emergency\n1. If the President is satisfied that a situation has arisen whereby the economic life, financial stability or\ncredit of Pakistan, or any part thereof, is threatened, he may, after consultation with the Governors of the Provinces or, as the case may be, the Governor of the Province concerned, by Proclamation make a declaration to that effect, and while such a Proclamation is in force, the executive authority of the Federation shall extend to the giving of directions to any Province to observe such principles of financial propriety as may be specified in the directions, and to the giving of such other directions as the President may deem necessary in the interest of the economic life, financial stability or credit of Pakistan or any part thereof.\n2. Notwithstanding anything in the Constitution, any such directions may include a provision requiring a reduction of the salary and allowances of all or any class of persons serving in connection with the affairs of a Province.\n3. While a Proclamation issued under this Article is in force the President may issue directions for the reduction of the salaries and allowances of all or any class of persons serving in connection with the affairs of the Federation.\n4. The provisions of clauses (3) and (4) of Article 234 shall apply to a Proclamation issued under this Article as they apply to a Proclamation issued under that Article.",
    "258": "Article 236: Revocation of Proclamation, etc\n1. A Proclamation issued under this part may be varied or revoked by a subsequent Proclamation.\n2. The validity of any Proclamation issued or Order made under this Part shall not be called in question in any court.",
    "259": "Article 237: Majlis-e-Shoora (Parliament) may make laws of indemnity, etc\nNothing in the Constitution shall prevent Majlis-e-Shoora (Parliament) from making any law indemnifying any person in the service of the Federal Government or a Provincial Government, or any other person, in respect of any act done in connection with the maintenance or restoration of order in any area in Pakistan.",
    "260": "Article 238: Amendment of Constitution\nSubject to this Part, the Constitution may be amended by Act of Majlis-e-Shoora (Parliament).",
    "261": "Article 239: Constitution, Amendment Bill\n1. A Bill to amend the Constitution may originate in either House and, when the Bill has been passed by the votes of not less than two-thirds of the total membership of the House, it shall be transmitted to the other House.\n2. If the Bill is passed without amendment by the votes of not less than two-thirds of the total membership of the House to which it is transmitted under clause (1), it shall, subject to the provisions of clause (4), be presented to the President for assent.\n3. If the Bill is passed with amendment by the votes of not less than two-thirds of the total membership of the House to which it is transmitted under clause (1), it shall be reconsidered by the House in which it had originated, and if the Bill as amended by the former House is passed by the latter by the votes of not less than two-thirds of its total membership it shall, subject to the provisions of clause (4), be presented to the President for assent.\n4. A Bill to amend the Constitution which would have the effect of altering the limits of a Province shall not be presented to the President for assent unless it has been passed by the Provincial Assembly of that Province by the votes of not less than two-thirds of its total membership.\n5. No amendment of the Constitution shall be called in question in any court on any ground whatsoever.\n6. For the removal of doubt, it is hereby declared that there is no limitation whatever on the power of the Majlis-e-Shoora (Parliament) to amend any of the provisions of the Constitution.",
    "262": "Article 240: Appointments to service of Pakistan and conditions of service\nSubject to the Constitution, the appointments to and the conditions of service of persons in the service of Pakistan shall be determined-\n(a) in the case of the services of the Federation, posts in connection with the affairs of the Federation and All-Pakistan Services, by or under Act of Majlis-e-Shoora (Parliament); and\n(b) in the case of the services of a Province and posts in connection with the affairs of a Province, by or under Act of the Provincial Assembly.\nExplanation.- In this Article, \"All-Pakistan Service\" means a service common to the Federation and the Provinces, which was in existence immediately before the commencing day or which may be\ncreated by Act of Majlis-e-Shoora (Parliament).",
    "263": "Article 241: Existing rules, etc., to continue\nUntil the appropriate Legislature makes a law under Article 240, all rules and orders in force immediately before the commencing day shall, so far as consistent with the provisions of the Constitution, continue in force and may be amended from time to time by the Federal Government or, as the case may be the Provincial Government.",
    "264": "Article 242: Public Service Commission\n 1. Majlis-e-Shoora (Parliament) in relation to the affairs of the Federation, and the Provincial Assembly of a Province in relation to the affairs of a Province may, by law provide for the establishment and\nconstitution of a Public Service Commission.\n1A. The Chairman of the Public Service Commission constituted in relation to the affairs of the Federation shall be appointed by the President on the advice of the Prime Minister.\n1B. The Chairman of the Public Service Commission constituted in relation to affairs of a Province shall be appointed by the Governor on advice of the Chief Minister.\n2. A Public Service Commission shall perform such functions as may be prescribed by law.",
    "265": "Article 243: Command of Armed Forces\n1. The Federal Government shall have control and command of the Armed Forces.\n2. Without prejudice to the generality of the foregoing provision, the Supreme Command of the Armed Forces shall vest in the President.\n3. The President shall subject to law, have power–\na. to raise and maintain the Military, Naval and Air Forces of Pakistan; and the Reserves of such Forces; and\nb. to grant Commissions in such Forces.\n4. The President shall, on advice of the Prime Minister, appoint-\na. the Chairman, Joint Chiefs of Staff Committee;\nb. the Chief of the Army Staff;\nc. the Chief of the Naval Staff; and\nd. the Chief of the Air Staff,\nand shall also determine their salaries and allowances.",
    "266": "Article 244: Oath of Armed Forces\nEvery member of the Armed Forces shall make oath in the form set out in the Third Schedule.",
    "267": "Article 245: Functions of Armed Forces\n1. The Armed Forces shall, under the directions of the Federal Government, defend Pakistan against external\naggression or threat of war, and, subject to law, act in aid of civil power when called upon to do so.\n2. The validity of any direction issued by the Federal Government under clause (1) shall not be called in question in any court.\n3. A High Court shall not exercise any jurisdiction under Article 199 in relation to any area in which the Armed Forces of Pakistan are, for the time being, acting in aid of civil power in pursuance of Article 245:\nProvided that this clause shall not be deemed to affect the jurisdiction of the High Court in respect of any proceeding pending immediately before the day on which the Armed Forces start acting in aid of civil power.\n4. Any proceeding in relation to an area referred to in clause (3) instituted on or after the day the Armed Forces start acting in aid of civil power and pending in any High Court shall remain suspended for the period during which the Armed Forces are so acting.",
    "268": "Article 246: Tribal Areas\nIn the Constitution,-\na. \"Tribal Areas\" means the areas in Pakistan which, immediately before the commencing day, were Tribal Areas, and includes-\ni  the Tribal Areas of 166[Balochistan] and the Khyber Pakhtunkhwa Province;\nii. the former States of Amb, Chitral, Dir and Swat;\niii&iv. 168[**********]\nb. \"Provincially Administered Tribal Areas\" means-\ni. The districts of Chitral, Dir and Swat (which includes Kalam), the Tribal Area in Kohistan district, Malakand Protected Area, the Tribal Area adjoining Mansehra district and the former State of Amb; and\nii. Zhob district, Loralai district (excluding Duki Tehsil), Dalbandis Tehsil of Chagai District and Marri and Bugti tribal territories of Sibi district; and\nc. Federally Administered Tribal Areas includes-\ni. Tribal Areas adjoining Peshawar district;\nii. Tribal Areas adjoining Kohat district;\niii. Tribal Areas adjoining Bannu district;\niiia Tribal Areas adjoining Lakki Marwat district; and\niv. Tribal Areas adjoining Dera Ismail Khan district;\niva. Tribal Areas adjoining Tank District\nv. Bajaur Agency;\nva. Orakzai Agency;\nvi. Mohmand Agency;\nvii. Khyber Agency;\nviii. Kurram Agency;\nix. North Waziristan Agency, and\nx. South Waziristan Agency.",
    "269": "Article 247: Administration of Tribal Areas\n1. Subject to the Constitution, the executive authority of the Federation shall extend to the Federally Administered Tribal Areas, and the executive authority of a Province shall extend to the Provincially Administered Tribal Areas therein.\n2. The President may, from time to time, give such directions to the Governor of a Province relating to the whole or any part of a Tribal Area within the Province as he may deem necessary, and the Governor shall, in the exercise of his functions under this Article, comply with such directions.\n3. No Act of Majlis-e-Shoora (Parliament) shall apply to any Federally Administered Tribal Area or to any part thereof, unless the President so directs, and no Act of Majlis-e-Shoora (Parliament) or a Provincial Assembly shall apply to a Provincially Administered Tribal Area, or to any part thereof, unless the Governor\nof the Province in which the Tribal Area is situate, with the approval of the President, so directs; and in giving such a direction with respect to any law, the President or, as the case may be, the Governor, may direct that the law shall, in its application to a Tribal Area, or to a specified part thereof, have effect subject to such exceptions and modifications as may be specified in the direction.\n4. Notwithstanding anything contained in the Constitution, the President may, with respect to any matter within the legislative competence of Majlis-e- Shoora (Parliament), and the Governor of a Province, with the prior approval of the President, may, with respect to any matter within the legislative competence of the Provincial Assembly make regulations for the peace and good government of a Provincially Administered Tribal Area or any part thereof, situated in the Province.\n5. Notwithstanding anything contained in the Constitution, the President may, with respect to any matter, make regulations for the peace and good Government of a Federally Administered Tribal Area or any part thereof.\n6. The President may, at any time, by Order, direct that the whole or any part of a Tribal Area shall cease to be Tribal Area, and such Order may contain such incidental and consequential provisions as appear to the President to be necessary and proper:\nProvided that before making any Order under this clause, the President shall ascertain, in such manner as he considers appropriate, the views of the people of the Tribal Area concerned, as represented in tribal jirga.\n7. Neither the Supreme Court nor a High Court shall exercise any jurisdiction under the Constitution in relation to a Tribal Area, unless Majlis-e- Shoora (Parliament) by law otherwise provides:\nProvided that nothing in this clause shall affect the jurisdiction which the Supreme Court or a High Court exercised in relation to a Tribal Area immediately before the commencing day.",
    "270": "Article 248: Protection to President, Governor, Minister, etc\n1. The President, a Governor, the Prime Minister, a Federal Minister, a Minister of State, the Chief\nMinister and a Provincial Minister shall not he answerable to any court for the exercise of powers and performance of functions of their respective offices or for any act done or purported to be done in the exercise of those powers and performance of those functions:\nProvided that nothing in this clause shall be construed as restricting the right of any person to bring appropriate proceedings against the Federation or a Province.\n2. No criminal proceedings whatsoever shall be instituted or continued against the President or a Governor in any court during his term of office.\n3. No process for the arrest or imprisonment of the President or a Governor shall issue from any court during his term of office.\n4. No civil proceedings in which relief is claimed against the President or a Governor shall be instituted during his term of office in respect of anything done or not done by him in his personal capacity whether before or after he enters upon his office unless, at least sixty days before the proceedings are instituted, notice in writing has been delivered to him, or sent to him in the manner prescribed by law, stating the nature of the proceedings, the cause of action, the name, description and place of residence of the party by whom the proceedings are to be instituted and the relief which the party claims.",
    "271": "Article 249: Legal proceedings\n1. Any legal proceedings which, but for the Constitution, could have been brought by or against the Federation in respect of a matter which, immediately before the commencing day, was the responsibility of the Federation and has, under the Constitution, become the responsibility of a Province, shall be brought by or against the Province concerned; and if any such legal proceedings were pending in any court immediately before the commencing day then, in those proceedings, for the Federation the Province concerned shall, as from that day, be deemed to have been substituted.\n2. Any legal proceedings which, but for the Constitution, could have been brought by or against a Province in respect of a matter which, immediately before the commencing day, was the responsibility of the Province and has under the Constitution become the responsibility of the Federation, shall be brought by or against the Federation; and if any such legal proceedings were pending in any court immediately before the commencing day then, in those proceedings, for the Province the Federation shall, as from that day, be deemed to have been substituted.",
    "272": "Article 250: Salaries, allowances, etc., of the President, etc\n1. Within two years from the commencing day, provision shall be made by law for determining the\nsalaries, allowances and privileges of the President, the Speaker and Deputy Speaker and a member of the National Assembly or a Provincial Assembly, the Chairman and Deputy Chairman and a member of the Senate, the Prime Minister, a Federal Minister, a Minister of State, a Chief Minister, a Provincial Minister and\nthe Chief Election Commissioner.\n2. Until other provision is made by law,-\na.  the salaries, allowances and privileges of the President, the Speaker or Deputy Speaker or a member of the National Assembly or a Provincial Assembly, a Federal Minister, a Minister of a State, a Chief Minister, a Provincial Minister and the Chief Election Commissioner shall be same as the salaries, allowances and privileges to which the President, the Speaker or Deputy Speaker or member of the National Assembly of Pakistan or a Provincial Assembly, a Federal Minister, a Minister of State, a Chief Minister, a Provincial Minister or, as the case may be, the Chief Election Commissioner was entitled immediately before the commencing day; and\nb. the salaries, allowances and privileges of the Chairman, the Deputy Chairman, the Prime Minister and a member of the Senate shall be such as the President may by Order determine.\n3. The salary, allowances and privileges of a person holding office as-\na. the President;\nb. the Chairman or Deputy Chairman;\nc. the Speaker or Deputy Speaker of the National Assembly or a Provincial Assembly;\nd. a Governor;\ne. the Chief Election Commissioner; or\nf. the Auditor-General; shall not be varied to his disadvantage during his term of office.\n4. At any time when the Chairman or Speaker is acting as President, he shall be entitled to the same salary, allowances and privileges as President but shall not exercise any of the functions of the office of Chairman or Speaker member of Majlis-e-Shoora (Parliament), or be entitled to salary, allowances or privileges as Chairman, Speaker or such a member.",
    "273": "Article 251: National language\n1.The National language of Pakistan is Urdu, and arrangements shall be made for its being used for official and other purposes within fifteen years from the commencing day.\n2. Subject to clause (1), the English language may be used for official purposes until arrangements are made for its replacement by Urdu.\n3. Without prejudice to the status of the National language, a Provincial Assembly may by law prescribe measures for the teaching, promotion and use ofa Provincial language in addition to the National language.",
    "274": "Article 252: Special provisions in relation to major ports and aerodromes\n1. Notwithstanding anything contained in the Constitution or in any law, the President may, by public notification, direct that, for a period not exceeding three months from a specified date, a specified law, whether a Federal law or a Provincial law, shall not apply to a specified major port or major aerodrome, or shall apply to a specified major port or major aerodrome subject to specified exceptions or modifications.\n2. The giving of a direction under this Article in relation to any law shall not affect the operation of the law prior to the date specified in the direction.",
    "275": "Article 253: Maximum limits as to property, etc\n1. Majlis-e-Shoora (Parliament) may by law-\na. prescribe the maximum limits as to property or any class thereof which may be owned, held, possessed or controlled by any person; and\nb. declare that any trade, business, industry or service specified in such law shall be carried on or owned, to the exclusion, complete or partial, of other persons, by the Federal Government or a Provincial Government, or by a corporation controlled by any such Government.\n2. Any law which permits a person to own beneficially or possess beneficially an area of land greater than that which, immediately before the commencing day, he could have lawfully owned beneficially or possessed\nbeneficially shall be invalid.",
    "276": "Article 254: Failure to comply with requirement as to time does not render an act invalid\nWhen any act or thing is required by the Constitution to be done within a particular period and it is not done within that period, the doing of the act or thing shall not be invalid or otherwise ineffective by reason only that it was not done within that period.",
    "277": "Article 255: Oath of office\n1. An oath required to be made by a person under the Constitution shall preferably be made in Urdu or a language that is understood by that person.\n2. Where, under the Constitution, an oath is required to be made before a specified person and, for any reason, it is impracticable for the oath to be made before that person, it may be made before such other person as may be nominated by that person.\n3. Where, under the Constitution, a person is required to make an oath before he enters upon an office, he shall be deemed to have entered upon the office on the day on which he makes the oath.",
    "278": "Article 256: Private armies forbidden\nNo private organization capable of functioning as a military organization shall be formed, and any such organization shall be illegal.",
    "279": "Article 257: Provision relating to the State of Jammu and Kashmir\nWhen the people of the State of Jammu and Kashmir decide to accede to Pakistan, the relationship between Pakistan and the State shall be determined in accordance with the wishes of the people of that State.",
    "280": "Article 258: Government of territories outside Provinces\nSubject to the Constitution, until Majlis-e-Shoora (Parliament) by law otherwise provides, the President may, by Order, make provisions for peace and good government of any part of Pakistan not forming part of a Province.",
    "281": "Article 259: Awards\n1. No citizen shall accept any title, honour or decoration from any foreign State except with the approval of the Federal Government.\n2. No title, honour or decoration shall be conferred by the Federal Government or any Provincial Government on any citizen, but the President may award decorations in recognition of gallantry, meritorious service in the Armed Forces, academic distinction or distinction in the field of sports or nursing, as provided by Federal law.\n3. All titles, honours and decorations awarded to citizens by any authority in Pakistan before the commencing day otherwise than in recognition of gallantry, meritorious service in the Armed Forces or academic distinction shall stand annulled.",
    "282": "Article 260: Definitions\n1. In the Constitution, unless the context otherwise requires, the following expressions have the meaning hereby respectively assigned to them, that is to say,-\n\"Act of Majlis-e-Shoora (Parliament)\" means an Act passed by Majlis-e- Shoora (Parliament) or the National Assembly and assented to, or deemed to have been assented to, by the President;\n\"Act of Provincial Assembly\" means an Act passed by the Provincial Assembly of a Province and assented to, or deemed to have been assented to, by the Governor;\n\"agricultural income\" means agricultural income as defined for the purpose of the law relating to income tax;\n\"Article\" means Article of the Constitution;\n\"borrows\" includes the raising of money by the grant of annuities, and\n\"loans\" shall be construed accordingly;\n\"Chairman\" means the Chairman of the Senate and, except in Article 49, includes a person acting as Chairman of the Senate;\n\"Chief Justices\", in relation to the Supreme Court or a High Court, includes the Judge for the time being acting as Chief Justice of the Court;\n\"citizen\" means a citizen of Pakistan as defined by law;\n\"clause\" means clause of the Article in which it occurs;\n\"corporation tax\" means any tax or income that is payable by companies and in respect of which the following conditions apply:-\na. the tax is not chargeable in respect of agricultural income;\nb. no deduction in respect of the tax paid by companies is, by any law which may apply to the tax, authorized to be made from dividends payable by the companies to individuals;\nc. no provision exists for taking the tax so paid into account in computing for the purposes of income tax the total income of individual receiving such dividends, or in computing the income tax payable by, or refundable to, such individuals;\n\"debt\" includes any liability in respect of any obligation to repay capital sums by way of annuities and any liability under any guarantee, and\n\"debt charges\" shall be construed accordingly;\n\"estate duty\" means a duty assessed on, or by reference to, the value of property passing upon death;\n\"existing laws\" has the same meaning as in clause (7) of Article 268;\n\"Federal laws\" means a law made by or under the authority of Majlis-e- Shoora (Parliament);\n\"financial year\" means a year commencing on the first day of July;\n\"goods\" includes all materials, commodities and articles;\n\"Governor\" means the Governor of a Province and includes any person for the time being acting as the Governor of a Province;\n\"guarantee\" includes any obligation undertaken before the commencing day to make payments in the event of the profits of an undertaking falling short\nof a specified amount;\n\"House\" means the Senate or the National Assembly;\n\"Joint sitting\" means a joint sitting of the two Houses;\n\"Judge\" in relation to the Supreme Court or a High Court, includes the Chief Justice of the Court and also includes-\na. in relation to the Supreme Court, a person who is acting as a Judge of the Court; and\nb. in relation to the High Court, a person who is an Additional Judge of the Court;\n\"members of the Armed Forces\" does not include persons who are not, for the time being, subject to any law relating of the members of the Armed Forces;\n\"net proceeds\" means, in relation to any tax or duty, the proceeds thereof, reduced by the cost of collection, as ascertained and certified by the Auditor-General;\n\"oath\" includes affirmation;\n\"Part\" means Part of the Constitution;\n\"pension\" means a pension, whether contributory or not, of any kind whatsoever payable to, or in respect of, any person and includes retired pay so payable, a gratuity so payable, and any sum or sums so payable by way of the return, with or without interest thereon or any addition thereto, of subscriptions to a provident fund;\n\"person\" includes any body politic or corporate;\n\"President\" means the President of Pakistan and includes a person for the time being acting as, or performing the functions of, the President of Pakistan and, as respects anything required to be done under the Constitution before the commencing day, the President under the Interim Constitution of the Islamic Republic of Pakistan;\n\"Property\" includes any right, title or interest in property, movable or immovable, and any means and instruments of production;\n\"Provincial law\" means a law made by or under the authority of the Provincial Assembly;\n\"remuneration\" includes salary and pension;\n\"Schedule\" means Schedule to the Constitution;\n\"security of Pakistan\" includes the safety, welfare, stability and integrity of Pakistan and of each part of Pakistan, but shall not include public safety as such;\n\"Service of Pakistan\" means any service, post or office in connection with the affairs of the Federation or of a Province, and includes an All-Pakistan Service, service in the Armed Forces and any other service declared to be a service of Pakistan by or under Act of Majlis-e-Shoora (Parliament) or of a Provincial Assembly, but does not include service as Speaker, Deputy Speaker, Chairman, Deputy Chairman, Prime Minister, Federal Minister, Minister of State, Chief Minister, Provincial Minister, Attorney-General, Advocate-General, Parliamentary Secretary or Chairman or member of a Law Commission, Chairman or member of the Council of Islamic Ideology, Special Assistant to the Prime Minister, Adviser to the Prime Minister, Special Assistant to Chief Minister, Adviser to a Chief Minister or member of a House or a Provincial Assembly;\n\"Speaker\" means the Speaker of the National Assembly or a Provincial Assembly, and includes any person acting as the Speaker of the Assembly;\n\"taxation\" includes the imposition of any tax or duty, whether general, local or special, and \"tax\" shall be construed accordingly;\n\"tax on income\" includes a tax in the nature of an excess profits tax or a business profits tax.\n2. In the Constitution \"Act of Majlis-e-Shoora (Parliament)\" or \"Federal law\" or \"Act of Provincial Assembly\" or \"Provincial law\" shall include an Ordinance promulgated by the President or, as the case may be, a Governor.\n3. In the Constitution and all enactments and other legal instruments, unless there is anything repugnant in the subject or context,-\na. \"Muslim\" means a p erson who believes in the unity and oneness of Almighty Allah, in the absolute and unqualified finality of the Prophethood of Muhammad (peace be upon him), the last of the prophets, and does not believe in, or recognize as a prophet or religious reformer, any person who claimed or claims to be a\nprophet, in any sense of the word or of any description whatsoever, after Muhammad (peace be upon him); and\nb. \"non-Muslim\" means a person who is not a Muslim and includes a person belonging to the Christian, Hindu, Sikh, Buddhist or Parsi community, a person of the Quadiani Group or the Lahori Group who\ncall themselves 'Ahmadis' or by any other name or a Bahai, and a person belonging to any of the Scheduled Castes.",
    "283": "Article 261: Person acting in office not to be regarded as successor to previous occupant or office, etc\nFor the purposes of the Constitution, a person who acts an office shall not be regarded as the successor to the person who held that office before him or as the predecessor to the person who holds that office after him.",
    "284": "Article 262: Gregorian calendar to be used\nFor the purpose of the Constitution, period of time shall be reckoned according to the Gregorian calendar.",
    "285": "Article 263: Gender and number\nIn the Constitution,-\na. words importing the masculine gender shall be taken to include females; and\nb. words in the singular shall include the plural, and words in the plural shall include the singular.",
    "286": "Article 264: Effect of repeal of laws\nWhere a law is repealed, or is deemed to have been repealed, by, under, or by virtue of the Constitution, the repeal shall not, except as otherwise provided in the constitution,-\na. revive anything not in force or existing at the time at which the repeal takes effect;\nb. affect the previous operation of the law or anything duly done or suffered under the law;\nc. affect any right, privilege, obligation or liability acquired, accrued or incurred under the law;\nd. affect any penalty, forfeiture or punishment incurred in respect of any offence committed against the law; or\ne. affect any investigation legal proceeding or remedy in respect of any such right, privilege, obligation, liability, penalty, forfeiture or punishment; and any such investigation, legal proceeding or remedy may be instituted, continued or enforced, and any such penalty, forfeiture or punishment may be imposed, as if the law had not been repealed.",
    "287": "Article 265: Title of Constitution and commencement\n1. This Constitution shall be known as the Constitution of the Islamic Republic of Pakistan.\n2. Subject to clauses (3) and (4), the Constitution shall come into force on the fourteenth day of August, one thousand nine hundred and seventy three or on such earlier day as the President may, by notification in the official Gazette, appoint, in the Constitution referred to as the \"commencing day.\"\n3. The Constitution shall, to the extent necessary-\na. for the constitution of the first Senate;\nb. for the first meeting of a House or a joint sitting to be held;\nc. for the election of the President and the Prime Minister to be held; and\nd. to enable any other thing to be done which, for the purposes of the Constitution, it is necessary to do before the commencing day, come into force upon the enactment of the Constitution, but the person elected as President or Prime Minister shall not enter upon his office before the commencing day.\n4. Where by the Constitution a power is conferred to make rules or to issue orders with respect to the enforcement of any provision thereof, or with respect to the establishment of any Court or office, or the appointment of any Judge or office thereunder, or with respect to the person by whom, or the time when, or the place where, or the manner in which, anything is to be done under any such provisions, then that power may be exercised at any time between the enactment of the Constitution and its commencement.",
    "288": "Article 266: Repeal\nThe Interim Constitution of the Islamic Republic of Pakistan, together with the Acts and President's Orders making omissions from, additions to, modifications of, or amendments in, that Constitution is hereby repealed.",
    "289": "Article 267: Power of President to remove difficulties\n1. At any time before the commencing day, or before the expiration of three months from the commencing\nday, the President may, for the purpose of removing any difficulties, or for bringing the provisions of the Constitution into effective operation, by Order, direct that the provisions of the Constitution shall, during such period as may be specified in the Order, have effect, subject to such adaptations, whether by way of modification, addition or omission, as he may deem to be necessary or expedient.\n2. An Order made under clause (1) shall be laid before both Houses without undue delay, and shall remain in force until a resolution disapproving it is passed by each House or, in case of disagreement between the two Houses, until such resolution is passed at a joint sitting.",
    "290": "Article 267A: Power to remove difficulties\n1. If any difficulty arises in giving effect to the provisions of the Constitution (Eighteenth Amendment) Act,\n2010, hereinafter in this Article referred to as the Act, or for bringing theprovisions of the Act into effective operation, the matter shall be laid before both Houses in a joint sitting which may by a resolution direct that the\nprovisions of the Act shall, during such period as may be specified in the resolution, have effect, subject to such adaptations, whether by way of modification, addition or omission, as may be deemed necessary or expedient:\nProvided that this power shall be available for a period of one year from the commencement of the Act.",
    "291": "Article 267B: Removal of doubt\nFor removal of doubt it is hereby declared that Article 152A omitted and Articles 179 and 195 substituted by the Constitution (Seventeenth Amendment) Act, 2003 (Act No. III of 2003), notwithstanding its repeal, shall be deemed always to have been so omitted and substituted.",
    "292": "Article 268: Continuance in force, and adaptation of certain laws\n1. Except as provided by this Article, all existing laws shall, subject to the Constitution, continue in force, so far as applicable and with the necessary adaptations, until altered, repealed or amended by the appropriate Legislature.\n2. 173[***]\n3. For the purpose of bringing the provisions of any existing law into accord with the provisions of the Constitution (other than Part II of the Constitution), the President may by Order, within a period of two years from the commencing day, make such adaptation, whether by way of modification, addition or omission, as he may deem to be necessary or expedient, and any such Order may be made so as to have effect from such day, not being a day earlier than the commencing day, as may be specified in the Order.\n4. The President may authorise the Governor of a Province to exercise, in relation to the Province, the powers conferred on the President by clause (3) in respect of laws relating to matters with respect to which the Provincial Assembly has power to make laws.\n5. The powers exercisable under clauses (3) and (4) shall be subject to the provisions of an Act of the appropriate Legislature.\n6. Any court, tribunal or authority required or empowered to enforce an existing law shall, notwithstanding that no adaptations have been made in such law by an Order made under clause (3) or clause (4), construe the law with all such adaptations as are necessary to bring it into accord with the provisions of the\nConstitution.\n7. In this Article, \"existing laws\" means all laws (including Ordinances, Orders-in-Council, Orders, rules, by-laws, regulations and Letters Patent constituting a High Court, and any notifications and other legal instruments having the force of law) in force in Pakistan or any part thereof, or having extraterritorial validity, immediately before the commencing day.\nExplanation,- In this Article, \"in force\", in relation to any law, means having effect as law whether or not the law has been brought into operation.",
    "293": "Article 269: Validation of laws, acts, etc\n1. All Proclamations, President's Orders, Martial Law Regulations, Martial Law Orders and all other laws made between the twentieth day of December, one thousand nine hundred and seventy-one and the twentieth day of April, one thousand nine hundred and seventy-two (both days inclusive), are hereby declared notwithstanding any judgment of any Court, to have been validly made by competent authority and shall not be called in question in any court on any ground whatsoever.\n2. All orders made, proceedings taken and acts done by any authority, or by any person, which were made, taken or done, or purported to have been made, taken or done, between the twentieth day of December, one thousand nine hundred and seventy-one, and the twentieth day of April, one thousand nine hundred and seventy-two (both days inclusive) in exercise of the powers derived from any President's Orders, Martial Law Regulations, Martial Law Orders, enactments, notifications, rules, orders or by-laws, or in execution of any orders made or sentences passed by any authority in the exercise or purported exercise of powers as aforesaid, shall, notwithstanding any judgment of any court, be deemed to be and always to have been validly made, taken or done and shall not be called in question in any court on any ground whatsoever.\n3. No suit or other legal proceedings shall lie in any court against any authority or any person for or on account of or in respect of any order made, proceedings taken or act done whether in the exercise or purported exercise of the powers referred to in clause (2) or in execution of or in compliance with orders\nmade or sentences passed in exercise or purported exercise of such powers.",
    "294": "Article 270: Temporary validation of certain laws, etc\n1. Majlis-e-Shoora (Parliament) may by law made in the manner prescribed for legislations for a matter in Part I of the Federal Legislative List validate all Proclamations, President's Orders, Martial Law Regulations, Martial Law Orders and other laws made between the twenty-fifth day of March, one thousand nine hundred and sixty-nine, and the nineteenth day of December, one thousand nine hundred and seventy-one (both days inclusive).\n2. Notwithstanding a judgment of any court, a law made by Majlis-e- Shoora (Parliament) under clause (1) shall not be questioned in any court on any ground, whatsoever.\n3. Notwithstanding the provisions of clause (1), and a judgment of any court to the contrary, for a period of two years from the commencing day, the validity of all such instruments as are referred to in clause (1) shall not be called in question before any court on any ground whatsoever.\n4. All orders, made, proceedings taken, and acts done by any authority, or any person, which were made, taken or done, or purported to have been made, taken or done, between the twenty-fifth day of March, one thousand nine hundred and sixty-nine and nineteenth day of December, one thousand nine hundred and seventy-one (both days inclusive), in exercise of powers derived from any President's Orders, Martial Law Regulations, Martial Law Orders, enactments, notifications, rules, orders or by-laws, or in execution of any order made or sentence passed by any authority in the exercise or purported exercise of power as aforesaid shall, notwithstanding any judgment of any court, be deemed to be and always to have been validly made, taken or done, so however that any such order, proceeding or act may be declared invalid by Majlis-e-Shoora (Parliament) at any time within a period of two years from the commencing day by resolution of both Houses, or in case of disagreement between the two Houses, by such resolution passed at a joint sitting and shall not be called in question before any court on any ground, whatsoever.",
    "295": "Article 270A: Affirmation of President's Orders, etc\n1. The Proclamation of the fifth day of July, 1977, all President's Orders, Ordinances, Martial Law Regulations, Martial Law Orders, including the Referendum Order, 1984 (P. O. No. 11 of 1984), the Revival of the Constitution of 1973 Order, 1985 (P. O. No. 14 of 1985), the Constitution (Second Amendment) Order 1985 (P. O. No. 24 of 1985), and all other laws, made between the fifth day of July, 1977, and the date on which this Article comes into force are hereby affirmed, adopted and declared, notwithstanding any judgment of any court, to have been validly made bycompetent authority and, notwithstanding anything contained in the Constitution, shall not be called in question in any court on any ground whatsoever:\nProvided that a President's Order, Martial Law Regulation or Martial Law Order made after the thirtieth day of September, 1985, shall be confined only to making such provisions as facilitate, or are incidental to, the revocation of the Proclamation of the fifth day of July, 1977.\n2. All orders made, proceedings taken and acts done by any authority or by any person, which were made, taken or done, or purported to have been made, taken or done, between the fifth day of July, 1977, and the date on which this Article comes into force, in exercise of the powers derived from any Proclamation, President's Orders, Ordinances, Martial Law Regulations, Martial Law Orders, enactments, notifications, rules, orders or by-laws, or in execution of or in compliance with any order made or sentence passed by any authority in the exercise or purported exercise of powers as aforesaid, shall, notwithstanding any judgment of any court, be deemed to be and always to have been validly made, taken or done and shall not be called in question in any court on any ground whatsoever.\n3. All President's Orders, Ordinances, Martial Law Regulations, Martial Law Orders, enactments, notifications, rules, orders or by-laws in force immediately before the date on which this Article comes into force shall continue in force until altered, repealed or amended by competent authority.\nExplanation, In this clause, competent authority means,-\na. in respect of President's Orders, Ordinances, Martial Law Regulations, Martial Law Orders and enactments, the Legislature; and\nb. in respect of notifications, rules, orders and by-laws, the authority in which the power to made, alter, repeal or amend the same vests under the law.\n4. No suit, prosecution or other legal proceedings shall lie in any court against any authority or any person, for or on account of or in respect of any order made, proceedings taken or act done whether in the exercise or purported exercise of the powers referred to in clause (2) or in execution of or in compliance with orders made or sentences passed in exercise or purported exercise of such powers.\n5. For the purposes of clauses (1), (2) and (4), all orders made, proceedings taken, acts done or purporting to be made, taken or done by any authority or person shall be deemed to have been made, taken or done in good faith and for the purpose intended to be served thereby.\n6. The laws referred to in clause (1) may be amended by the appropriate Legislature in the manner provided for amendment of such laws.",
    "296": "Article 270AA: Declaration and continuance of laws etc\n1. The Proclamation of Emergency of the fourteenth day of October, 1999, the Provisional Constitution Order No.1 of 1999, the Oath of Office (Judges) Order, 2000 (No.1 of 2000), Chief Executive's Order No. 12 of 2002, Chief Executive's Order No.19 of 2002, the amendments made in the Constitution through the\nLegal Framework Order, 2002 (Chief Executive's Order No. 24 of 2002), the Legal Framework (Amendment) Order, 2002 (Chief Executive's Order No. 29 of 2002) and the Legal Framework (Second Amendment) Order, 2002 (Chief Executive's Order No. 32 of 2002), notwithstanding any judgment of any court including the Supreme Court or a High Court, are hereby declared as having been made without lawful authority and of no legal effect.\n2. Except as provided in clause (1) and subject to the provisions of the Constitution (Eighteenth Amendment) Act, 2010, all laws including President's Orders, Acts, Ordinances, Chief Executive's Orders, regulations, enactments, notifications, rules, orders or bye-laws made between the twelfth day of October, one thousand nine hundred and ninety-nine and the thirty-first day of December, two thousand and three (both days inclusive) and still in force shall, continue to be in force until altered, repealed or amended by the competent authority.\nExplanation,- For the purposes of clause (2) and clause (6), \"competent authority\" means,-\na. in respect of Presidents' Orders, Ordinances, Chief Executive's Orders and all other laws, the appropriate Legislature; and\nb. in respect of notifications, rules, orders and bye-laws, the authority in which the power to make, alter, repeal or amend the same vests under the law.\n3. Notwithstanding anything contained in the Constitution or clause (1), or judgment of any court including the Supreme Court or a High Court,-\na. Judges of the Supreme Court, High Courts and Federal Shariat Court who were holding the office of a Judge or were appointed as such, and had taken oath under the Oath of Office (Judges) Order, 2000, (1 of 2000), shall be deemed to have continued to hold the office as a Judge or to have been appointed as such, as the case may be, under the Constitution, and such continuance or appointment, shall have effect accordingly.\nb. Judges of the Supreme Court, High Courts and Federal Shariat Court who not having been given or taken oath under the Oath of Office of (Judges) Order, 2000 (1 of 2000), and ceased to hold the office of a Judge shall, for the purposes of pensionary benefits only, be deemed to have continued to hold office under the Constitution till their date of superannuation.\n4. All orders made, proceedings taken, appointments made, including secondments and deputations, and acts done by any authority, or by any person which were made, taken or done, or purported to have been made, taken or done, between the twelfth day of October, one thousand nine hundred and ninety-nine and the thirty first day of December, two thousand and three (both days inclusive), in exercise of the powers derived from any authority or laws mentioned in clause (2), or in execution of or in compliance with any orders made or sentences passed by any authority in the exercise or purported exercise of powers as aforesaid, shall, notwithstanding anything contained in clause (1), be deemed to be valid and shall not be called in question in any court or forum on any ground whatsoever.\n5. No suit, prosecution or other legal proceedings, including writ petitions, shall lie in any court or forum against any authority or any person, for or on account of or in respect of any order made, proceedings taken or act done whether in the exercise or purported exercise of the powers referred to in clause (2) or clause (4) or in execution of or in compliance with orders made or sentences passed in exercise or purport ed exercise of such powers.\n6. Notwithstanding omission of the Concurrent Legislative List by the Constitution (Eighteenth Amendment) Act, 2010, all laws with respect to any of the matters enumerated in the said List (including Ordinances, Orders, rules, bye-laws, regulations and notifications and other legal instruments having the force of law) in force in Pakistan or any part thereof, or having extra-territorial operation, immediately before the commencement of the Constitution (Eighteenth Amendment) Act, 2010, shall continue to remain in force until altered, repealed or amended by the competent authority.\n7. Notwithstanding anything contained in the Constitution, all taxes and fees levied under any law in force immediately before the commencement of the Constitution (Eighteenth Amendment) Act, 2010, shall continue to be levied until they are varied or abolished by an Act of the appropriate legislature.\n8. On the omission of the Concurrent Legislative List, the process of devolution of the matters mentioned in the said List to the Provinces shall be completed by the thirtieth day of June, two thousand and eleven.\n9. For purposes of the devolution process under clause (8), the Federal Government shall constitute an Implementation Commission as it may deem fit within fifteen days of the commencement of the Constitution\n(Eighteenth Amendment) Act, 2010.",
    "297": "Article 270AAA: Validation and affirmation of laws etc\n1. The Proclamation of Emergency of 3rd November, 2007, all President's Orders, Ordinances, Chief of\nArmy Staff Orders, including the Provisional Constitution Order No. 1 of 2007, the Oath of Office (Judges) Order, 2007, the amendments made in the Constitution through the Constitution (Amendment) Order, 2007 and all other laws made between the 3rd day of November, 2007 and the date on which the Proclamation of Emergency of the 3rd day of November, 2007, is revoked (both days inclusive), are accordingly affirmed, adopted and declared to have been validly made by the competent authority and notwithstanding anything contained in the Constitution shall not be called in question in any court or forum on any ground whatsoever.\n2. All orders made, proceedings taken, appointments made, including secondments and deputations, and acts done by any authority, or by any person, which were made, taken or done, or purported to have been Made, taken or done, on or after the 3rd day of November, 2007 in exercise of the powers derived from any Proclamation, Provisional Constitution Order No 1 of 2007, President's Orders, Ordinances, enactments, including amendments in the Constitution, notification, rules, orders, bye-haws, or in execution of or in compliance with any orders made or sentences passed by any authority in the exercise or purported exercise of powers as aforesaid, shall, notwithstanding anything contained in the Constitution or any judgment of any court, be deemed to be and always to have been validly made, taken or done and shall not be called in question in any court or forum on any ground whatsoever.\n3. All proclamations, President's Orders, Ordinances, Chief of Army Staff Orders, laws, regulations, enactments, including amendments in the Constitution, notifications, rules, orders or bye-laws in force immediately before the date on which the Proclamation of Emergency of the 3rd day of November, 2007 is\nrevoked, shall continue in force until altered, repealed or amended by the competent authority.\nExplanation.- In this clause, \"competent authority\" means,-\na. in respect of President's Orders, Ordinances, Chief of Army Staff Orders and enactments, including amendments in the Constitution, the appropriate Legislature; and\nb. in respect of notifications, rules, orders and bye-laws, the authority in which the power to make, alter, repeal or amend the same vests under the law.\n4. No prosecution or any other legal proceedings, including but not limited to suits, constitutional petitions or complaints, shall, notwithstanding anything contained in the Constitution or any other law for the time being inforce; lie in any court, forum or authority against any person or authority on account of or in respect of issuance of any of the legal instruments referred to in clause (1) and on account of or in respect of any action taken by the Chief of Army Staff, the President or any other authority in exercise or purported exercise of the\npowers referred to in clause (2).\n5. For the purpose of clauses (1), (2) and (4), all orders made, proceedings taken, appointments made, including secondments and deputation, acts done or purporting to be made, taken or done by any authority\nor person shall be deemed to have been made, taken or done in good faith and for the purpose intended to be served thereby.",
    "298": "Article 270B: Elections to be deemed to be held under Constitution\nNotwithstanding anything contained in the Constitution, the elections held under the Houses of (Parliament) and Provincial Assemblies (Elections) Order, and the Conduct of General Elections Order, 2002 (Chief Executive's Order No.7 of 2002), to the Houses and the Provincial Assemblies, and the General Elections 2008 to the National Assembly and the Provincial Assemblies shall be deemed to have been held under the Constitution and shall have effect accordingly.",
    "299": "Article 270BB: General Elections 2008\nNotwithstanding anything contained in the Constitution or any other law for the time being in force, the General\nElections 2008, to the National Assembly and the Provincial Assemblies held on the eighteenth day of February, two thousand and eight shall be deemed to have been held under the Constitution and shall have effect accordingly",
    "300": "Article 270C: Oath of office of Judges, etc\n1. Notwithstanding anything contained in the Constitution, all persons appointed as Judges of the Supreme Court, High Courts and Federal Shariat Court who have taken oath under the Oath of Office (Judges) Order, 2000 (1 of 2000), or the Oath of Office (Judges) Order, 2007 or not having been given or taken oath under the said Order have ceased to continue to hold the office of a Judge shall be deemed to have been appointed or ceased to continue to hold such office, as the case may be, under the Constitution and such appointment or cession of office shall have effect accordingly.\n2. Notwithstanding anything contained in the Constitution or any other law for the time being in force,-\ni. a Judge including the Chief Justice, of the Supreme court, a High Court or Federal Shariat Court who had, not been given or taken oath under the Oath of Office (Judges) Order, 2007 had ceased to hold office on and with effect from the 3rd day of November, 2007; and\nii. a Judge including the Chief Justice, of the Supreme Court, a High Court and Federal shariat Court appointed and/ or continued as such judge or Chief Justice by virtue of the Oath of Office (Judges) Order, 2007, shall, on revival of the Constitution, take oath as set out in the Third Schedule and shall be deemed to have been appointed, and/ or shall continue to hold office, under the constitution.",
    "301": "Article 271: First National Assembly\n1. Notwithstanding anything contained in the Constitution, but subject to Article 63, Article 64 andArticle223,-\na. the first National Assembly shall consist of-\ni. persons who have taken oath in the National Assembly of Pakistan existing immediately before the commencing day; and\nii. the persons to be elected in accordance with law by the members of the Assembly to fill the seats referred to in clause (2A) of Article 51, and, unless sooner dissolved, shall continue until the fourteenth day of August, one thousand nine hundred and seventy-seven; and reference to \"total membership\" of the National Assembly in the Constitution shall be construed accordingly;\nb. the qualifications and disqualifications for being elected and being a member of the first National Assembly shall, except in case of members filling casual vacancies, or to be elected to the additional seats referred to in clause (2A) of Article 51, after the commencing day, be the same as under the Interim Constitution of the Islamic Republic of Pakistan:\nProvided that no person holding an office of profit in the service of Pakistan shall continue to be a member of the first National Assembly after the expiration of three months from the commencing day.\n2. If a person referred to in paragraph (a) of clause (1) is, immediately before the commencing day, also a member of a Provincial Assembly, he shall not take a seat in the National Assembly or the Provincial Assembly until he resigns one of his seats.\n3. A casual vacancy in a seat in the first National Assembly, including a vacancy in a seat in the National Assembly of Pakistan existing before the commencing day which was not filled before that day, caused by reason of death or resignation of a member or consequent upon his incurring a disqualification or ceasing to be a member as a result of the final decision of an election petition may be filled in the same manner in which it would have been filled before the commencing day.\n4. A person referred to in paragraph (a) of clause (1) shall not sit or vote in the National Assembly until he has made the oath prescribed by Article 65 and, if, without the leave of the Speaker of the National Assembly granted on reasonable cause shown, he fails to make the oath within twenty-one days from the day of the first meeting of the Assembly, his seat shall become vacant at the expiration of that period.",
    "302": "Article 272: First constitution of Senate\nNotwithstanding anything contained in the Constitution, but subject to Article 63 and Article 223,-\na. the Senate shall, until the first National Assembly under the Constitution continues in existence, consist of forty-five members and the provisions of Article 59 shall have effect as if, in paragraph (a) of clause (1) thereof, for the word \"fourteen\" the word \"ten\" and in paragraph (b) of that clause for the word \"five\" the word \"three\", were substituted, and reference to \"total memberships\" of the Senate in the Constitution shall be construed accordingly;\nb. the members elected or chosen as members of the Senate shall be divided into two groups by drawing of lots, the first group consisting of five members from each Province, two members from the Federally Administered Tribal Areas and one member from the Federal Capital and the second group consisting of five members from each Province one member from the said Areas and one member from the Federal Capital;\nc. the term of office of members of the first group and of the second group shall respectively be two years and four years;\nd. the term of office of persons elected or chosen to succeed the members of the Senate at the expiration of their respective terms shall be four years;\ne. the term of office of a person elected or chosen to fill a casual vacancy shall be the unexpired term of the member whose vacancy he is elected or chosen to fill;\nf. as soon as the first general election to the National Assembly is held, there shall be elected to the Senate four additional members from each Province and two additional members from the Federally Administered Tribal Areas; and\ng. the term of office of such half of the members elected under paragraph (f) as may be determined by drawing of lots shall be the unexpired term of office of the members of the first group and the term of office of the other half shall be the unexpired term of the members of the second group.",
    "303": "Article 273: First Provincial Assembly\n1. Notwithstanding anything contained in the Constitution, but subject to Article 63, Article 64 and Article 223,-\na. the first Assembly of a Province under the Constitution shall consist of\ni. the members of the Assembly of that Province in existence immediately before the commencing day, and\nii. the additional members to be elected in accordance with law by the members of the Assembly to fill the seats referred to in clause (3) of Article 106, and, unless sooner dissolved, shall continue until the fourteenth day of August, one thousand nine hundred and seventy-seven; and reference to \"total membership\" of the Assembly of a Province in the Constitution shall be construed accordingly;\nb. the qualifications and disqualifications for membership of the first Assembly of a Province shall, except in case of members filling casual vacancies, or to be elected to the additional seats referred to in clause (3) of Article 106, after the commencing day, be the same as were provided in the Interim Constitution of the Islamic Republic of Pakistan:\nProvided that no person holding an office of profit in the service of Pakistan shall continue to be a member of the Assembly after the expiration of three months from the commencing day.\n2. A casual vacancy in a seat in the first Assembly of a Province, including a vacancy in a seat in the Assembly of that Province in existence immediately before the commencing day which was not filled before that day, caused by reason of death or resignation of a member or consequent upon his incurring a disqualification or ceasing to be a member as a result of the final decision of an election petition may be filled in the same manner in which it would have been filled before the commencing day.\n3. A member referred to in paragraph (a) of clause (1) shall not sit or vote in the Provincial Assembly until he has made the oath prescribed by Article 65 read with Article 127 and, if, without leave of the Speaker of the Provincial Assembly granted on reasonable cause shown, he fails to make the oath within twenty-one days from the day of the first meeting of the Provincial Assembly, his seat shall become vacant at the expiration of that period.",
    "304": "Article 274: Vesting of property, assets, rights, liabilities and obligations\n1. All property and assets which, immediately before the commencing day, were vested in the President or the Federal Government shall, as from that day, vest in the Federal Government unless they were used for purposes which, on that day, became purposes of the Government of a Province, in which case they shall, as\nfrom that day, vest in the Government of the Province.\n2. All property and assets which, immediately before the commencing day, were vested in the Government of a Province, shall, as from that day, continue to be vested in the Government of that Province, unless they were used for purposes, which on that day, became purposes of the Federal Government in which case they shall, as from that day, vest in the Federal Government.\n3. All rights, liabilities and obligations of the Federal Government or of the Government of a Province, whether arising out of contract or otherwise, shall as from the commencing day, continue to be respectively the rights, liabilities and obligations of the Federal Government or of the Government of the Province,\nexcept that\na. all rights, liabilities and obligations relating to any matter which, immediately before that day, was the responsibility of the Federal Government, but which under the Constitution, has become the responsibility of the Government of a Province, shall devolve upon the Government of that Province; and\nb. all rights, liabilities and obligations relating to any matter which, immediately before that day, was the responsibility of the Government of a Province, but which under the Constitution, has become the responsibility of the Federal Government, shall devolve upon the Federal Government.",
    "305": "Article 275: Continuance in office of persons in service of Pakistan, etc\n1. Subject to the Constitution and until law is made under Article 240 any person who, immediately before the commencing day, was in the service of Pakistan shall, as from that day, continue in the service of Pakistan on the same terms and conditions as were applicable to him under the Interim Constitution of the Islamic Republic of Pakistan immediately before that day.\n2. Clause (1) shall also apply in relation to a person holding office immediately before the commencing day as-\na. Chief Justice of Pakistan or other Judge of the Supreme Court, or Chief Justice or other Judge of a High Court;\nb. Governor of a Province;\nc. Chief Minister of a Province;\nd. Speaker or Deputy Speaker of the National Assembly or a Provincial Assembly;\ne. Chief Election Commissioner;\nf. Attorney-General for Pakistan or Advocate-General for a Province; and\ng. Auditor-General of Pakistan.\n3. Notwithstanding anything contained in the Constitution, for a period of six months from the commencing day, a Federal Minister or a Minister of State or the Chief Minister of a Province or a Provincial Minister may be a person who is not a member of Majlis-e-Shoora (Parliament) or, as the case may be, the Provincial Assembly of that Province; and such Chief Minister and Provincial Minister shall have the right to speak and otherwise take part in the proceedings of the Provincial Assembly or any committee thereof of which he may be named a member, but shall not by virtue of this clause be entitled to vote.\n4. Any person who under this Article, is continued in an office in respect of which a form of oath is set out in the Third Schedule shall, as soon as is practicable after the commencing day make before the appropriate person oath in that form.\n5. Subject to the Constitution and law-\na. all civil, criminal and revenue Courts exercising jurisdiction and functions immediately before the commencing day shall, as from that day, continue to exercise their respective jurisdictions and functions;\nand\nb. all authorities and all offices (whether judicial, executive, revenue or ministerial) throughout Pakistan exercising functions immediately before the commencing day shall, as from that day, continue to\nexercise their respective functions.",
    "306": "Article 276: Oath of first President\nNotwithstanding anything contained in the Constitution, the first President may, in the absence of the Chief Justice of Pakistan, make the oath referred to in Article 42 before the Speaker of the National Assembly.",
    "307": "Article 277: Transitional, financial provisions\n1. The schedule of authorized expenditure authenticated by the President for the financial year ending on the\nthirtieth day of June, one thousand nine hundred and seventy-four, shall continue to remain a valid authority for expenditure from the Federal Consolidated Fund for that year.\n2. The President may, in respect of expenditure of the Federal Government for any financial year preceding the Financial year commencing on the first day of July, one thousand nine hundred and seventy-three (being\nexpenditure in excess of the authorized expenditure for that year), authorize the withdrawal of money from the Federal Consolidated Fund.\n3. The provisions of clauses (1) and (2) shall apply to and in relation to a Province, and for that purpose-\na. any reference in those provisions to the President shall be read as a reference to the Governor of the Province;\nb. any reference in those provisions to the Federal Government shall be read as a reference to the Government of the Province; and\nc. any reference in those provisions to the Federal Consolidated Fund shall read as a reference to the Provincial Consolidated Fund of the Province.",
    "308": "Article 278: Accounts not audited before commencing day\nThe Auditor-General shall perform the same functions and exercise the same powers in relation to accounts which have not been completed or audited before the commencing day as, by virtue of the Constitution, he is empowered to perform or exercise in relation to other accounts, and Article 171 shall, with the necessary modifications, apply accordingly.",
    "309": "Article 279: Continuance of taxes\nNotwithstanding anything contained in the Constitution, all taxes and fees levied under any law in force immediately before the commencing day shall continue to be levied until they are varied or abolished\nby Act of the appropriate Legislature."
}